[
  {
    "id": 58496913,
    "published": 1772073533000,
    "title": "Bitcoin Price Explodes Higher, $70K Level Faces Fresh Bullish Assault",
    "body": "Bitcoin price started a major increase above $68,000. BTC is now struggling to clear the $70,000 resistance and might correct some gains. Bitcoin started a fresh increase after it settled above the $67,000 support. The price is trading above $67,500 and the 100 hourly simple moving average. There was a break above a bearish trend line with resistance at $66,500 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might dip again if it trades below the $67,500 and $67,200 levels. Bitcoin Price Rallies 10% Bitcoin price managed to form a base above the $66,000 zone . BTC started a fresh increase and was able to surpass the $67,000 resistance zone. The price even rallied above the $68,000 resistance. Finally, the bears appeared near $70,000. A high was formed at $70,000, and the price is now correcting gains below the 23.6% Fib retracement level of the upward move from the $62,500 swing low to the $70,000 high. Bitcoin is now trading above $67,500 and the 100 hourly simple moving average. If the price remains stable above $67,500, it could attempt a fresh increase. Immediate resistance is near the $68,500 level. The first key resistance is near the $69,200 level. A close above the $69,200 resistance might send the price further higher. In the stated case, the price could rise and test the $70,000 resistance. Any more gains might send the price toward the $71,200 level. The next barrier for the bulls could be $72,200 and $72,500. Another Decline In BTC? If Bitcoin fails to rise above the $68,500 resistance zone, it could start another decline. Immediate support is near the $67,500 level. The first major support is near the $67,200 level or the 50% Fib retracement level of the upward move from the $62,500 swing low to the $70,000 high. The next support is now near the $66,250 zone. Any more losses might send the price toward the $66,000 support in the near term. The main support now sits at $65,500, below which BTC might struggle to recover in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $67,500, followed by $67,200. Major Resistance Levels – $68,500 and $69,200.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58497614,
    "published": 1772074813000,
    "title": "How Vitalik Buterin’s 11,422 ETH Liquidation Is Testing Ethereum’s Bear Market Absorption – Details",
    "body": "Ethereum has faced persistent selling pressure throughout the year, with price action repeatedly failing to reclaim the $2,000 level. Despite intermittent rebound attempts, momentum has remained weak, reflecting cautious sentiment across both retail and institutional participants. The broader market environment — characterized by tightening liquidity, macro uncertainty, and subdued risk appetite — has further complicated Ethereum’s recovery path, leaving the asset locked in a fragile consolidation phase. Related Reading: Why XRP’s 0.16 Leverage Floor Ends The Era Of The Flash Crash – And the Hope for a Quick Recovery Recent on-chain data has added another layer to this narrative. According to blockchain analytics platform Arkham, Ethereum co-founder Vitalik Buterin has sold an additional 675.88 ETH, worth roughly $1.25 million, in the past several hours. Over the last month alone, his total ETH sales have reached approximately 11,422 ETH, equivalent to about $23.33 million at prevailing market prices. Buterin remains one of the most influential figures in the Ethereum ecosystem, widely recognized as the protocol’s principal architect and a key voice in its technical and strategic direction. Transactions associated with such prominent insiders often attract attention because they can influence market sentiment, even when motivated by operational, philanthropic, or diversification needs rather than outright bearish positioning. Vitalik’s Ethereum Distribution Progress Nears Completion On-chain tracking suggests that Vitalik Buterin’s recent transactions are part of a broader planned distribution totaling approximately 16,384 ETH. Based on the latest observed transfers, roughly 70% of that amount appears to have already been executed. This leaves an estimated 4,962 ETH — valued near $9.5 million at current prices — potentially still pending. While these figures depend on wallet attribution accuracy, they provide a useful framework for interpreting recent market flows. From a market-structure perspective, such activity does not automatically imply directional intent. Large transfers from prominent figures often trigger short-term sentiment reactions because participants anticipate potential sell-side liquidity. However, historical precedent shows that founder-related transactions frequently relate to treasury management, ecosystem funding, or diversification rather than speculative positioning. In the near term, awareness that additional ETH may still enter the market can contribute to cautious positioning among traders, particularly in a fragile liquidity environment. Some participants may reduce exposure preemptively, which can amplify volatility even if actual selling volume remains moderate relative to total market depth. At the same time, markets typically absorb known supply events over time. If the remaining distribution proceeds gradually and demand remains stable, the overall price impact may remain contained rather than structurally bearish. Related Reading: The $33 Billion Drain: Bitcoin Realized Cap Craters as Capital Abandons the Network for a Second Month Price Tests Long-Term Support As Weekly Momentum Remains Under Pressure Ethereum continues to trade under sustained pressure, with price now hovering near the $1,900 zone after failing to reclaim the $2,000 psychological threshold. The weekly chart shows a clear loss of momentum following the rejection near the $3,500–$4,000 region earlier in the cycle, with lower highs and lower lows defining the current structure. This pattern typically reflects a transition from expansion to consolidation or corrective behavior rather than an immediate trend reversal. From a moving-average perspective, ETH is trading below the 50-week and 100-week averages, both of which are beginning to slope downward. This alignment generally signals weakening intermediate-term momentum. The 200-week average remains below price but is approaching as potential structural support, making this zone particularly relevant for longer-term positioning. Related Reading: The Saylor Discount: Why Bitcoin Trading Below Strategy’s Realized Price is a Gift for Late-Cycle Allocators Volume dynamics suggest increased activity during recent selloffs, indicating distribution rather than passive consolidation. However, there are early signs of stabilization as volatility compresses, often a precursor to either continuation or a relief rebound. If Ethereum fails to reclaim the $2,000–$2,200 region convincingly, downside probes toward the long-term average remain plausible. Conversely, sustained acceptance above that level would be required to rebuild bullish momentum and restore confidence among sidelined capital. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum News|ETH|ethereum|ethereum news|Ethereum Vitalik Buterin|Ethereum Whale Activity|ETHUSDT|Vitalik Buterin news|Vitalik Selling ETH",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58498437,
    "published": 1772076111000,
    "title": "Buterin explains 4-year roadmap for faster, quantum-resistant Ethereum",
    "body": "“The goal is to decouple slots and finality, to allow us to reason about both separately,” explained Ethereum co-founder Vitalik Buterin.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58498285,
    "published": 1772075884000,
    "title": "Aave crosses $1T in lending as it seeks more bank, fintech integrations",
    "body": "Aave continues to lead DeFi lending, with $27.2 billion in user value secured and $83.3 million in fees over the past 30 days, nearly four times more than its closest competitor.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58498709,
    "published": 1772076884000,
    "title": "ETHZilla Drops Ethereum Treasury Label in Rebrand After Share Price Collapse",
    "body": "The move follows investor exits, asset sales and a retreat from holding Ethereum on the public company's balance sheet.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 208,
        "NAME": "ADMINISTRATIVE EVENTS",
        "CATEGORY": "ADMINISTRATIVE EVENTS"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58499875,
    "published": 1772079530000,
    "title": "XRP Price Rally Accelerates, $1.50 Resistance Could Decide Next Move",
    "body": "XRP price started a decent increase above $1.40. The price is now consolidating gains and might aim for more gains above the $1.50 zone. XRP price started a decent upward move above the $1.420 zone. The price is now trading above $1.4250 and the 100-hourly Simple Moving Average. There was a break above a key bearish trend line with resistance at $1.3820 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move up if it settles above $1.50. XRP Price Rally Reaches Resistance XRP price started a fresh upward move above $1.40 and $1.420, like Bitcoin and Ethereum . The price gained pace for a clear move above the $1.450 resistance. There was a break above a key bearish trend line with resistance at $1.3820 on the hourly chart of the XRP/USD pair. The bulls even pumped the price toward the $1.50 zone. A high was formed at $1.4936 and the price started a consolidation phase. There was a drop below the 23.6% Fib retracement level of the upward move from the $1.3125 swing low to the $1.4936 high. The price is now trading above $1.420 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $1.460 level. The first major resistance is near the $1.50 level, above which the price could rise and test $1.5450. A clear move above the $1.5450 resistance might send the price toward the $1.650 resistance. Any more gains might send the price toward the $1.720 resistance. The next major hurdle for the bulls might be near $1.80. Another Decline? If XRP fails to clear the $1.460 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.420 level. The next major support is near the $1.4030 level or the 50% Fib retracement level of the upward move from the $1.3125 swing low to the $1.4936 high. If there is a downside break and a close below the $1.4030 level, the price might continue to decline toward $1.3820. The next major support sits near the $1.3430 zone, below which the price could continue lower toward $1.320. Technical Indicators Hourly MACD – The MACD for XRP/USD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $1.420 and $1.4030. Major Resistance Levels – $1.460 and $1.50.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58501395,
    "published": 1772082490000,
    "title": "Dogecoin (DOGE) Strengthens as Altcoin Rally Signals Renewed Risk Appetite",
    "body": "Dogecoin started a major increase above $0.10 against the US Dollar. DOGE is now consolidating and might decline again if it fails to clear $0.1060. DOGE price started a fresh increase above $0.0950 and $0.10. The price is trading above the $0.10 level and the 100-hourly simple moving average. There was a break above a bearish trend line with resistance at $0.0942 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could aim for a fresh increase if it remains stable above $0.0988. Dogecoin Price Consolidates Gains Dogecoin price started a fresh increase after it settled above $0.0950, like Bitcoin and Ethereum . DOGE climbed above the $0.0980 resistance to enter a positive zone. There was also a break above a bearish trend line with resistance at $0.0942 on the hourly chart of the DOGE/USD pair. The bulls were able to push the price above $0.10. A high was formed at $0.1061 and the price is now correcting some gains. There was a move below the 23.6% Fib retracement level of the upward move from the $0.0910 swing low to the $0.1061 high. Dogecoin price is now trading above the $0.10 level and the 100-hourly simple moving average. If there is another increase, immediate resistance on the upside is near the $0.1028 level. The first major resistance for the bulls could be near the $0.1050 level. The next major resistance is near the $0.1080 level. A close above the $0.1080 resistance might send the price toward $0.1120. Any more gains might send the price toward $0.120. The next major stop for the bulls might be $0.1220. Another Decline In DOGE? If DOGE’s price fails to climb above the $0.1050 level, it could start a downside correction. Initial support on the downside is near the $0.10 level. The next major support is near the $0.0.988 level or the 50% Fib retracement level of the upward move from the $0.0910 swing low to the $0.1061 high. The main support sits at $0.0950. If there is a downside break below the $0.0950 support, the price could decline further. In the stated case, the price might slide toward the $0.0920 level or even $0.090 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now losing momentum in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now above the 50 level. Major Support Levels – $0.0988 and $0.0.950. Major Resistance Levels – $0.1050 and $0.1120.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "DOGE|DOGE news|Doge price|DOGE USD|DOGE/BTC|DOGE/USDT|Dogecoin|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58501382,
    "published": 1772082401000,
    "title": "Blockchains may need 1B TPS to support AI agent future: Stripe",
    "body": "Stripe executives Patrick and John Collison expect blockchain network demands to increase significantly as adoption and use of AI agents grow in the future.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 58501080,
    "published": 1772082015000,
    "title": "Digital Gold Is Dead: The Institutional Architecture Binding Bitcoin To The Nasdaq In The 2026 Downturn",
    "body": "Bitcoin continues to struggle to push decisively above the $66,000 level as persistent selling pressure weighs on sentiment across the crypto market. Despite intermittent rebound attempts, momentum remains weak, with buyers showing limited conviction while volatility stays elevated. The broader environment — shaped by cautious liquidity conditions, macro uncertainty, and restrained risk appetite — has kept Bitcoin locked in a consolidation phase rather than a sustained recovery trend. Related Reading: Why XRP’s 0.16 Leverage Floor Ends The Era Of The Flash Crash – And the Hope for a Quick Recovery Increasingly, Bitcoin is not behaving like “digital gold,” a narrative that dominated market discourse for years. Instead of acting as a defensive asset during periods of economic stress, Bitcoin has recently traded in closer alignment with equity markets, particularly technology stocks. This correlation suggests that capital is treating Bitcoin more as a high-beta risk asset than as a store of value comparable to precious metals. This shift challenges a long-standing thesis within the crypto ecosystem. While the digital gold narrative remains influential, current price behavior indicates that liquidity cycles, institutional positioning, and broader macro risk dynamics are exerting stronger short-term influence. Whether Bitcoin eventually reclaims its perceived safe-haven role or continues behaving like a risk asset will likely depend on evolving macro conditions and investor positioning. Correlation With Nasdaq Highlights Structural Shift According to On-Chain Mind, Bitcoin’s correlation with the Nasdaq has structurally tightened since 2020, marking a significant shift in how capital allocates to the asset. While earlier cycles showed more episodic alignment, recent data reveals that BTC now frequently trades in tandem with technology equities. Notably, the sharpest correlation spikes have tended to coincide with broader market drawdowns, particularly during bear market phases. This pattern is critical. In theory, an asset positioned as “digital gold” would be expected to decorrelate from risk assets during periods of stress. Instead, the data suggests the opposite: when liquidity contracts and equities sell off, Bitcoin often follows. These synchronized declines indicate that institutional capital increasingly treats BTC as part of the broader risk complex rather than as an independent hedge. Whether this development aligns with ideological expectations is secondary. The reality is that capital flows, portfolio construction frameworks, and macro-driven positioning now play a dominant role in Bitcoin’s price formation. Large allocators appear to manage BTC exposure alongside growth equities, responding to the same liquidity signals, rate expectations, and volatility regimes. Until correlation regimes shift meaningfully, Bitcoin’s behavior is likely to remain closely tied to macro risk cycles rather than to traditional safe-haven dynamics. Related Reading: The $33 Billion Drain: Bitcoin Realized Cap Craters as Capital Abandons the Network for a Second Month Bitcoin Price Structure Shows Persistent Downtrend Pressure Bitcoin continues to trade under clear technical pressure, with price action struggling to reclaim the $66,000–$67,000 zone after a sharp corrective move from late-2025 highs. The weekly chart shows a decisive break below the 50-week moving average, followed by rejection near that level, which now acts as dynamic resistance rather than support. This shift typically reflects weakening medium-term momentum. Price is currently hovering just above the 200-week moving average, a level historically associated with major cycle support. While this area often attracts strategic buyers, repeated tests without strong rebounds can weaken its effectiveness. Volume spikes during recent downside moves suggest distribution rather than accumulation, although confirmation would require sustained follow-through. Related Reading: The Saylor Discount: Why Bitcoin Trading Below Strategy’s Realized Price is a Gift for Late-Cycle Allocators Market structure also shows a sequence of lower highs since the peak near the $120K region, indicating that bullish continuation has stalled. Until Bitcoin reclaims the mid-$70K range and stabilizes above key moving averages, rallies may remain corrective rather than trend-reversing. That said, proximity to long-term support means volatility could increase. Either a structural rebound or a deeper capitulation phase remains possible, depending largely on liquidity conditions, macro sentiment, and institutional positioning in the coming weeks. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin digital gold|bitcoin gold|Bitcoin news|btc|BTCUSDT|digital gold",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58501864,
    "published": 1772083398000,
    "title": "Uniswap’s UNI jumps 15% as governance vote to expand fee switch gains momentum",
    "body": "A governance proposal would activate protocol fees across eight additional chains and automate fee collection on all v3 pools, potentially adding an estimated $27 Million in annualized revenue.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Uniswap Foundation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58502432,
    "published": 1772084291000,
    "title": "Jane Street's Two-Continent Problem: Barred In India, Sued In Crypto",
    "body": "The Terraform insider trading lawsuit echoes a strategy that India's securities regulator already documented in a 105-page enforcement order.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 58502397,
    "published": 1772084178000,
    "title": "Wall Street is loud about crypto, but investors aren’t listening: Bitwise",
    "body": "“They’ve heard the promises of institutional adoption for so long that they no longer register,\" said Bitwise's Matt Hougan.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58503226,
    "published": 1772085654000,
    "title": "Bitcoin Yet To See Meaningful Capital Return, Glassnode Says",
    "body": "On-chain analytics firm Glassnode has highlighted how accumulation from the large Bitcoin entities has remained relatively weak recently. Bitcoin Accumulation Trend Score Has Been Struggling To Break 0.5 In a new post on X, Glassnode has talked about the latest trend in the Accumulation Trend Score for Bitcoin. This on-chain indicator tracks whether BTCinvestors are accumulating or distributing right now. The metric calculates its value by looking at the balance changes happening in the wallets of the investors. Additionally, it also accounts for the size of the wallets themselves. This second weighting factor means that larger entities have a stronger influence on the indicator. Related Reading: Bitcoin Nears Death Cross That Preceded Final Bear Market Legs When the value of the Accumulation Trend Score is greater than 0.5, it means large investors (or a large number of small entities) are accumulating. The closer the metric is to 1, the stronger this behavior is. On the other hand, the indicator being under 0.5 implies that distribution is the dominant behavior on the network. The extreme point on this side of the scale lies at 0. Now, here is the chart shared by Glassnode that shows how the Bitcoin Accumulation Trend Score has changed over the course of the cycle: As displayed in the above graph, the Bitcoin price crash in November saw the Accumulation Trend Score take on a dark purple color. Here, a light yellow shade on the indicator reflects a value close to zero, while a dark purple one to a value near 1. Thus, it would appear that the market reacted with a near-perfect accumulation behavior to the November price lows. While December saw continued accumulation, a shift occurred in January; the price recovery rally was met with distribution as the Accumulation Trend Score turned orange-yellow. The cryptocurrency’s price has plummeted since the onset of this selling pressure. The price crash has been met with some accumulation, but from the chart, it’s visible that the indicator’s color has still only been red. “The Accumulation Trend Score has struggled to push above 0.5 since early February,” noted the analytics firm. While the current value suggests aggressive distribution is no longer happening, it’s not necessarily a sign of a return of demand for Bitcoin, either. As Glassnode explained, the trend reflects “persistently weak accumulation, particularly among larger entities, signalling that meaningful capital has yet to step back in.” It now remains to be seen how long the current neutral market behavior will continue and which way the next shift will lean. Related Reading: Bitcoin Capitulation Persists As Short-Term Holders Realize $0.48B Daily Losses BTC Price Bitcoin slipped under the $63,000 level on Tuesday, but the market has rebounded since then as the cryptocurrency’s price has returned to $65,300. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin accumulation|Bitcoin Accumulation Trend Score|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58505334,
    "published": 1772089259000,
    "title": "Coinbase Stablecoin Revenue Could Surge 7x Under GENIUS Act, Bloomberg Analysts Say",
    "body": "Cryptocurrency exchange Coinbase (COIN) could be one of the biggest corporate beneficiaries of the United States’ first comprehensive crypto legislation, the GENIUS Act, which was signed into law in July 2025 and established a federal framework for stablecoin issuance and oversight. Coinbase Stablecoin Revenue Jumps 48% According to Bloomberg analysts Paul Gulberg and Samuel Radowitz, the new framework may significantly strengthen Coinbase’s fast-growing stablecoin business, particularly if adoption of dollar-backed tokens expands into mainstream payments. Related Reading: Bitcoin May Be In A Price Slump—But Adoption Is In A Bull Market In 2025, Coinbase generated an estimated $1.35 billion in revenue tied to stablecoins, a 48% increase from $911 million in 2024. That segment represented 19% of the company’s total annual revenue, underscoring how important stablecoins have become to the exchange’s overall business model. Unlike trading fees, which tend to rise and fall sharply alongside crypto market volatility, stablecoin-related income is derived from interest earned on reserves backing Circle’s USDC. Those reserves are primarily invested in US Treasuries and other low-risk instruments, producing yield. Coinbase receives a significant share of that interest income, making the business more predictable and generally higher margin than transaction-based revenue. The importance of this revenue stream became particularly evident in late 2025. During a period when Bitcoin (BTC) and broader crypto prices declined sharply, and Coinbase’s fourth-quarter revenue dropped 20%, income generated from stablecoins remained comparatively stable. Paul Gulberg and Samuel Radowitz argue that this consistency could become even more meaningful if regulatory clarity accelerates broader USDC adoption. GENIUS Act Expected To Accelerate USDC Growth The GENIUS Act is central to that outlook. By providing a national regulatory structure for stablecoin issuers, the legislation could remove barriers that have limited the use of USDC in areas such as cross-border payments and merchant settlements. If businesses and financial institutions adopt stablecoins more widely for real-world transactions, the overall supply of USDC could expand substantially. An increase in USDC circulation would require additional reserves to back those tokens, which in turn would generate more interest income from the underlying Treasury holdings. Because Coinbase shares in that yield, greater adoption directly translates into higher potential revenue. Bloomberg analysts estimate that under favorable conditions, Coinbase’s USDC-related revenue could grow by two to seven times its current level. Related Reading: Expert Forecasts $5 Trillions Pouring Into Crypto Post CLARITY Act Passage Yet, reaching the upper end of that projection depends on whether Coinbase can continue offering rewards to customers who hold USDC. If customer reward mechanisms remain in place, analysts believe USDC adoption could accelerate more rapidly. However, even if those programmes are limited or scaled back in the ongoing negotiations on the CLARITY Act, the clearer regulatory environment created by the GENIUS Act is still expected to support meaningful growth in stablecoin usage. At the time of writing, the exchange’s stock, trading under the ticker name COIN, surged towards $185 during Wednesday’s trading session, marking a 22% increase in the 24-hour time frame. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Coinbase|Circle USDC|coin|coinbase|coinbase news|Coinbase stablecoin news|crypto|crypto analyst|crypto market|crypto news|cryptocurrency|Stablecoins|USDC",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58505415,
    "published": 1772089200000,
    "title": "Sygnum eyes $100B DAT sector with treasury management services",
    "body": "The Swiss crypto bank will handle strategic asset allocation for corporate crypto treasuries and is already actively managing $200 million in volume at launch.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58507293,
    "published": 1772092662000,
    "title": "Is XRP price setting up for a 20% bounce in March?",
    "body": "A convincing bullish reversal setup and hints of easing whale distribution may push the price of XRP up by 20% or more in March.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Market Analysis",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58507406,
    "published": 1772092845000,
    "title": "Cardano Sharks & Whales Quietly Accumulate 819M ADA Amid Price Decline",
    "body": "On-chain data shows the Cardano sharks and whales have quietly been accumulating the asset even as the price has gone through a drawdown. Cardano Sharks & Whales Have Increased Supply Share By 1.6% In a new post on X, on-chain analytics firm Santiment has talked about the latest trend in the supply of the Cardano sharks and whales. The indicator of interest here is the “Supply Distribution,” which tells us about the amount of the ADA circulating supply that’s held by a given wallet group. Related Reading: Bitcoin Yet To See Meaningful Capital Return, Glassnode Says Addresses or investors are divided into these cohorts based on the number of tokens that they are carrying in their balance. The 1 to 10 coins cohort, for instance, includes the wallets owning between 1 and 10 ADA. In the context of the current topic, the range of interest is the 100,000 to 100 million coins one. At the current exchange rate, its lower end converts to $30,400 and upper one to $30.4 million. Given the scale involved, the range would cover some of the key investors of the market holding a notable amount. Holders of this kind are popularly called the sharks and whales. Moves from these traders can sometimes have an effect on the market, so they can be worth keeping an eye on. If nothing else, the behavior of these groups can be revealing about the sentiment among the influential entities. Now, here is the chart shared by Santiment that shows the trend in the Supply Distribution of the Cardano sharks and whales over the last few months: As displayed in the above graph, the Cardano sharks and whales have seen their Supply Distribution rise over the last few months, indicating that the large investors have been accumulating. More specifically, the sharks and whales have added 819.4 million tokens (currently worth $248 million) to their wallets over the last six months. This has taken their supply share of the cryptocurrency from 66.84% to 68.44%. Interestingly, while the sharks and whales have expanded their supply during this window, the asset’s price has witnessed a significant drawdown instead. The timing could suggest that the key investors have been looking at the price decline as an opportunity to enter at lower levels. Related Reading: Bitcoin Nears Death Cross That Preceded Final Bear Market Legs From the chart, it’s visible that the accumulation trend has become particularly steep this month. It now remains to be seen whether this buying will pay off for the Cardano sharks and whales or if the asset will go lower still. ADA Price Cardano has observed a strong surge of 14% during the last 24 hours that has taken its price to $0.30. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cardano|ADA|ADAUSDT|Cardano Sharks|Cardano Sharks & Whales|Cardano whales",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58507513,
    "published": 1772092800000,
    "title": "Deutsche Bank-backed AllUnity launches Swiss franc stablecoin CHFAU",
    "body": "Initially available to institutions via the AllUnity Mint Platform, CHFAU stablecoin launches under MiCA compliance after securing a license from the German regulator, BaFin.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58508733,
    "published": 1772094912000,
    "title": "Whale loses $8.2M trying to squeeze thin liquidity ARC market on Lighter",
    "body": "A massive leveraged long in the ARC perpetuals market collapsed on Lighter, triggering auto-deleveraging but limiting liquidity provider losses to about $75,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 58509465,
    "published": 1772096454000,
    "title": "Bitcoin Price Surges 8% — Key Drivers Behind The Recovery Toward $70,000",
    "body": "The cryptocurrency market staged a broad recovery on Wednesday, led by a sharp rebound in the Bitcoin price that pushed the digital asset close to the $70,000 level once again. Bitcoin climbed roughly 8% on the day, approaching a price zone that has acted as firm resistance since it was lost earlier this month. The renewed strength was not limited to Bitcoin. Ethereum (ETH) advanced 12%, XRP gained 8%, and Solana (SOL) surged 13%, reflecting a wider return of risk appetite across digital assets. Bitcoin Price Nears $70K As Altcoins Outperform Market experts suggest the bounce may be driven largely by investors stepping in after an extended period of weakness. Caroline Mauron, co-founder of Orbit Markets, told Bloomberg that the upward move likely reflects dip-buying activity following the recent selloff. She added that a decisive move back above $70,000 for the Bitcoin price could alter the broader market narrative, potentially restoring confidence after weeks of pressure. Related Reading: Bitcoin May Be In A Price Slump—But Adoption Is In A Bull Market Recent trading patterns also suggest a change in investor positioning. Although demand for cryptocurrencies in the US has softened in recent weeks, it seems that capital is now rotating into altcoins, as evidenced by the gains made by ETH, XRP and SOL, which have outperformed Bitcoin in the last 24 hours. Daniel Reis-Faria, chief executive officer of ZeroStack, noted that Bitcoin increasingly trades within the context of the broader financial system. When liquidity conditions tighten, he said, volatility tends to increase. In that environment, assets such as Solana — which he described as generating “real yield” — may prove more resilient than tokens that were previously driven primarily by momentum. Still, some analysts caution against interpreting the rebound as a definitive turning point. Is Bitcoin Forming A New Bottom? Alex Kuptsikevich, chief market analyst at FxPro, drew comparisons to the market environment in 2022, when a steep decline was followed by months of sideways consolidation before a sustained recovery eventually took hold. He observed that after the 2022 Bitcoin price downturn, it took more than a year for the market to regain and surpass prior highs, suggesting patience may be required this time as well. Galaxy Digital’s head of research, Alex Thorn, offered a nuanced view in his latest Bitcoin price outlook. He argued that the most intense phase of downside pressure is likely already behind the market. Among the supportive signals he cited were Bitcoin trading near its 200-week moving average (MA) and realized price, historically important technical levels. Related Reading: Expert Forecasts $5 Trillions Pouring Into Crypto Post CLARITY Act Passage In addition, more than half of all Bitcoin in circulation is currently underwater, the relative strength index has reached levels often associated with capitulation, and several other on-chain indicators are flashing signs that a bottom may be forming. However, Thorn also warned that even if the worst of the decline has passed, further challenges could lie ahead for the Bitcoin price. He said that market bottoms typically take time to fully develop, and prolonged sideways movement remains a possibility. A downturn in equities could exert additional pressure on digital assets, and the broader market still appears to lack a strong catalyst to drive sustained upside momentum. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin chart|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news|cryptocurrency|ETH|ethereum|Sol|Solana|xrp|XRP Price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58511514,
    "published": 1772100048000,
    "title": "XRP Rally Incoming? Analyst Forecasts March-April Recovery If This Level Breaks",
    "body": "During the Wednesday market recovery, XRP surged 7.9% to hit a one-week high of $1.47. The cryptocurrency has been hovering between $1.35-$1.50 over the past three weeks but has failed to break above the local range’s upper boundary. As the price nears this resistance once again, an analyst has suggested that a short-term rally toward another critical level could be brewing, potentially setting the stage for the altcoin to decide its next market direction by the end of Q2. Related Reading: The ‘Next-Generation Trading Chain’: BNB Chain Eyes 2026 Optimization Following Strong Ecosystem Momentum XRP To See March Breakout On Wednesday, analyst ChartNerd called for a short-term 20%-30% XRP rally in the next month or two, affirming that “relief is overdue” after six months of continuous downside pressure. In a video analysis, the market observer affirmed that the cryptocurrency is attempting to build a base within its local range to retest a crucial resistance level after losing the $1.80-$2.00 area as support in January. As he explained, XRP is attempting to form an ascending triangle or double bottom pattern in the daily timeframe, with the formation’s neckline sitting around the $1.50 mark. Based on this, if the altcoin “coils up inside this triangle and eventually gets a breakout heading into March, this is where the potential lies of rallying back up to $1.80” to retest this previous area of support as resistance. Meanwhile, if the cryptocurrency is forming a double bottom pattern, the analyst noted that “even a retrace to the $1.20 level would still mark a higher low before a short-term bullish reversal.” In both cases, breaking out of the $1.50 resistance would validate a move toward the $1.80-$2.00 area, which he considers “a critical inflection point” as XRP held it as support for 400 days. It would be a critical inflection point. I mean, potentially, we could respect some sort of ascending channel here as well, leading into March, which is what may guide us up to that $1.80 resistance. (…) If XRP does sort of respect these trend lines, it’s resistance. We’re back at support. Is A Critical Retest Ahead? Despite the bullish outlook, ChartNerd warned that XRP still risks a correction of up to 50%. Per the analyst, the $1.80 retest will determine whether this area has turned into resistance and the price will continue to go lower, or if it will be reclaimed and push to higher levels. “If the rally into $1.80/$2 unfolds in March/April, that will be the telltale sign of whether $0.70 is on the cards or not. Breaking cleanly above $2 signals strength and invalidation of that potential. Rejecting it as resistance would then cause a potential $0.70 drop,” he added on X. A reclaim of this key area as support could open the doors for a retest of the golden $2.40-$2.70 range, not visited since the Q4 2025 crash. It could also signal that the corrective period may be over. Related Reading: Bitcoin Positioned For More Pain Following Weekly Close Below This Critical Level However, he recently cautioned that losing the 200-week Exponential Moving Average (EMA) in the weekly timeframe and confirming it as resistance has historically signaled a major drop toward the $0.70 area. In previous cycles, XRP entered a deep corrective move when it failed to hold this level, crashing around 50% to its bear market bottom. Therefore, he emphasized that the cryptocurrency needs a convincing reclaim of its crucial area to invalidate this potential outcome. As of this writing, XRP is trading at $1.46, a 2.7% increase on the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto analyst|Crypto bear market|crypto market correction|Crypto Market Recovery|xrp|XRP Breakout|XRP Correction|XRP Price|XRP Price Anaysis|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58511692,
    "published": 1772100043000,
    "title": "Bitcoin ETFs regain momentum with $507M inflows as BTC reclaims $68K",
    "body": "The fresh inflows lift US Bitcoin ETFs toward a potential first weekly gain after five consecutive weeks of outflows totaling $3.8 billion.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58512223,
    "published": 1772101151000,
    "title": "Gate adds Malta payments license to expand EU fiat and stablecoin rails",
    "body": "The license allows Gate to execute payment transactions in the EU, including direct debits and credit transfers under PSD2 rules.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58513565,
    "published": 1772103497000,
    "title": "Bitcoin Selling Pressure Weakens as U.S. Spot ETFs Draw in $506M",
    "body": "Bitcoin demand has rebounded for the first time since November as ETF inflows hit $506M and Coinbase premium flips positive.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58514080,
    "published": 1772104049000,
    "title": "Indiana lawmakers pass crypto rights bill banning discriminatory taxes",
    "body": "Indiana’s HB 1042 cleared both chambers and heads to Governor Mike Braun, limiting crypto-specific taxes and opening the door to crypto options for retirement accounts.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58513678,
    "published": 1772103653000,
    "title": "Circle Tops Q4 Revenue Forecasts, Shares Surge 30% — Key Numbers Inside",
    "body": "Shares of Circle Internet Group (CRLC) climbed nearly 30% during Wednesday’s trading session after the company delivered fourth-quarter (Q4) 2025 results that comfortably exceeded Wall Street expectations. The strong earnings report, driven largely by growth in its USDC stablecoin and higher reserve income, pushed the stock to around $79.13 at the time of writing, marking a 29.2% gain over the past 24 hours. Circle Earnings Soar On USDC Expansion For the fourth quarter, Circle reported earnings of $0.43 per share, sharply ahead of the $0.16 per share analysts had projected. Total revenue and reserve income reached $770 million, representing a 77% increase compared with the same period a year earlier and surpassing consensus estimates of $747.4 million. Growth in USDC circulation and transaction activity played a central role in the company’s performance. By the end of 2025, USDC in circulation had risen to $75.3 billion, a 72% year-over-year (YoY) increase. Related Reading: Bitcoin May Be In A Price Slump—But Adoption Is In A Bull Market On-chain transaction volume involving USDC reached $11.9 trillion in the fourth quarter alone, up 247% from the prior year’s quarter. Net income from continuing operations totaled $133 million in Q4, an improvement of $129 million compared with the previous year. Adjusted EBITDA for the quarter came in at $167 million, up 412% YoY. Looking at the full fiscal year, Circle generated $2.7 billion in total revenue and reserve income in 2025, a 64% increase compared with 2024. Despite that top-line growth, the company posted a net loss from continuing operations of $70 million for the year. That figure was significantly affected by $424 million in stock-based compensation expenses tied to vesting conditions triggered by its 2025 initial public offering (IPO). By comparison, Circle had recorded net income of $157 million from continuing operations in 2024. On an adjusted basis, EBITDA for the full year rose 104% to $582 million. CEO’s Long-Term Vision Jeremy Allaire, Circle’s co-founder, CEO, and chairman, described the quarter as another milestone in the company’s long-term strategy. He said the results reflect continued progress in building infrastructure for what he called an open and programmable internet-based financial system. According to Allaire, USDC adoption has expanded across enterprises, developers, and public institutions, with digital dollars increasingly used for payments, treasury management, and on-chain financial operations. Related Reading: Expert Forecasts $5 Trillions Pouring Into Crypto Post CLARITY Act Passage The executive also pointed to advancements toward launching the Arc mainnet, rising transaction volume across Circle’s CPN network, and growing traction for the company’s euro-backed stablecoin EURC and tokenized treasury product USYC. Circle, which went public on the New York Stock Exchange (NYSE) in June last year, has experienced significant volatility since its debut. Although the latest rally lifted shares close to $79, the stock remains roughly 73% below its all-time high of $299, reached just weeks after its market debut. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Crypto|circle|Circle CEO Jeremy Allaire|Circle CRLC|Circle news|Circle Q4 report|Circle USDC|CRCL|CRCL news|CRCL price|crypto|crypto market|crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58514782,
    "published": 1772105331000,
    "title": "Bitcoin traders explain why $80K is the next target for bulls",
    "body": "The return of spot Bitcoin ETF inflows may fuel a BTC price recovery, as signs of a potential rebound to $75,000-$80,000 emerge.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Market Analysis",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58516327,
    "published": 1772108134000,
    "title": "Middle East tensions boost gold as investors seek safe havens",
    "body": "Escalating US-Iran tensions are boosting safe-haven demand, with gold attracting investors while equities and Bitcoin face pressure.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58517123,
    "published": 1772109608000,
    "title": "STS Digital raises $30 million to expand crypto options platform",
    "body": "The Bermuda-based firm offers trading across 400+ cryptocurrencies with spot, vanilla, and exotic options, targeting institutional demand as crypto options open interest reaches $40 billion.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Crypto Options Trading|Fundraise|Derivatives|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58517862,
    "published": 1772110807000,
    "title": "Bitcoin Breaks Past $69,000 As Wall Street Steadies And ETF Money Returns",
    "body": "Bitcoin climbed to $69,550 on Wednesday, its highest point in over a week, after a sharp swing upward from around $62,350 in less than a day. The move came as US stock markets turned green again, giving investors across the board a reason to buy back in. Related Reading: Crypto’s Biggest Bull Run Could Come From The Most Unexpected Place: AI Bubble ETF Cash Returns After Five Weeks Of Outflows One of the clearest signs of renewed confidence came from the spot Bitcoin exchange-traded fund market. Reports say US-listed Bitcoin ETFs pulled in $257.7 million in a single day on Tuesday — a notable turnaround after five straight weeks of withdrawals that had drained roughly close to $4 billion from those same funds. Fidelity drew approximately $83 million of that total. BlackRock’s iShares Bitcoin Trust attracted close to $79 million. The return of institutional buying added fuel to a rally already building on the back of a calmer macro backdrop. The broader stock market’s recovery was partly tied to US President Donald Trump’s State of the Union address on Tuesday night, in which he described his first year in office as an economic success. He pointed to falling mortgage rates and a 1.7% drop in core inflation over the final three months of 2025. Markets took the speech as a sign that the policy chaos seen in recent months — particularly around tariffs and court battles — might be settling down. Spot Buyers, Not Speculators, Are Behind This Rally What makes this price move stand out is the data beneath the surface. Reports note that Bitcoin’s aggregated open interest — a measure of outstanding futures positions — has actually been declining even as prices climbed. It fell from above 240,000 BTC earlier in the week to around 235,167 BTC. That kind of drop suggests traders with borrowed money were closing out positions rather than opening new ones. Funding rates tell a similar story. They remain slightly negative at around -0.0037%, meaning short sellers are currently paying fees to traders betting on higher prices. That is an unusual setup during a strong rally, and it points to a market where aggressive speculation has been squeezed out rather than amplified. Related Reading: Bullish Signal? Coinbase Bitcoin Premium Turns Positive After Months In Red Ticking Upward The cumulative volume delta — which tracks whether buyers or sellers are more aggressive on spot markets — has been ticking upward, confirming that real purchasing activity is driving the move. According to market experts, options market dynamics are also playing a role. Dealers holding what is known as a positive gamma position tend to buy when prices dip and sell when prices rise, as part of routine hedging. That behavior acts as a natural shock absorber, smoothing out big swings and making explosive breakouts harder to sustain in either direction. Featured image from Yellow, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|btc|btcusd|crypto|etf|State of the Union|Trump|wall street",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58518726,
    "published": 1772112261000,
    "title": "Morning Minute: Circle Earnings Highlight a Massive Day for Crypto",
    "body": "It was a green day for stablecoin enthusiasts and crypto majors, and positive earnings from NVDA after hours signal the rally may have legs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58519111,
    "published": 1772112889000,
    "title": "Ethereum Foundation drops most ambitious roadmap in years, targets finality in seconds by 2029",
    "body": "The \"strawmap\" outlines seven forks through the end of the decade, including post-quantum cryptography, shielded transfers, and a 480x reduction in transaction finality time.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Ethereum Foundation|Ethereum News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58519989,
    "published": 1772114400000,
    "title": "Decibel goes live on Aptos with a $58 million war chest and a secret weapon from Stripe's Bridge",
    "body": "After a testnet with 700,000 accounts and $50 million in pre-deposits, Decibel begins mainnet trading with an onchain order book and risk engine on Aptos.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Aptos|perpetual contracts|Decentralized exchange|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 70,
        "NAME": "APT",
        "CATEGORY": "APT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58520068,
    "published": 1772114400000,
    "title": "OKX integrates Chainalysis Alterya for pre-withdrawal scam screening",
    "body": "Cryptocurrency exchanges are moving to block scam-linked transfers before funds leave their platforms as fraud losses continue to climb.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58520065,
    "published": 1772114400000,
    "title": "Mastercard, MetaMask launch US crypto card, debuting in New York",
    "body": "MetaMask Card goes live in the US, with first-time availability across 49 states, including New York, following initial pilots over the past two years.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58520950,
    "published": 1772115938000,
    "title": "ZachXBT alleges Axiom employee conducted insider trading",
    "body": "The claim comes two days after trading firm Jane Street was accused of insider trading in relation to the collapse of Terra in 2021.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crime|Insider Trading|Zachxbt|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 58520711,
    "published": 1772115546000,
    "title": "Goliath Ventures CEO Arrested Over $328M Crypto ‘Ponzi Scheme’",
    "body": "Christopher Alexander Delgado was charged on counts of wire fraud and money laundering that carry a maximum sentence of 30 years in prison.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||uniswap|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      }
    ]
  },
  {
    "id": 58521468,
    "published": 1772116638000,
    "title": "Trump family-backed miner American Bitcoin posts $59M quarterly loss",
    "body": "American Bitcoin posted a $59.5 million Q4 loss while its revenue rose and its Bitcoin stack topped 6,000 coins, as peers pivot to AI and sell down treasuries.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58523060,
    "published": 1772119558000,
    "title": "Bitcoin bear market not 'over already' as price rejects at $68K trend line",
    "body": "Bitcoin price strength failed to reclaim a key support zone with traders still expecting the bear market to match previous cycles.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58523467,
    "published": 1772120317000,
    "title": "Y Combinator-Backed Axiom Exchange Employees Accused of Insider Trading: ZachXBT",
    "body": "Multiple employees at Axiom, a non-custodial trading platform, allegedly engaged in insider trading, said blockchain investigator ZachXBT.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||DeFi",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 58523415,
    "published": 1772120278000,
    "title": "Bitcoin falls back below $67,000, rapidly giving back Wednesday's gains",
    "body": "The declines are coming as the Nasdaq tumbles nearly 2%, led by a post-earnings selloff in Nvidia.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58523266,
    "published": 1772120075000,
    "title": "The Protocol: Blockchain sleuth ZachXBT alleges Axiom employee conducted insider trading",
    "body": "Also: Ethereum’s “strawmap”, Robinhood chain update and OpenAI + smart contracts",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Tech|The Protocol|Newsletters|Zachxbt|Robinhood crypto|Ethereum News|Openai|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58523858,
    "published": 1772120894000,
    "title": "Ethereum reclaims $2K as volatility spike backs ETH price recovery",
    "body": "Ethereum’s looked bullish, with onchain data showing that the ETH price may have hit a macro bottom as a key support level holds.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Market Analysis",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58524452,
    "published": 1772122121000,
    "title": "Bitcoin briefly crashes below $48,000 on upstart exchange despite crypto rally",
    "body": "A single large sell order triggered a 30% flash crash on decentralized perp exchange Lighter even as bitcoin was climbing elsewhere.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|market analysis|perpetual contracts|Decentralized exchange|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58524174,
    "published": 1772121658000,
    "title": "Analyst Predicts Bitcoin Price Surge To $500,000 As Ribbon Fractal Emerges",
    "body": "A prominent market commentator has projected that the Bitcoin price could climb as high as $500,000, citing the reappearance of a long-observed moving average ribbon pattern on the monthly chart. The forecast, shared by Egrag Crypto on X, ties price structure to specific time windows in 2026 and 2028, arguing that technical alignment is outweighing short-term market narratives.pl Bitcoin Price Ribbon Setup Signals Expansion Phase At the center of the $500,000 prediction is the reformation of a multi-layer moving average ribbon on the one-month timeframe. The chart provided by the analyst shows the 33 EMA, 66 MA, 80 EMA, and 100 EMA compressing and beginning to expand in a configuration that has historically marked major cycle transitions. Related Reading: Pundit Gives Reasons Why XRP Price Will Hit $10 In 2026 This structure is not presented in isolation. In previous cycles, similar ribbon compressions were followed by decisive impulsive advances. The analyst points to an earlier period on the chart when the price consolidated within the ribbon before accelerating sharply upward, forming a pattern that now appears to be repeating. Because this setup mirrors prior cycle behavior, he characterizes it as a fractal, indicating structural similarity across different market phases. The ribbon’s position relative to current price action reinforces the broader thesis. Bitcoin remains structurally above the layered averages, a condition that in earlier cycles preceded sustained upside rather than distribution. When price reclaimed and held above this cluster in the past, expansion phases followed. Based on those historical expansion multiples, the analyst outlines an intermediate target near $150,000 and extends the upper boundary of the move toward $500,000. This framework deliberately shifts focus away from sentiment-driven fluctuations. Instead, the moving averages are treated as objective markers of where Bitcoin stands within its long-term cycle, forming the analytical foundation for the half-million-dollar projection. Timing Window Points To 2026 And Late 2028 Alignment Building on the structural case, the forecast also incorporates a defined timeline. The chart highlights October 2026 as a key waypoint, aligning with a potential continuation phase if the emerging ribbon fractal develops in line with historical precedent. Beyond that initial window, a second period is identified around the end of the third quarter or the beginning of the fourth quarter of 2028. The analyst references election cycles as a contextual factor, suggesting that macro narrative and technical structure could converge during that timeframe. Related Reading: The Multi-Year XRP Bull Market That Could Change Everything Forever The projected path on the chart reflects this staged process. Rather than a single vertical surge, it outlines a series of consolidations followed by accelerations, echoing previous cycles before peak expansion. By integrating price structure with calendar timing, the projection frames the $500,000 target as the culmination of a repeatable cyclical pattern. In this context, the ribbon fractal is positioned not as speculative optimism, but as the structural roadmap underpinning the analyst’s expectation of a potential surge toward half a million dollars. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58524171,
    "published": 1772121600000,
    "title": "Crypto for Advisors: Crypto’s fixture in 401(k) plans",
    "body": "Crypto is becoming a permanent 401(k) fixture. We detail the shift from regulatory bans to presidential mandate and new DOL guidance, plus the latest big institutional bets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|Financial Advisors|401(k)|Crypto for Advisors|CoinDesk Indices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58524818,
    "published": 1772122702000,
    "title": "UK investors only have until April to add crypto ETNs to their ISAs: FT",
    "body": "The lifting of the ban on retail investors accessing crypto ETNs was seen as a major win in the adoption of crypto investments due to the possibility of it being added to products like ISAs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|UK|HMRC|Crypto ETPs|ISA|Tax|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58526267,
    "published": 1772125251000,
    "title": "Cardano (ADA) Among Today’s Top Gainers as Institutional Buying Aligns With Technical Breakout",
    "body": "Cardano (ADA) jumped over 12% in a single day, breaking above short-term resistance and drawing renewed attention from both whales and institutional funds. The surge coincides with steady accumulation by whales and mechanical buying from index-tracking products, signaling a potential shift after months of consolidation. Related Reading: XRP Rally Incoming? Analyst Forecasts March-April Recovery If This Level Breaks The combination of rising trading activity, renewed interest in derivatives, and steady accumulation by major holders has brought Cardano back onto traders’ radars. While questions remain about long-term network activity, recent price behavior suggests that market participants are ready for significant long-term moves. ADA's price trends to the downside on the daily chart. Source: ADAUSD on Tradingview Institutional Allocation and Whale Accumulation Support Cardano’s Momentum On-chain data shows that large Cardano holders, commonly referred to as sharks and whales, have accumulated roughly 819 million ADA over the past six months. This buying occurred even as prices declined significantly, indicating that influential investors viewed lower levels as an opportunity to build positions. Institutional exposure has also increased. Asset manager Grayscale raised Cardano’s weighting within its Smart Contract Platform Select Capped Index fund to above 20%, making ADA the product’s third-largest holding. Although the adjustments are driven partly by index-tracking mechanics, the rising allocation highlights Cardano’s continued relevance among major smart-contract platforms. This accumulation trend contrasts with retail sentiment during the downturn and suggests longer-term conviction despite ongoing competition from rival blockchain ecosystems. Analysts often interpret sustained buying during price weakness as a signal that larger investors are positioning ahead of future catalysts. Technical Breakout Fuels ADA’s Price Surge ADA recorded a 12% daily gain, rising from roughly $0.26 to above $0.29, as trading volume surged to nearly 4 times its average level. The move followed a breakout above key short-term technical levels after weeks of consolidation. Momentum indicators show a recovery phase underway. The RSI remains below overbought territory, leaving room for further upside, while trend strength readings indicate a developing directional move. Rising futures open interest, which expanded by nearly 30% in a single day, suggests fresh capital entering the market rather than short covering alone. Key levels now sit near $0.31 as immediate support, while resistance appears around $0.34 and the 50-day moving average. A sustained hold above these zones could reinforce bullish momentum, whereas rejection may trigger consolidation. Ecosystem Developments Add Fundamental Narrative Beyond price action, Cardano founder Charles Hoskinson recently emphasized that the network remains competitive, citing the upcoming Midnight privacy project as evidence of continued development. The initiative has already attracted early partnerships and aims to expand enterprise and regulatory-compliant use cases. Still, mixed fundamentals persist. While derivatives activity and investor accumulation are rising, decentralized finance participation and total value locked on the network remain below previous highs, reflecting uneven ecosystem growth. Related Reading: Bitcoin Price Surges 8% — Key Drivers Behind The Recovery Toward $70,000 For now, Cardano’s rally represents a notable alignment between institutional positioning and technical momentum. Whether ADA can sustain gains above current resistance levels will likely depend on continued capital inflows and broader crypto market sentiment in the weeks ahead. Cover image from ChatGPT, ADAUSD chart on Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cardano|ADA|ADA price|adausd|Cardano price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58526264,
    "published": 1772125245000,
    "title": "XRP Price Turns Completely Bearish, But Is A Crash To $1 Still Possible?",
    "body": "Crypto analyst CasiTrades has warned that the XRP price structure has turned bearish, putting the altcoin at risk of a further decline. The analyst also suggested that the price could still crash below $1 as it looks to find a bottom. XRP Price Structure Shifts Bearish With Key Levels Below In an X post, CasiTrades stated that the XRP price structure has shifted bearish, with key levels below. She further revealed that price is starting to gather sell strength and that the trendline break is looking to form resistance. The analyst added that price is losing the B-wave low, shifting momentum toward supports. Related Reading: The Uncomfortable Truth About XRP That Shows How High Price Can Actually Go CasiTrades also stated that the $1.11 and $0.87 levels are the main downside targets, indicating that the XRP price could still crash below $1. Meanwhile, the local resistance is at $1.40, with the analyst noting that as long as the price stays below it, the market is likely headed lower. As such, she believes that current levels are still a no-trade zone. She urged market participants to wait for lower supports to be reached or a flip of the $1.65 macro resistance. It is worth noting that the XRP price has recently climbed above the $1.40 resistance and could invalidate the bearish structure if it breaks above the $1.65 macro resistance, as CasiTrades mentioned. This rally has come on the back of Bitcoin’s rally to around $70,000 following a drop to as low as $64,000 earlier in the week. CoinGlass data shows an increase in activity in the derivatives market amid the XRP price’s rally above $1.40. Trading volume has surged by over 33% to $6.20 billion, while open interest is up by over 6% to $2.39 billion. The long/short ratio is above 1, indicating that most traders are currently long on the altcoin. The Bottom Isn’t In Yet For XRP In an X post, crypto analyst TARA stated that she is not convinced that the bottom isn’t in for the XRP price. The analyst noted that an early indication that the bottom is in would be a break above the macro .618 level at $1.47. XRP is said to be testing that level as resistance right now, which TARA noted is a “super critical moment.” Related Reading: XRP Funding Levels Drop To Extreme Negative Levels, What This Means For Price The analyst suggested that for the bottom to be in for the XRP price, it would need a clean break above $1.88, with such confirmation still a long way away. However, she added that a break above the macro .618 support is a really good first step and a key level that it needs to hold if flipped. At the time of writing, the XRP price is trading at around $1.44, up over 6% in the last 24 hours, according to data from CoinMarketCap. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|altcoin|bitcoin|CaiTrades|Coinglass|CoinMarketCap|open interest|Ripple|TARA|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58527671,
    "published": 1772127758000,
    "title": "Circle's post-earnings surge nears 50% as short squeeze, not strong financials, fuels rally",
    "body": "The violent move had more to do with hedge funds' overcrowded bearish positioning getting wiped out than the company’s financial performance, one analyst pointed out.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Circle|Stablecoins|market analysis|10x research|Markus thielen|Mizuho Bank|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 58527669,
    "published": 1772126918000,
    "title": "Florida man charged with running $328 million crypto Ponzi scheme",
    "body": "Prosecutors say Goliath Ventures’ Christopher Alexander Delgado raised hundreds of millions of dollars, promising investors guaranteed 3% to 8% monthly returns.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|crypto scams|United States|TRM Labs|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58528198,
    "published": 1772128805000,
    "title": "Dogecoin Price Gets New Bull Case As RWA Tokenization Plan Emerges",
    "body": "Dogecoin has a new utility pitch, and this one is aimed squarely at one of crypto’s most discussed institutional themes. In a X post on February 26, Dogecoin Foundation director Timothy Stebbing said he has spent the last 12 months working toward a plan to make Dogecoin “an asset-backed currency” within two to three years by pushing real-world asset tokenization through a Dogecoin-denominated rules engine called Fractal Engine, with a longer-term goal of eventually moving that activity onto Dogecoin’s base layer through protocol upgrades. Dogecoin Price May Get Major Utility Boost Stebbing’s argument is not that Dogecoin should merely host tokenized assets somewhere in its orbit. It is that DOGE itself should become the trading currency for them. “Make Dogecoin an asset-backed currency in the next 2-3 years by shifting the market for Real World Asset tokenisation to Fractal Engine,” he wrote. “Then once proven, work to migrate RWA tokenization from the sidechain to L1 via protocol upgrades. This would see Dogecoin become the premiere platform for asset tokenisation, denominated in Dogecoin.” Related Reading: Dogecoin Warning: Analyst Says DOGE May Fall To $0.06 Stebbing is effectively sketching a path where demand for DOGE would come not only from speculation or meme-cycle reflexivity, but from its use as the medium of exchange for tokenized assets. He framed the opportunity in deliberately broad terms, arguing that tokenization should cover “real assets, Hotels, Businesses, Minerals, Oil & Gas etc.” and adding, “if you want to trade, you do it with Dogecoin.” The proposed rollout is phased: start on a sidechain, prove the model there, then seek eventual migration to L1. The plan I’ve been working toward for the last 12 months: Make Dogecoin an asset-backed currency in the next 2-3 years by shifting the market for Real World Asset tokenisation to Fractal Engine, AKA: the bespoke dogecoin-denominated RWA rules engine. Then once proven, work to… — Timothy Stebbing (@tjstebbing) February 26, 2026 The broader backdrop for Stebbing’s pitch is that tokenization is no longer being framed as a crypto niche. In his 2025 chairman’s letter, BlackRock CEO Larry Fink argued that “every stock, every bond, every fund—every asset—can be tokenized,” presenting tokenization as a potential redesign of market plumbing rather than a speculative side narrative. Related Reading: Dogecoin (DOGE) Faces 50-Day EMA Test as Traders Watch for Reversal or Deeper Pullback Fink said that if markets move in that direction, transactions that now take days could clear in seconds, while capital currently locked up by settlement frictions could be recycled back into the economy more quickly. He also wrote that tokenized funds could one day become as familiar to investors as ETFs, provided digital identity infrastructure catches up. BlackRock has echoed that view at the firm level. In its 2026 investment-products outlook, it said tokenization is helping “bridge the gap” between traditional finance and DeFi, and that it expects the trend to continue making investing faster, cheaper and more accessible while more assets move on-chain at scale. That makes Stebbing’s proposal easier to understand in market terms: the bull case is not simply that Dogecoin gains another narrative, but that it tries to attach itself to a theme one of the world’s largest asset managers already treats as a serious part of finance’s next phase. At press time, DOGE traded at $0.09937. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|RWA",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 206,
        "NAME": "FORKS",
        "CATEGORY": "FORKS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58527890,
    "published": 1772127756000,
    "title": "Bitcoin Resumes Slide After Quick Pullback in Risk Appetite",
    "body": "Bitcoin turned lower on Thursday, a day after an unexpected rally in cryptocurrencies had raised optimism among investors that the digital asset market was reaching a bottom following a more than four-month slide.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NCM:ABTC",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58528746,
    "published": 1772129660000,
    "title": "Vitalik Buterin unveils Ethereum roadmap to counter quantum computing threat",
    "body": "This move comes shortly after the Ethereum Foundation established a dedicated post-quantum research team to study the issue.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Vitalik Buterin|Ethereum News|quantum computing|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58529070,
    "published": 1772130217000,
    "title": "AI rout hits software stocks, but Grayscale says blockchains stand to benefit",
    "body": "As AI rattles tech stocks, Grayscale's head of research said blockchains will power intelligent agents’ transactions and help offset emerging risks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|AI|Blockchains|Grayscale|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      }
    ]
  },
  {
    "id": 58529596,
    "published": 1772131210000,
    "title": "MrBeast Video Editor Suspended From Beast Industries Following Kalshi Insider Probe",
    "body": "Beast Industries has suspended an employee while it internally investigates allegations of insider trading, according to CEO Jeff Housenbold.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 58530548,
    "published": 1772132874000,
    "title": "Polymarket user gains $400K betting on ZachXBT investigation",
    "body": "As US policymakers scrutinize prediction markets platforms, many Polymarket users won bets over speculation as to which insider trading an online sleuth had exposed.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 58531567,
    "published": 1772134872000,
    "title": "Jane Street Faces New Lawsuit: Trump Media Calls For Federal Investigation",
    "body": "Jane Street, one of the world’s largest market-making firms, has come under growing scrutiny as a series of allegations have surfaced linking the company to major disruptions in the crypto market. The firm is already facing a federal lawsuit tied to the collapse of Terraform Labs, and now new claims circulating on social media suggest that Trump Media has accused Jane Street and other trading firms of “naked short selling” in a letter to Congress. Jane Street Rejects Terra Allegations The legal troubles began earlier this week. On February 23, a lawsuit was filed in the US District Court for the Southern District of New York accusing Jane Street of using confidential information obtained from Terraform Labs to shield itself from heavy losses before the Terra/Luna ecosystem unraveled in May 2022. Related Reading: Coinbase Stablecoin Revenue Could Surge 7x Under GENIUS Act, Bloomberg Analysts Say According to the complaint, Jane Street allegedly leveraged insider knowledge to avoid more than $200 million in potential losses ahead of the implosion. The firm has strongly denied the accusations, characterizing the lawsuit as “desperate” and describing it as a “transparent attempt to extract money.” Beyond the courtroom, additional claims have gained traction online. Some market participants have alleged that Jane Street manipulated Bitcoin (BTC) prices by operating an algorithm that allegedly triggered consistent sell-offs at 10 a.m. each day for months. According to these claims, the strategy involved pushing prices lower, triggering liquidations among retail traders, and then repurchasing Bitcoin at reduced levels in a repeated cycle. Naked Short Selling Inquiry Adding another layer to the controversy, market commentator MartyParty stated on Thursday that Trump Media had sent a letter to members of Congress calling for a full investigation into Jane Street, Citadel and other firms over alleged naked short selling. Naked short selling refers to the practice of selling shares without first borrowing them, a tactic that is restricted under US securities law. Related Reading: Circle Tops Q4 Revenue Forecasts, Shares Surge 30% — Key Numbers Inside As of Thursday afternoon Eastern Time, there had been no official confirmation of such a letter, nor any public statement from Trump Media, Jane Street, or Citadel verifying the claim. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|crypto|crypto market|crypto news|cryptocurrency|Jane Street|Jane Street lawsuit|Jane Street news|Terraform Labs|Trump|Trump media|Trump Media news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 34,
        "NAME": "LUNA",
        "CATEGORY": "LUNA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58531610,
    "published": 1772134756000,
    "title": "US regulator scrutinised over bank licence for Trump crypto venture",
    "body": "UAE investment in World Liberty Financial has intensified concerns about favourable treatment and national security",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58532019,
    "published": 1772135558000,
    "title": "Bloomberg extends financial data to $25B tokenized markets via Kaiko",
    "body": "Bloomberg and Kaiko aim to embed licensed financial data directly on blockchain networks, targeting institutional tokenized Treasurys and repo markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 58532259,
    "published": 1772136046000,
    "title": "XRP Is About To Create History With This Latest Move",
    "body": "Crypto analyst Austin is making a bold claim about XRP’s latest price action, and if he is right, the cryptocurrency could make history. Following a decline below $1.4 earlier this week, Austin believes XRP is now setting the stage for a move that could change its price trajectory, potentially ending its ongoing corrective phase and triggering a breakout into price discovery mode. In a recent X post, Austin sounded the alarm on a potentially landmark moment for XRP, one that has never occurred in the cryptocurrency’s history. The analyst stated that XRP may be on the verge of recording its first-ever monthly candle close within the critical $1.20 to $1.60 price range. Why XRP’s Next Move Could Make History According to Austin, every time XRP has traded through this price zone, monthly candles have sliced through it without closing inside, suggesting no meaningful price structure was ever established there. Related Reading: This Is Not The First Time XRP Has Crashed 69%, Here’s What Happened Last Time Looking at the accompanying chart, the pattern is visible across both the 2018 peak and the 2021 bull run. At the time, XRP briefly entered this key range, only for the candles to either close above or below it during the same monthly period. The analyst highlighted that the $1.20 to $1.60 zone never developed into a base of support or resistance despite price slicing through it on multiple occasions. As a result, the area was riddled with unfilled gaps and unresolved price action. With the current monthly candle now trading within this price band following XRP’s pullback from its 2025 highs above $3, Austin argues that the market may be in the process of filling “the final inefficiency gap” inside its macro range. Rather than viewing XRP’s price correction as a weakness, the analyst said the market is building the final base that has been absent throughout the cryptocurrency’s history. If XRP can hold current levels and close the monthly candle within this band, Austin predicts that the cryptocurrency could eventually “break out into a full price discovery.” Notably, he highlighted in a previous analysis that price always revisits and balances inefficiency gaps. He added that once that gap is filled, a price expansion automatically begins. XRP Could Be Preparing For A Parabolic Move In a more recent technical analysis, Austin revealed that XRP’s monthly Stochastic Relative Strength Index (SRSI) has been completely floored. The chart shows that the metric has declined from a peak of around 80 in 2025 to its current reading of 9.34. Related Reading: Analyst Wans XRP Price Could Crash Below $1 If Bitcoin Reaches This Level According to the analyst, the last time XRP reached this level was in 2022, which coincided with a bear market bottom. He further noted that when the cryptocurrency approached this level again in 2024, it marked a major price low before staging a parabolic move to new highs. With XRP’s SRSI now at the same depressed level, Austin questions whether price action will follow historical trends or if this time will prove different. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Austin|Ripple|SRIS|Stochastic Relative Strength Index|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58532256,
    "published": 1772136021000,
    "title": "A new bipartisan bill wants to ensure the next century of tech is written in America",
    "body": "The Promoting Innovation in Blockchain Development Act is a high-stakes play to win the global code war.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Opinion|Regulation|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 58533291,
    "published": 1772137982000,
    "title": "Here is why Ethereum's bold new plan could make the blockchain giant high-speed 'internet of value' by 2029",
    "body": "Beneath the technical language of the 'Strawmap' is a far simpler story: Ethereum is trying to decide what kind of infrastructure it wants to be by the end of the decade.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "News Analysis|Ethereum News|Ethereum Foundation|Vitalik Buterin|Top Stories|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58533896,
    "published": 1772139127000,
    "title": "Grant Cardone plans to tokenize his firm's $5 billion real estate portfolio",
    "body": "The real estate investment mogul said his firm, Cardone Capital, is exploring blockchain-based tokens for property holdings as tokenization gains traction.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tokenization|Real Estate|Grant Cardone|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58534349,
    "published": 1772139745000,
    "title": "SEC approval sought for JitoSOL Solana-based liquid staking token ETF",
    "body": "The proposal would allow a US exchange to trade shares of a fund holding JitoSOL, representing the first SEC exchange filing for a liquid staking token ETP.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 58534893,
    "published": 1772139600000,
    "title": "Bitcoin Miner MARA, Starwood Partner to Develop AI Data Centers",
    "body": "MARA Holdings Inc. is partnering with Barry Sternlicht’s Starwood Capital Group to develop some of the Bitcoin miner’s existing sites into infrastructure that can support artificial intelligence applications and some other cloud services.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "NCM:MARA",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58535179,
    "published": 1772141394000,
    "title": "'Someone's Looking for a Pardon': Senators Rebuke Sam Bankman-Fried's Crypto Bill Support",
    "body": "Republican and Democrat senators alike pushed back on imprisoned FTX founder Sam Bankman-Fried's support of the Clarity Act crypto bill.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58535219,
    "published": 1772141345000,
    "title": "US lawmakers move to protect blockchain devs from prosecution",
    "body": "The industry-supported Promoting Innovation in Blockchain Development Act could be a solution by Congress to push back against criminalizing writing code.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 58536047,
    "published": 1772143107000,
    "title": "U.S. regulator's GENIUS pitch puts dark cloud over crypto sector's stablecoin model",
    "body": "The U.S. Office of the Comptroller of the Currency proposed rules that would govern stablecoins, including apparent limits on rewards that may affect Coinbase.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Stablecoins|Coinbase|Office of the Comptroller of the Currency|Regulations|Market Structure Legislation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58536046,
    "published": 1772143012000,
    "title": "Bitcoin Miner MARA jumps 17% after striking a deal with Starwood to build AI data centers",
    "body": "The bitcoin miner inked a deal with investment firm Starwood to convert and expand select facilities to serve data center needs for AI.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Marathon Digital|Bitcoin News|Bitcoin Miners|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58536099,
    "published": 1772143256000,
    "title": "Ethereum Still Undervalued As Bitcoin, XRP Sit Near Neutral, Santiment Says",
    "body": "On-chain analytics firm Santiment has highlighted how Ethereum is still undervalued on the MVRV, while Bitcoin and XRP have turned neutral. Profitability Has Shifted For Bitcoin, XRP, & Ethereum After The Price Jump In a new post on X, Santiment has talked about how the 30-day Market Value to Realized Value (MVRV) Ratio has changed for some major digital assets following the market recovery that has occurred over the past day. The MVRV Ratio is a popular on-chain indicator that compares the market cap of an asset against its Realized Cap, a measure of the total amount of capital that investors have put into the network. Related Reading: Cardano Sharks & Whales Quietly Accumulate 819M ADA Amid Price Decline In short, what the MVRV Ratio tells us about is the profit-loss status of addresses on the blockchain as a whole. When the metric is above the 1 mark, it means investors are, on average, in a state of unrealized profit. On the other hand, the indicator being under this threshold suggests the dominance of losses. Here, the MVRV Ratio of the entire network isn’t of relevance, but that of a particular slice of it: the buyers from the past month. Below is the chart shared by Santiment that shows the trend in the cohort’s MVRV Ratio for the five top cryptocurrencies: Bitcoin, Ethereum, XRP, Cardano, and Chainlink. From the graph, it’s visible that the 30-day MVRV Ratio has risen for all five of these assets recently. This is a natural result of the price recovery that has taken place over the past day. Bitcoin has returned above $68,000, and Ethereum is back beyond $2,000. While prices across the market have surged, the MVRV Ratio isn’t reflecting a uniform situation. Bitcoin, XRP, and Chainlink are all inside the neutral zone with the metric sitting at -1.4%, -0.1%, and +3.3%, respectively (note that the 0% mark corresponds to the 1 level here). Meanwhile, Ethereum has seen its 30-day trader returns remain inside a zone that the analytics firm defines as corresponding to a “mildly undervalued” status, despite the fact that the coin’s price has surged 6% in the last 24 hours. Though with an MVRV Ratio of -5.5%, ETH is only just inside the area. On the other end of the spectrum is Cardano, which has observed the indicator fly to a value of +6.8%, entering into the “mildly overvalued” zone. Generally, the larger the investor profits get, the more likely they are to participate in profit-taking. Due to this reason, a high value on the MVRV Ratio can be a sign that a correction could be coming. Similarly, a low value suggests the presence of a high degree of market pain, which could result in a bottom formation. Related Reading: Bitcoin Yet To See Meaningful Capital Return, Glassnode Says “Buy and dollar cost average when a coin is in an ‘Undervalued’ zone,” explained Santiment. “Be cautious when a coin reaches an ‘Overvalued’ zone.” ETH Price Ethereum briefly broke above $2,100 during its surge, but the coin has since witnessed a minor retrace to $2,070. Featured image from Dall-E, chat from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|bitcoin|Bitcoin MVRV|btc|ETH|ethereum|Ethereum MVRV|ETHUSDT|xrp|XRP MVRV",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58536913,
    "published": 1772144914000,
    "title": "Block Stock Pops as Jack Dorsey's Bitcoin, Payments Company Dumps 4,000 Jobs",
    "body": "Block said the restructuring will cost up to $500 million and be largely completed by mid-2026, as investors embraced the move.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58537542,
    "published": 1772146218000,
    "title": "Jack Dorsey’s Block to cut 4,000 jobs in AI-driven restructuring",
    "body": "Bloomberg reported earlier this month that 10% of Block’s workforce could be cut during annual performance reviews as part of a broader overhaul.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58537407,
    "published": 1772144479000,
    "title": "JPMorgan Sees Crypto Boost If Market-Structure Bill Passes",
    "body": "Crypto markets may get a meaningful lift in the second half of the year if US lawmakers approve sweeping market-structure legislation by midyear, even as sentiment remains sour, JPMorgan Chase & Co. said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "NYS:JPM",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 58537746,
    "published": 1772146872000,
    "title": "'Private Bitcoin' to Launch on Starknet With Zcash-Like Features",
    "body": "Starknet revealed a Bitcoin-based asset aimed at enabling people to better maintain their privacy on the Ethereum layer-2 scaling network.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|DeFi",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58537674,
    "published": 1772146807000,
    "title": "Ethereum Foundation Launches Bold New Push To Accelerate DeFi Growth",
    "body": "The Ethereum Foundation is taking a decisive step to strengthen decentralized finance (DeFi) on ETH and launching a new initiative. This move signals a renewed strategic focus on scaling DeFi adoption, improving protocol security, and fostering sustainable growth across lending, trading, and on-chain financial services. Why Boosting Developer Support And Ecosystem Funding In a key development, the Ethereum Foundation is launching a renewed and more ambitious protocol to strengthen DeFi within the ETH ecosystem. Ethereum Daily has revealed on X that the initiative is being framed as a Defipunk approach, which is centered on building financial infrastructure that is truly permissionless, private, secure, and fully open-source. The goal is to enable anyone, anywhere, to save, borrow, hedge risk, or make payments without relying on big companies like banks or large corporations. Related Reading: Why Ethereum’s Endgame Requires Rebuilding The Base Layer Rather than focusing solely on incremental upgrades to existing applications, like improved stablecoins, the Foundation’s vision reportedly targets deeper structural innovation. The key areas include developing more secure price oracles, enhancing privacy loans to reduce unfair liquidations, and integrating artificial intelligence (AI) to strengthen system security. With a newly formed DeFi team leading the effort, the foundation is inviting developers who share its vision to help build a financial system that will give users full control and expand accessibility, not just speculators. How Inflow And Outflow Trends Reveal Strategic Positioning Even as ETH price action has been brutally down from $4,900 to below $2,000, Ethereum spot ETF flows are quietly signaling a shift behind the surface. The head of research at Lisk, analyst Leon Waidmann, stated that the ETF flow dynamics have shown that after a period of heavy outflow around mid-2025, the intensity of selling pressure has been gradually fading. Related Reading: Ethereum Caught Between Weak Bounce And High-Timeframe Risk – What’s Next? Meanwhile, the massive inflow waves that were seen in late 2024 and early 2025 have subsided, and the peak panic selling that followed has largely dissipated. The recent ETF flow bars are significantly smaller in both directions compared to the prior volatile period, and sellers are running out of steam. Waidmann noted that this shift is significant because, despite one of the sharpest ETH drawdowns in recent memory, the institutional exodus appears to be exhausting. While the weak hand that wanted out has largely exited, this means there’s no bottom. However, there’s still a slight outflow bias in recent weeks, indicating that there’s no confirmed accumulation signal yet. Waidmann emphasized that the intensity of the selling pressure is clearly fading, which is the first step that must happen before any trend reversal. In his view, participants should pay attention to when the selling dries up before sentiment recovers, because that’s usually where the next move will start to build. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|AI|Artificial Intelligence|decentralized finance|DeFi|ETH|ETH news|eth price|ethereum|Ethereum Daily|ethereum news|ethereum price|ethusd|ETHUSDT|Leon Waidmann|The Ethereum Foundation",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58537744,
    "published": 1772145990000,
    "title": "Federal Bank Regulator Moves to Restrict US Stablecoin Rewards",
    "body": "The Office of the Comptroller of the Currency proposed rules that would restrict companies from launching branded stablecoins through white-label platforms and offering rewards tied to them, the agency’s first major attempt to implement the federal cryptocurrency law signed by President Donald Trump in July.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58538690,
    "published": 1772148647000,
    "title": "Jack Dorsey Just Fired The Starting Gun On AI Layoffs",
    "body": "Jack Dorsey cut 40% of Block's workforce and blamed AI directly — not restructuring. The stock jumped 20%. Here's why every CEO in America noticed.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 58539616,
    "published": 1772150457000,
    "title": "Bitcoin 5TH Wave Is Not Over Yet, And Price Could Still Crash To $52,000; Analyst Warns",
    "body": "Bitcoin is now inching towards $70,000, but there is enough to worry about around $64,000. Crypto analyst Tara expressed concern that Bitcoin’s fifth wave may not be complete, with a prediction that further downside could still be ahead. In a recent post on X, the analyst noted that the current move could either be the start or the final stretch of a fifth wave decline, and there’s still a possibility of the Bitcoin price falling to as low as $52,000. Double Bottom Support At $59,900 And $60,500 Technical analysis done by crypto analyst Tara shows that Bitcoin has built a major support around the $59,900 to $60,500 range. This area is based on prior swing lows and a visible double bottom formation on the 4-hour candlestick price chart. It also coincides with deeper Fibonacci retracement levels projected from above $70,000. Related Reading: Elliot Wave Analyst Predicts Bitcoin Price Will Crash In Final Move, What’s The Target? According to the analyst, Bitcoin could see a strong reaction if the price were to fall to that region. A bounce from this support could drive the Bitcoin price back to $64,400, which would then be tested as resistance instead of support. However, such a rebound may only be temporary. If the macro fifth wave structure continues to play out, the market could still be setting up for one final push lower after that retest. According to Tara’s wave interpretation, this final push lower could extend to as low as $52,000. This level is not yet fixed and will be remeasured as price action develops, but it represents a possible completion zone for the broader fifth wave. It is important to note that Bitcoin actually managed to hold above $60,000 throughout February, so therefore, the outlook to $52,000 is a worst-case scenario. Interestingly, the Relative Strength Index indicator on the 4-hour timeframe is trending lower and approaching oversold territory. Tara advised traders to watch for bullish divergence on the RSI during the next drop. A bullish divergence on the RSI could be the first sign of the end of the corrective structure. Bitcoin Might Register Higher Support At $64,000 Over the past few weeks, the $64,000 region has stood out as a decisive pivot for Bitcoin, repeatedly flipping between support and resistance depending on the direction of price. In a separate update, Tara highlighted that Bitcoin recently backtested the macro 0.5 Fibonacci level at $64,400 as resistance before attempting to push higher. Related Reading: Here’s What’s Driving The Bitcoin Price Crash Toward $60,0000 Reclaiming $64,000 would be an important step toward reversing the current bearish macro trend. At the time of writing, Bitcoin is trading around $68,220, up 4% over the past 24 hours. Even so, there is still a risk of a pullback. A drop back below $64,000 would weaken the short-term recovery and could expose the prior swing low at $60,500. On the flip side, bullish momentum would be confirmed if Bitcoin breaks above $70,000. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|bullish divergence|Fibonacci Level|Fibonacci retracement levels|RSI|TARA",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58540231,
    "published": 1772151430000,
    "title": "Meta’s AI Floods Child Abuse Investigators With 'Junk' Tips, Law Enforcement Officials Claim",
    "body": "ICAC officers say AI-generated reports are overwhelming investigators and slowing down cases as Meta disputes the claims.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 58540780,
    "published": 1772152438000,
    "title": "Anthropic Won’t Lift AI Safeguards Amid Ongoing Pentagon Dispute: CEO",
    "body": "Anthropic CEO’s said the company will not comply with Defense Department demands as the Pentagon weighs whether to label the company a “supply chain risk.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58541610,
    "published": 1772154035000,
    "title": "Bitcoin Spot Volumes Sink To 2024 Lows As Coinbase Selling Pressure Eases",
    "body": "Bitcoin spot trading activity has fallen to its weakest level of the year even as a fresh CryptoQuant signal suggests one important pocket of selling pressure may be starting to fade. Darkfost, a contributor at CryptoQuant, said February is on pace to finish as the month with the lowest Bitcoin spot volumes since the start of 2024. He tied that slowdown to a broader retreat in risk appetite as traders pull back from directional exposure and wait for firmer macro or technical confirmation. “February is on track to close as the month with the lowest Bitcoin spot trading volumes since the beginning of 2024. This comes alongside BTC’s price revisiting levels last seen in 2024 as well,” Darkfost wrote on X. “The current climate of uncertainty surrounding BTC has pushed investors toward a more defensive stance, resulting in a marked reduction in risk-taking.” Bitcoin Liquidity Keeps Thinning Out The scale of the slowdown is visible across the major venues. Darkfost said Binance still leads by a wide margin with nearly $75 billion in February spot volume, ahead of Gate.io at $25 billion and Bybit at $20 billion. Even so, that dominance has not insulated Binance from the broader contraction. Related Reading: Bitcoin Yet To See Meaningful Capital Return, Glassnode Says Since Bitcoin’s last all-time high in October, monthly spot volumes have been roughly cut in half across the largest exchanges, according to the post. Binance fell from $198 billion to $75 billion, Gate.io from $53 billion to $25 billion, and Bybit from $41 billion to $20 billion. Rather than an exchange-specific issue, Darkfost framed the move as a market-wide pullback in participation. He also linked the deterioration in liquidity to the aftermath of the Oct. 10 shock, when open interest dropped by more than 70,000 BTC, or roughly $8 billion, in a sharp reset of leveraged exposure. In his telling, that event did not just hit derivatives positioning. It appears to have accelerated a broader disengagement from crypto trading activity. “This phase of disengagement is directly reflected in the steady decline in spot trading volumes observed across major exchanges,” Darkfost wrote. “This dynamic points to a generalized trend affecting all major exchanges.” That matters because spot flows tend to carry more weight when traders are looking for evidence of durable demand rather than fast-moving leverage. A recovery built on stronger spot participation generally looks sturdier than one driven mainly by derivatives. Coinbase Pressure Shows Signs Of Easing Against that weak backdrop, CryptoQuant CEO Ki Young Ju pointed to a more constructive short-term signal: “Selling pressure on Coinbase is easing.” The chart shows the Coinbase Premium Index moving back into positive territory after spending most of the time in February below zero (with a few exceptions). By the latest reading on the chart, the premium had recovered to roughly 0.006 while Bitcoin traded near $68,300. This suggests the discount on Coinbase relative to offshore venues has narrowed, easing one sign of US-led sell pressure. Related Reading: 2 Bitcoin Price Levels Could Decide What Happens Next, Coinbase Says That does not contradict Darkfost’s broader caution. If anything, the two signals fit together. Spot liquidity remains thin and the market is still operating in a low-conviction environment, but one of the more closely watched measures of immediate selling intensity is no longer deteriorating. Darkfost was explicit about what would need to change for the picture to improve in a more meaningful way. “As it stands, this simultaneous contraction in spot volumes reflects a structurally cautious market phase, where participants prioritize capital preservation over directional exposure while awaiting clearer macroeconomic or technical signals. For a bullish recovery to materialize, or for a durable bottom to form, stronger spot volume support will be essential.” For now, that leaves Bitcoin in a familiar late-cycle holding pattern: sellers may be backing off on Coinbase, but without a broader return of spot demand, the market still lacks the depth that usually underpins a stronger move. At press time, Bitcoin traded at $68,153. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58541418,
    "published": 1772153582000,
    "title": "Meta’s (Possible) Crypto Comeback Highlights Stablecoin Acceleration",
    "body": "After a failed first effort, and years away, Meta looks ready to launch another foray into crypto payments",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58543481,
    "published": 1772157609000,
    "title": "SUI Breakdown Attempts Absorbed — Is It Ready To Explode Higher?",
    "body": "SUI has repeatedly tested key support, but every breakdown attempt has been aggressively absorbed. Instead of accelerating lower, the price has stabilized and begun to compress, a classic sign of underlying demand. With volatility tightening and pressure building, the question now is whether this absorption phase is setting the stage for a powerful upside expansion. SUI Re-Enters the Spotlight at $0.9884 A fresh analysis from Altcoinpedia highlighted that SUI is trading around $0.9884, with accelerating ecosystem metrics bringing the high-performance network back into focus among traders and builders. Its strong transaction throughput remains a core advantage, allowing applications to scale efficiently without congestion while maintaining low latency for users. Related Reading: SUI Drops Below $1 Despite Launch of First U.S. Staking ETFs by Grayscale and Canary Developer activity continues to expand, with new DeFi protocols, gaming projects, and consumer applications launching to leverage SUI’s object-centric architecture. Liquidity across ecosystem-based decentralized exchanges has grown steadily, signaling meaningful participation rather than short-term speculation. At the same time, broader institutional access is creating regulated exposure pathways, while on-chain data shows increasing wallet growth and consistent network utilization, which are clear signs of genuine traction. The conversation around SUI is shifting from early potential to proven execution. Markets tend to reward ecosystems where technical performance aligns with usability, and that alignment is becoming increasingly visible. With price consolidating near zones that historically attract strategic accumulation, the overall structure appears constructive. As liquidity deepens, developer momentum strengthens, and institutional awareness expands, the foundation for a larger move continues to build. The key elements for expansion are in place, and with breakout energy forming, the broader market may soon begin to reflect that progress. Volatility Expansion, But Breakdowns Absorbed SUI’s price against Bitcoin tapped 0.00001351, and the reaction was immediate. According to crypto analyst Umair Crypto, volatility expanded sharply, yet every attempt to close below that level failed. Each breakdown was met with absorption, resulting in roughly 2 days and 8 hours of tight consolidation, with 14 consecutive candles holding right at support. That kind of behavior signals active defense, not randomness. Related Reading: SUI Slides Into Key Fib Support — Is the Downtrend Far From Over? Now, price is beginning to push higher, but confirmation is still required. The next major trigger comes from the BTC pair. Sustained closes above 0.00001372 would break the RSI trendline and signal a potential structural shift in momentum. If that breakout materializes, it could lead to the USDT pair reclaiming the 50 SMA, a recovery of the black box resistance zone, activation of an inverse head and shoulders pattern, and a measured move targeting approximately $0.96. Until the BTC pair decisively breaks structure, the USDT pair remains constrained, trading near range lows and below the 50 SMA. In this setup, the BTC pair dictates direction, and the USDT pair follows. Featured image from YouTube, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "SUI|Altcoinpedia|bitcoin|btc|DeFi|RSI Trendline|SMA|SUI price|SUIUSD|SUIUSDT|Umair Crypto|USDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]