[
  {
    "id": 56886949,
    "published": 1767693616000,
    "title": "John Bollinger: Bitcoin BB Squeeze Breakout Targets $107,000",
    "body": "Bitcoin’s daily chart is flashing what John Bollinger calls “a little classic technical analysis”: a well-formed base followed by a Bollinger Band Squeeze and an upside breakout that puts $100,000 and roughly $107,000 in view, so long as price can hold the move and avoid slipping back into the prior range. Bitcoin Rebound To $107,000 Next? “Near perfect base for BTCUSD with a Bollinger Band Squeeze and breakout,” Bollinger wrote alongside the chart. “First upside target 100,000, second ~107,000, third ??? If we fail here it is back into the trenches.” On the daily timeframe, BTC spent much of the late-year period carving out a sideways-to-slightly-higher base after the sharp Q4 selloff. The chart explicitly labels that “Base” region, with price repeatedly holding a low-to-mid $80,000s floor area before turning higher. That basing process matters in Bollinger’s framing because it provided the platform for volatility compression to do its work. Related Reading: Bitcoin’s Recovery Extends Into 2026 as Charts Hint at Another Leg Higher The squeeze is visible in the Bollinger BandWidth panel at the bottom of the chart, where BandWidth sinks to a marked low (“Squeeze”) and then begins to turn up. That inflection is paired with a sharp surge in the %B panel (the middle indicator pane), where %B drives up through the 1.0 line, an on-chart signal that price has pushed beyond the upper Bollinger Band. Bollinger annotates that moment as the “Breakout,” and the price panel shows the market accelerating higher off the base as the bands begin to open. On Bollinger’s chart, BTC is trading at $94,484, with the upper band curling higher and the mid-band rising beneath price. In plain terms: the move is no longer just compression; it is active expansion. Bollinger’s chart draws two horizontal red targets above current price: the first at $100,000 and the second near $107,000. Related Reading: The Real Reason Bitcoin Is Stuck: Futures Trading Dwarfs ETFs 20-To-1 The risk control is equally clear in his commentary. “If we fail here it is back into the trenches,” he wrote, language that, in chart terms, points to BTC losing the breakout and slipping back into the prior base region which is capped at the $93,500 region. This price level is of utmost importance for Bollinger. What About ETH And XRP? Bollinger also addressed the broader crypto market:“Someone asked about ETHUSD. Same pattern, a bit delayed, following not leading,” he wrote, positioning ether as a lagging participant rather than the driver. For XRP, Bollinger’s take was more cautious despite the obvious lift. “And ripple, strong lift, but the pattern is weaker. BTC > ETH > XRP for now.” At press time, BTC traded at $93,325. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|John Bollinger",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56885890,
    "published": 1767691311000,
    "title": "South Korea considers pre-emptive crypto account freezes, report says",
    "body": "The proposal highlights South Korea’s push to align crypto oversight with securities markets, raising stakes for exchanges and traders alike.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56888706,
    "published": 1767697247000,
    "title": "Here’s Why The Shiba Inu Price Jumped Over 13%",
    "body": "The Shiba Inu price has recorded an unexpected gain of more than 13% recently, decisively breaking away from the extended bear trend that had suppressed its momentum. Notably, 2026 is already shaping up to be a transformative year for the crypto market, with meme coins like Shiba Inu benefiting from the broader bullish shift and growing demand. With the Shiba Inu price now testing higher valuation zones, on-chain data has revealed the underlying forces behind its recent price surge Key Drivers Behind The Shiba Inu Price Rally Shiba Inu surged more than 13% on Sunday, January 4, as the broader 2026 meme coin frenzy began unexpectedly and continued to rotate capital among speculative assets. According to data from Santiment, a crypto analytics platform, SHIB’s sudden upside move was largely driven by aggressive accumulation from top whales rather than a surge in retail demand. Related Reading: Here Are The Top Meme Coins Leading The Crypto Recovery Ahead Of Dogecoin And Shiba Inu In a post on X, Santiment analysts noted that large holders were tightening their grip on Shiba Inu’s supply amid muted retail distribution. This behaviour points to growing confidence among dominant whale wallets and suggests that the recent price rally was not fueled by short-term, hype-driven buying. Price data also shows the Shiba Inu climb began at the start of January this year, after spending several weeks consolidating near recent lows. Notably, the recent bounce followed a prolonged downtrend that spanned late October through December 2025, making the 13% price jump stand out as a clear shift in momentum. Overlaying the price action is a rising line on Santiment’s chart that tracks the percentage of SHIB supply held by the top 10 whale wallets. While prices fluctuated throughout the second half of 2025, this metric steadily increased, signaling consistent accumulation even as broader market conditions remained weak. At the time of the analysis, the 10 largest Shiba Inu wallets collectively controlled about 62.65% of the total supply. Such a high level of concentration is unusual and gives large token holders significant influence over short-term price movements. The single largest wallet alone held roughly 41% of the total SHIB supply, valued at approximately $3.3 billion. Related Reading: Shiba Inu Lead Dev Reacts To Wild Development On Coinbase Involving $35 Million In SHIB Meanwhile, other top whale wallets each controlled between 2.8% and 5.7%, with several individual addresses worth hundreds of millions of dollars. Notably, the timing of Shiba Inu’s 13% price jump aligns with a visible uptick in whale concentration at the far right of the chart. As more supply became locked up, available liquidity thinned, allowing relatively modest buying pressure to push prices significantly higher. Shiba Inu’s Total Gains In 2026 So Far According to Santiment, Shiba Inu’s performance in 2026 now stands at a gain of more than 32% Year-to-Date (YTD). If wallet concentration remains elevated and whales continue to grow wealthier, volatility is likely to persist as prices respond quickly to shifts in large-holder behavior. At the time of writing, Shiba Inu is trading at $0.00000916, reflecting a roughly 5% increase in just one day. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Shiba Inu|meme coin|Santiment|SHIB|SHIB news|SHIB price|Shiba Inu news|Shiba Inu Price|Shiba Inu Whales|SHIBUSD|SHIBUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56888581,
    "published": 1767696775000,
    "title": "Bitcoin Core v30 bug risks fund loss during legacy wallet upgrades",
    "body": "Bitcoin Core urged users of versions 30.0 and 30.1 not to migrate legacy wallets after discovering a bug that can delete all files in a wallet directory if migration fails.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56888838,
    "published": 1767697370000,
    "title": "Sui, XRP Lead Gains as Crypto Market Momentum Mounts",
    "body": "Sui and XRP notched double-digit rallies, leading overnight crypto market gains as Bitcoin held above $93,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56889774,
    "published": 1767699444000,
    "title": "Morgan Stanley eyes the spot bitcoin ETF market",
    "body": "Wall Street heavyweight files for bitcoin trust amid rising institutional demand.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Bitcoin ETF|Morgan Stanley|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56889716,
    "published": 1767699241000,
    "title": "Largest bitcoin ETF inflow in three months signals institutional bid is back",
    "body": "Strong institutional demand returns as flows turn positive and bitcoin price recovers.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Bitcoin ETF|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56890477,
    "published": 1767700501000,
    "title": "Arthur Hayes' Maelstrom enters 2026 at 'almost maximum risk' betting on altcoins",
    "body": "The fund is betting on a liquidity wave driven by U.S. deficit spending and potential money printing by the Federal Reserve, which Hayes expects to support crypto prices.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Maelstrom|Arthur Hayes|Altcoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56890155,
    "published": 1767699924000,
    "title": "Bitcoin ETFs attract $697M in second trading day of 2026",
    "body": "Spot Bitcoin ETFs have hauled in $1.1 billion in the first two trading days of 2026, with analysts pointing to a new year “clean-slate effect” driving digital asset demand.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56890564,
    "published": 1767700800000,
    "title": "BitMEX pushes into 24/7 stock perps as tokenized equities heat up",
    "body": "BitMEX is rolling out 24/7 Equity Perps that use crypto as collateral for exposure to major US stocks and indexes, as exchanges from Bitget to Kraken race to bring equities onchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56891359,
    "published": 1767702626000,
    "title": "Only 1 Week Left As XRP RSI Breakout Sets Up $10 Path, Analyst Predicts",
    "body": "XRP is compressing on the weekly chart into a clearly defined post-breakout range, and analyst Maelius (@MaeliusCrypto)argues the next directional clue will come from the RSI, with a breakout “sometime in Q1” that he expects to coincide with higher prices and a push toward $10. Maelius’ chart is a 1W XRP/USD view (Bitstamp) with a 50-week EMA overlaid. The market’s most recent regime shift is clear: a sharp vertical expansion carried XRP from a long base into a higher trading band, followed by a multi-week consolidation inside a shaded range. Is XRP Set To Explode Within 1 Week? That range is anchored by two levels the chart emphasizes. The upper boundary aligns with the prior spike high near $3.33 (the 2018 peak), while the lower boundary sits just above $1.60. At the time of the screenshot, XRP is around $2.124 on the weekly close, placing price just below the 50-week EMA, the most immediate, high-visibility pivot in Maelius’ framing. The Elliott labeling casts the current chop as a corrective wave 4 after the impulsive advance. The message is less “trend is broken” and more “trend is pausing.” Maelius added that his “conservative count assumes there is only 1W left,” implying a relatively tight window for the market to resolve the consolidation and transition into wave 5 if momentum confirms. Related Reading: XRP Is Setting Up For Its ‘Next Explosive Move,’ Analysts Say: Here’s The Target The broader layout of the chart also invites a comparison to 2017: XRP’s first major run off a base, a long mid-cycle breather, and then a second, sharper leg into the ultimate high. In the comparison within the chart, XRP rallied roughly 7,400% in about three months in early 2017, consolidated from May through December, then surged again by roughly 1,500%. Today’s sequencing is presented as similar in shape, if not necessarily in magnitude: a strong first leg from roughly November 2024 through January 2025 (roughly +500%), followed by a year-long consolidation into January 2026. In that read, the next major leg higher could be approaching, potentially shallower than the first, with wave 5 serving as the “second push” analogue. Related Reading: Analyst Updates XRP Price Prediction: Why $16 Is Still On The Table The lower panel is a weekly RSI with a descending trendline capping recent peaks. That red down-sloping line is Maelius’ timing trigger: “RSI breaks out sometime in Q1. Price goes higher.” The implication is straightforward. In his framework, momentum needs to break its own compression before price can sustain the next expansion phase. Crucially, the chart also carries a higher-degree label that places the current wave 4 within a larger wave III, rather than portraying the next wave 5 as a terminal, cycle-ending move. That aligns with his response when asked whether $10 would be a quarterly “max”: “Sometime in Q1 we should get a breakout, not necessarily a top. Next wave should be towards 10$.” If the thesis is working, XRP would be expected to reclaim the 50-week EMA and reassert acceptance back toward the range highs near $3.33, with the RSI trendline break acting as the confirmation event Maelius is watching. If it fails, continued rejection at the EMA and a breakdown through the range floor above $1.60 would keep the wave-4 corrective phase in play and delay the wave-5 path he’s mapped. At press time, XRP traded at $2.37. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|xrp|xrp news|XRP Price|XRP Price Analysis|XRP Technical Analysis",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56891665,
    "published": 1767703286000,
    "title": "Circle's USDC outpaces growth of Tether's USDT for second year running",
    "body": "USDC grew faster than USDT for the second consecutive year, driven by increased demand for regulated digital dollars.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Stablecoins|USDC|USDT|Markets|Circle|Tether|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56892057,
    "published": 1767703719000,
    "title": "Morgan Stanley files S-1s for Bitcoin and Solana ETFs in latest crypto push",
    "body": "The investment banking giant’s filings for Bitcoin and Solana ETFs follow an uptick in investor demand for regulated crypto investment vehicles, driven by the new year’s “clean-slate” effect.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56892751,
    "published": 1767705055000,
    "title": "Crypto Latecomer Morgan Stanley Files for Bitcoin, Solana ETFs",
    "body": "Morgan Stanley filed for Bitcoin and Solana exchange-traded funds, marking its first foray into the popular corner of the funds world two years after the explosion of crypto-focused ETFs in the US brought them into the mainstream.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "NYS:MS",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56893986,
    "published": 1767708011000,
    "title": "Santiment: Bitcoin Bulls Loading Up As Whales And Sharks Buy The Dip",
    "body": "Bitcoin moved higher on renewed buying from large holders while smaller wallets were seen booking gains, a pattern that on-chain watchers view as supportive for further upside. Related Reading: Bitcoin Wealth Isn’t About Hype—It’s About Time And Stacking, Expert Says Whale Accumulation And Retail Profit-Taking According to Santiment, wallets holding between 10 and 10,000 BTC — described as whales and sharks — have added 56,227 BTC since mid-December. At the same time, wallets with less than 0.01 BTC have been taking profits, suggesting some retail traders expect a bull trap or a fool’s rally. This split — heavy accumulation by large holders while small accounts sell — raises the odds of market cap growth across crypto. Supply Redistribution And Market Structure Market observers say supply is shifting in a way that helps price action. Analyst James Check pointed out that the top-heavy supply share has fallen from 67% to 47%, a large move in a short span. 📊 Crypto markets typically follow the path of key whale & shark stakeholders, and move the opposite direction of small retail wallets. In our chart below: 🟥 Whales dumping, Retail accumulating (VERY BEARISH) 🟧 Whales dumping, Retail unpredictable (BEARISH) 🟨 Whales & Retail… pic.twitter.com/yoC0H1keBT — Santiment (@santimentfeed) January 5, 2026 That shift, paired with a drop in profit-taking and signs of a short-squeeze in futures, has supported higher prices even as overall leverage stayed low. Bitcoin has been mostly rangebound between roughly $87,000 and $94,000 for about six weeks, but it briefly reached a seven-week high of $94,800 on Coinbase during late trading on Monday. Options And Key Levels Traders watching option interest see heavy call activity around the $100,000 strike for January expiry. Data shows Bitcoin as being in a bullish consolidation phase, with immediate resistance seen at $95,000 to $100,000 and support placed near $88,000 to $90,000. A clean break above the upper zone could push prices higher, while a breach below the lower zone might invite deeper selling pressure. Geopolitical Shock And Trading Volume Following the capture of Venezuelan President Nicolás Maduro by US forces, Bitcoin moved to multi-week highs and traded above key levels near $93,000 on Monday, based on reports. Analysts tied the move partly to geopolitical uncertainty pushing some investors toward alternative assets. Speculation about Venezuela’s alleged large BTC holdings — reportedly hundreds of thousands of coins — also added to market chatter and trade activity. Overall, the event coincided with higher volatility and volume, reflecting broad market reactions to global tension rather than serving as a direct driver of Bitcoin’s fundamental value. Related Reading: A Maduro Bet, A Market Alarm: US Lawmaker Targets Trading Abuses What This Means For Traders The current mix of big-wallet buying and retail profit-taking gives the market a tilted bias. If accumulation by whales continues, the chance of an upward breakout rises. Yet the retail sell-off warns that short-term reversals remain possible. The $95,000 to $100,000 range appears to be a key area for a potential breakout, while support around $88,000 to $90,000 could influence sentiment if prices fall below it. Reports and on-chain data suggest momentum leans toward further gains, though the market may remain volatile as traders respond to both technical levels and geopolitical developments. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btcusd|bulls|crypto|Maduro|Trump|Venezuela|whales",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56894478,
    "published": 1767708933000,
    "title": "Maine Reaches $1.9M Settlement With Bitcoin ATM Operator Over Scam Losses",
    "body": "The agreement with Bitcoin Depot comes amid growing national scrutiny of crypto kiosks tied to fraud targeting older Americans.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56894246,
    "published": 1767708561000,
    "title": "CoinDesk 20 Performance Update: SUI Gains 5.5% as Index Moves Higher",
    "body": "Uniswap (UNI) joined Sui (SUI) as a top performer, up 3.3% from Monday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|CoinDesk Indices|CoinDesk 20|charts|Prices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56896192,
    "published": 1767712400000,
    "title": "This metric suggests bitcoin's late November plunge was the bottom and major upside lies ahead",
    "body": "Extreme readings in the ratio between short-term holder supply in profit and short-term holder supply in loss have aligned with the end of bear markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Glassnode|on-chain|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56896738,
    "published": 1767713449000,
    "title": "Analyst Says the Worst Is Over For Dogecoin, Predicts Rally To $0.8",
    "body": "Crypto analyst Charting Guy has predicted that the worst may be over for Dogecoin, with a potential rally to $0.8 on the cards. This comes as meme coins like DOGE dominate the crypto market at the start of this new year. Dogecoin Eyes Rally To $0.8 As The Worst May Be Over In an X post, Charting Guy shared a chart showing that Dogecoin could rally to as high as $0.8, marking a new all-time high for the foremost meme coin. Based on this, he remarked that the worst may be over if the meme coin was following a chart pattern he had mapped out earlier. The analyst had earlier raised the possibility of DOGE entering a long-term consolidation, similar to XRP, and then breaking out, with a rally to as high as $1. Related Reading: Dogecoin Price On The Brink Of A 9,000% Rally To $10? What Historical Performance Shows Charting Guy’s accompanying chart showed that Dogecoin could trade sideways until mid-2028 and then break out to this $0.8 target, with the possibility of even reaching the psychological $1 level. With the worst being over, the drop to $0.11 last month could mark the bottom for the meme coin, especially seeing as it has regained its bull market structure. Dogecoin has begun the year with a rally of almost of 30% as meme coins lead the current crypto market rally. Thanks to this, DOGE is the top gainer among the top 10 cryptos by market cap. The rally has also reignited institutional interest in the meme coin, with the DOGE ETFs recording significant inflows. SoSoValue data show that these funds recorded net inflows of $2.30 million on December 2 and $1.60 million yesterday, marking the first time they have seen consecutive inflows since December 3, 2025. How Things Could Play Out For DOGE In The Short Term In another X post, Charting Guy shared a chart highlighting his lower-timeframe speculation for Dogecoin. The chart showed that DOGE could sustain this rally and reach $0.2 at the start of February. Once that happens, the meme coin could experience a sharp pullback, dropping to as low as $0.12 in March, which could mark the bottom. Dogecoin will then see another impulsive move to the upside, breaking above $0.2 this time around and potentially reaching $0.22. Related Reading: Dogecoin Price Could Rally To All-Time Highs If It Breaks This Resistance Level Crypto analyst Javon Marks provided a more bullish outlook for Dogecoin, stating that the next seemingly modest targets are $0.6533 and $1.25111. However, he added that altcoin seasons have shown that DOGE can have upside potential beyond the imagination of many people, and his accompanying chart indicated that a rally to $11 was possible. At the time of writing, the Dogecoin price is trading at around $0.15, up in the last 24 hours, according to data from CoinMarketCap. Featured image from Peakpx, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|Altcoin Season|Charting Guy|CoinMarketCap|doge|DOGE news|Doge price|Dogecoin ETFs|Dogecoin news|dogecoin price|dogeusd|dogeusdt|Javon Marks|meme coin|SoSoValue|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56897008,
    "published": 1767714065000,
    "title": "BNB breaks $910 resistance on wider crypto market rally momentum",
    "body": "Market participants defended rising support while trading volume surged 66% above average during resistance tests near $908, pointing to increasing demand ahead of major network upgrade.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56896948,
    "published": 1767713826000,
    "title": "Why crypto-treasury stocks fall faster than the assets they hold",
    "body": "Crypto-treasury stocks can fall harder than the coins they hold. Leverage, valuation premiums, dilution risk and equity market structure amplify downside moves.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56896914,
    "published": 1767713795000,
    "title": "Morgan Stanley Registers Bitcoin and Solana Funds With SEC",
    "body": "Morgan Stanley files for Bitcoin and Solana ETFs as crypto investment products gain Wall Street traction with $119 billion in BTC assets under management.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56897601,
    "published": 1767715006000,
    "title": "XRP price 'starting to respond' to gold's multiyear 180% boom: Analyst",
    "body": "XRP mirrors gold’s past breakout pattern, fueling speculation of an $8–$10 rally in 2026 if the fractal continues to play out.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56897879,
    "published": 1767715801000,
    "title": "Former CFTC Commissioner Brian Quintenz joins SUI Group board",
    "body": "Quintenz, who previously led policy at a16z crypto, joins the Nasdaq-listed firm as it advances its SUI-focused treasury strategy.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Brian Quintenz|Hiring|CFTC|Sui|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56898927,
    "published": 1767717842000,
    "title": "Dogecoin Barks Up Huge Gains as Bitcoin Climbs and Meme Coins Show Signs of Life",
    "body": "Dogecoin is up 17% in the last week as interest in meme coins begins to rebound as Bitcoin climbs to a monthly high.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|dogecoin|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56898573,
    "published": 1767717000000,
    "title": "Iran’s currency collapse shows why Bitcoin is seen as an exit option",
    "body": "As Iran’s rial hits record lows, Bitcoin is resurfacing in public discourse. Its decentralized design is often cited as a contrast to state-managed fiat currencies.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56898650,
    "published": 1767716012000,
    "title": "Global Crypto MCap up to $3.22 Trillion! XRP up 12%! Japan Endorse Crypto! Fear & Greed back to Neutral!",
    "body": "The global crypto market cap pushed another 2% to $3.22T as majors continue to grind up; BTC +1% at $93,780; ETH +2% at $3,240, SOL +3% at $139; XRP led up 12% to $2.37RENDER (+18%), SUI (+18%) and LIT (+15%) led top movers. Bank of America formally launched its crypto recommendations for wealth clients with up to 4% portfolio allocation. Morgan Stanley filed for a Solana Trust with the SEC. Goldman Sachs upgraded Coinbase to a ‘Buy’ rating today while simultaneously downgrading eToro. Japan’s finance minister endorsed deeper crypto integration, including lower taxes and exchange-level reforms. Vitalik Buterin claimed Ethereum has effectively solved the “Blockchain Trilemma” by balancing decentralization and scalability through its Layer-2 roadmap. Kraken is investigating reports that customer data is allegedly for sale on the dark web following a potential security exploit. Ledger users are on high alert as the hardware wallet provider faces a data breach involving its e-commerce partner, Global-E, exposing customer contact details.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56899399,
    "published": 1767718803000,
    "title": "Bitcoin Wins As Trump Pumps GDP, Suppresses Oil: Arthur Hayes",
    "body": "Arthur Hayes argues that the US move to seize control of Venezuelan oil is less about geopolitics than electoral math and that the resulting policy mix of hotter nominal growth and capped energy costs is structurally bullish for Bitcoin and high-beta crypto. In a Jan. 6 essay titled “Suavemente,” the BitMEX co-founder frames the current moment through a deliberately simple lens: US politicians optimize for re-election, and the median voter optimizes for perceived economic wellbeing. “The question is, does the American colonization of Venezuela make Bitcoin/crypto number go up or down?” Hayes writes. Hayes’ core claim is that US political control is decided at the margins, and those margins respond overwhelmingly to the economy and inflation, particularly “food and energy” inflation. “Above all else… the only issue that the median voter cares about is the economy,” he writes. “It is easy to pump the economy, and by that, I mean nominal GDP. That is just a question of how much credit Trump can create.” Related Reading: Venezuela, Geopolitical Risk, And Bitcoin: What On-Chain Data Really Shows But Hayes insists the same playbook can backfire if inflation follows, especially at the pump. “The key metric for Americans is the price of gasoline,” he writes, arguing that limited public transportation makes gas prices a daily referendum on economic management. In that framework, Venezuela’s value is straightforward: suppress oil, suppress gasoline, and keep the “run the economy hot” promise intact without triggering voter backlash. He highlights what he calls a “10% rule”: “when the national average price of gasoline rises 10% or more in the three months preceding an election versus the average price in January of the same calendar year, control of one or more branches of government switches teams.” That dynamic, in his telling, creates two regimes that matter for markets: nominal GDP/credit up with oil up, or nominal GDP/credit up with oil flat-to-down. Why Bitcoin “Wins” If Oil Stays Contained Hayes’ bullish conclusion rests on the idea that oil prices constrain the durability of money printing, not the mechanics of Bitcoin itself. “Because of the energy used running computers engaged in proof of work mining, Bitcoin is the purest monetary abstraction there is,” he writes. “Therefore, the price of energy is irrelevant to the price of Bitcoin as all miners will face a parallel shift up or down in the price at the same time. The price of oil only matters regarding its ability to force politicians to stop printing money.” Related Reading: John Bollinger: Bitcoin BB Squeeze Breakout Targets $107,000 In his setup, the stress signals are macro-market ones: the 10-year Treasury yield and the MOVE Index, a measure of bond-market volatility. He argues that when oil rises far enough to push yields “close to 5%,” volatility spikes, leverage unwinds, and policymakers are pressured into a pivot. Hayes points to a prior episode as a template for reflexivity: “If you remember, Trump threatened tariffs so high… markets tanked, and the MOVE Index spiked to an intraday high of 172. The next day after the spike, Trump… ‘paused’ the tariffs, and markets bottomed then recovered violently.” Absent that stress, Hayes’ base case is aggressive credit expansion with oil “subsided if not outright fall,” which he ties directly to Bitcoin upside. He cites his “USD Liquidity Conditions Index” as evidence that Bitcoin’s trend tracks dollar liquidity, concluding: “As the amount of dollars expands, the price of Bitcoin and certain cryptos will sky rocket.” The essay also reads like a positioning memo. Hayes says his fund, Maelstrom, entered 2026 with “almost maximum risk,” low dollar-stable exposure, and an intention to rotate: “To obtain outperformance versus BTC and ETH, I will sell BTC to fund privacy positions and sell ETH to fund DeFi.” He names Zcash (ZEC) as the “privacy beta,” saying the fund is “already long a fuck ton of that” from 3Q25. At press time, Bitcoin traded at $93,841. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|Arthur Hayes|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 16,
        "NAME": "COMMODITY",
        "CATEGORY": "COMMODITY"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56899613,
    "published": 1767719300000,
    "title": "Crypto prices retreat in return to downward U.S. trading day action",
    "body": "Bitcoin pulled back to just above the $92,000 area as gold surged back to $4,500 per ounce and silver rallied above $80.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Market Wrap|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56899504,
    "published": 1767719143000,
    "title": "Don’t hold your breath for Venezuela’s bitcoin",
    "body": "Ledn co-founder Mauricio Di Bartolomeo, born and raised in Venezuela, argues that the country’s government is simply too corrupt and incompetent to have accumulated a rumored $60 billion stash of bitcoin.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Opinion|Venezuela|Nicolas Maduro|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56900103,
    "published": 1767720016000,
    "title": "MarketVector, Amplify roll out stablecoin, tokenization benchmark, ETFs",
    "body": "The new products offer indirect, regulated exposure to companies building stablecoin and real-world asset infrastructure as adoption accelerates.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56901063,
    "published": 1767721883000,
    "title": "Bitcoin faces 'big boy sell wall' at $95K as BTC price struggles vs. gold",
    "body": "Bitcoin halted its gains as sellers came out to suppress BTC price upside close to $95,000, with the key weekly close target now in place.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56901722,
    "published": 1767723524000,
    "title": "‘Like sats for Bitcoin’: Tether creates tiny gold unit as onchain demand grows",
    "body": "The stablecoin issuer says its Scudo unit could make gold easier to transact digitally as prices surge and institutional demand accelerates.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56901669,
    "published": 1767723410000,
    "title": "Polkadot's DOT declines in U.S. afternoon selloff",
    "body": "The technical breakdown erased earlier gains as DOT plunged through $2.19 support on heavy volume.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Polkadot|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 21,
        "NAME": "DOT",
        "CATEGORY": "DOT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56902235,
    "published": 1767723402000,
    "title": "Crypto starts 2026 STRONG! Venezuela Impacts on the market! Lighter TGE reactions!",
    "body": "The global crypto market cap pushed another 2% to $3.22T as majors continue to grind up; BTC +1% at $93,780; ETH +2% at $3,240, SOL +3% at $139; XRP led up 12% to $2.37RENDER (+18%), SUI (+18%) and LIT (+15%) led top movers. Bank of America formally launched its crypto recommendations for wealth clients with up to 4% portfolio allocation. Morgan Stanley filed for a Solana Trust with the SEC. Goldman Sachs upgraded Coinbase to a ‘Buy’ rating today while simultaneously downgrading eToro. Japan’s finance minister endorsed deeper crypto integration, including lower taxes and exchange-level reforms. Vitalik Buterin claimed Ethereum has effectively solved the “Blockchain Trilemma” by balancing decentralization and scalability through its Layer-2 roadmap. Kraken is investigating reports that customer data is allegedly for sale on the dark web following a potential security exploit. Ledger users are on high alert as the hardware wallet provider faces a data breach involving its e-commerce partner, Global-E, exposing customer contact details.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56903357,
    "published": 1767726567000,
    "title": "US crypto market structure bill could be delayed until 2027: Report",
    "body": "The midterm elections in November could cause some Senate Democrats to withhold support for the Responsible Financial Innovation Act due to conflict of interest concerns.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56903062,
    "published": 1767726320000,
    "title": "U.S. Senate back to crypto talks as industry's make-or-break bill faces time crunch",
    "body": "Senators met to restart the high-stakes negotiation over the crypto market structure bill, and one of them reportedly said a markup is planned next week.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|U.S. Senate|crypto legislation|Tim scott|U.S. Senate Banking Committee|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56903111,
    "published": 1767726000000,
    "title": "ETH price taps $3.3K: Here’s what must happen for another 20% rally",
    "body": "ETH’s price chart shows a confirmed double bottom pattern with a $3,900 price target. Here are the necessary factors to make it happen.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56903933,
    "published": 1767727977000,
    "title": "EU Calls Grok's Child Images 'Illegal' as Global Crackdown Intensifies",
    "body": "The European Commission called Grok's AI-generated child images \"illegal\" and \"disgusting\" as countries start cracking down on Elon Musk's chatbot.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56904705,
    "published": 1767729647000,
    "title": "Pundit Warns XRP Investors To Stop Calling For $10,000, Shares ‘Realistic’ Price Targets",
    "body": "A prominent crypto commentator known as Mason Versluis has issued a notable warning for XRP investors, pointing out that parts of the discussion around XRP to lofty price targets as high as $10,000 have drifted far away from reality and risk misleading investors. Pundit Pushes Back Against $10,000 XRP Predictions Bullish price predictions around XRP have been arriving at an unusually fast pace in recent months, especially as spot exchange-traded funds and institutional participation are now a major part of investor conversations. Related Reading: The Great XRP Exodus: Here’s How Much Is Left On Crypto Exchanges Social media platforms are now filled with increasingly high targets, ranging from triple-digit valuations to extreme calls for four-figure and even five-figure prices at $10,000. Just a few years ago, you would not have believed such XRP price predictions would be as rampant as this. In a recent video clip circulating across the crypto community, Mason Versluis delivered an unusually blunt assessment of the $10,000 predictions for the altcoin. He dismissed the figure outright, noting that such price targets should not even be part of current conversations. According to Versluis, anyone aggressively promoting those numbers is doing investors a disservice and misleading them. His argument is based on the fact that XRP has yet to demonstrate the ability to break above far lower price levels, making five-digit projections detached from present conditions. A closer look at XRP’s circulating supply explains why the $10,000 prediction raises doubts. XRP currently has a circulating supply of about 66 billion tokens with a market cap of $141.9 billion. Therefore, calculations based on the current circulating supply would imply a market cap of roughly $660 trillion if the altcoin reaches $10,000, which is far greater than the current top 100 assets by market cap combined. To put this in context, gold currently has a market cap of about $31 trillion. The most realistic way that the token might reach $10,000 is for the circulating supply to decrease significantly. Bullish Bias Exists, But Built Around Progression According to Versias, XRP reaching $10,000 is not outright impossible. However, the world has only seen roughly 2% of the changes that would be required for XRP to approach a $10,000 valuation. Related Reading: Here’s How Much The XRP Price Will Be If It Overtakes Ethereum In Market Cap XRP has not even reached $10, let alone maintained it. In order for any outstanding price levels to become a reality, XRP would first need to break above double digits $10, and hold above. From here, discussions about $50, $100, or higher only become meaningful after XRP proves strength at each preceding level. Despite the criticism, Versluis made it clear that his outlook on XRP is not bearish. He acknowledged that his stance has grown increasingly optimistic due to developments such as ETF momentum, DeFi activity, and institutional engagement surrounding XRP and the XRP ledger, continuing to improve. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|DeFi|etf|Mason Versias|Ripple|xrp|XRP Ledger|xrp news|XRP Price|XRPL|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56904508,
    "published": 1767729087000,
    "title": "Bitcoin ETFs Just Had Their Best Day in Months as Crypto Market Rebounds",
    "body": "Bitcoin ETFs hit $697 million in single-day inflows as Morgan Stanley enters the race with new BTC and Solana fund filings.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56904835,
    "published": 1767729600000,
    "title": "Bitcoin liquidation data point to ‘absurd’ potential rally to $100K: Analyst",
    "body": "Bitcoin’s liquidation map is still heavily biased toward a downside liquidity sweet, but a swift rally to $100,000 could quickly turn the tables in the bulls’ favor.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56905594,
    "published": 1767731392000,
    "title": "Asset manager Bitwise sees 3 tests for crypto’s 2026 rally",
    "body": "Bitcoin and ether are off to a strong start this year, and Bitwise says the path to new highs hinges on market stability, U.S. legislation and calm equities.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Ether|Bitwise Asset Management|Analysts|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56906486,
    "published": 1767733206000,
    "title": "Dogecoin’s Rebound Gains Traction Amid DOGE ETF Activity and Renewed Memecoin Demand",
    "body": "Dogecoin (DOGE) has extended its rally into early 2026, showing signs of sustained momentum as the memecoin space experiences renewed interest. Related Reading: Here’s Why The Shiba Inu Price Jumped Over 13% After a nearly 30% rise over four days, DOGE is consolidating above key technical levels, supported by rising trading volumes, derivatives data, and the growing popularity of leveraged Dogecoin ETFs. DOGE's price trends to the upside on the daily chart. Source: DOGEUSD on Tradingview Technical Momentum Supports Dogecoin Consolidation Dogecoin’s recent surge began after establishing a base around $0.132, breaking through resistance zones at $0.145 and $0.150. The rally peaked near $0.154 before entering a consolidation phase, a typical pattern in trending markets that suggests a healthy price structure rather than a sharp reversal. Currently trading near $0.151, DOGE remains above short-term moving averages, with immediate support levels at $0.150 and $0.145. Technical indicators, like the RSI, are above 50, signaling ongoing bullish momentum. However, some oscillators near overbought territory suggest that minor pullbacks could occur. On the upside, breaking through the $0.154 to $0.155 resistance range could pave the way for targets between $0.162 and $0.166, with potential extensions toward $0.175 and $0.180. Conversely, a drop below $0.142 may open the door to lower support levels near $0.135. DOGE ETF Activity and Whale Accumulation Fuel Rally The derivatives market reflects growing confidence in DOGE. Open interest in Dogecoin futures recently peaked at 13.47 billion contracts before a slight controlled decline, indicating leveraged positions are being managed cautiously rather than rapidly unwound. Adding to the momentum, a 2x leveraged Dogecoin ETF has become one of the top-performing ETFs in the first quarter of 2026, highlighting renewed institutional and retail interest. These ETFs amplify buying pressure by requiring fund managers to adjust their holdings to maintain leverage, effectively creating a feedback loop that can boost DOGE’s price during upswings. Large holders, or whales, have been active, purchasing hundreds of millions of DOGE tokens within a short span. This accumulation suggests confidence in further upside and can create a supply squeeze that reinforces price gains. Memecoin Revival Reflects Broader Market Trends Dogecoin’s rally is part of a larger revival in the memecoin sector. The overall market capitalization of memecoins has increased by more than 30% recently, reaching nearly $48 billion after months of underperformance. Historically, periods of low memecoin dominance often precede significant rallies, and DOGE, as the original and most liquid memecoin, frequently leads these cycles. Related Reading: John Bollinger: Bitcoin BB Squeeze Breakout Targets $107,000 The broader crypto market’s relative stability, particularly in Bitcoin and Ethereum, supports speculative flows into high-beta assets like DOGE. Additionally, social media engagement and mentions from influential figures can provide further catalysts, although these factors remain unpredictable. Cover image from ChatGPT, DOGEUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|Doge price|dogeusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56906834,
    "published": 1767733695000,
    "title": "Jupiter launches JupUSD stablecoin backed by BlackRock’s BUIDL fund",
    "body": "The Solana-native token is backed by USDtb and USDC and is designed to serve as a settlement asset across Jupiter’s DeFi stack.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56908322,
    "published": 1767736829000,
    "title": "Japan’s XRP Integration Signals A Shift In Global Capital Flows",
    "body": "Japan’s integration of XRP into regulated capital flow infrastructure marks a decisive shift in how digital assets are being positioned within modern finance. The move suggests that XRP is transitioning from a cross-border payments tool into a component of regulated capital flow infrastructure. It also reframes XRP as a settlement layer increasingly aligned with institutional standards, compliance frameworks, and real-world financial throughput. Why This Integration Marks A Structural Inflection Point For XRP The Japanese are embedding XRP and crypto into core capital flows. Crypto analyst Xfinancebull revealed that when the Japanese finance minister openly supports crypto integration within stock exchanges, it’s not just policy. Rather, it is a regulatory green light for integration into core capital markets. Related Reading: XRP Advances As A Recognized Digital Asset In Regulated Markets — Here’s How Furthermore, this move will open the door to a $7 trillion value in equity rails and provide the altcoin a direct path to be regulated into Exchange-Traded Products (ETPs), broker access, and structured products. With SBI corridors and RLUSD already live, this has become a demand engine, not a theory. XRP has been integrated into Japan’s financial system for years, backed by real-world infrastructure and regulated clarity. The alignment between rails and regulation is rare, but now the capital can meet the infrastructure. According to an analyst known as UnknowDLT, not enough has been said about GTreasury. Currently, Ripple is partnering with JPMorgan. This partnership is an infrastructure-level connection that has placed Ripple technology to directly access the corporate payment rails used by JPMorgan and other large banks. By integrating Ripple’s stack at this layer, it will allow XRP to be used as a settlement asset or a backend liquidity layer, without the end user explicitly using the altcoin. When inserted behind the scenes, the altcoin can reduce prefunding, optimize liquidity, and act as a neutral bridge asset between currencies and systems. How Demand Steps In At Key Structural Level For XRP Crypto trader known as ZiP on X has highlighted that the support zone at the end of November has now been clearly defended, and the market responded with two strong bullish candles on the weekly chart. This is the first clear sign that demand has stepped in exactly where it should be on the higher timeframe. Related Reading: Analyst Updates XRP Price Prediction: Why $16 Is Still On The Table Currently, the XRP price is approaching a key decision area around $2.30, a zone that stands out as the area where supply may become active and attempt to show or stop the move higher. The reaction from this zone will show the market’s next move. However, if demand manages to break through the $2.30 level and hold the price above it on a weekly closing basis, it would signal acceptance, as the next significant resistance sits around $3.20. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|ETPs|Exchange-Traded Products|GTreasury|jpmorgan|Ripple|UnknowDLT|XFinanceBull|xrp|xrp news|XRP Price|XRPUSD|xrpusdt|ZiP",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56908511,
    "published": 1767737131000,
    "title": "Flow details December exploit that led to $3.9M in losses due to counterfeit tokens",
    "body": "A protocol-level flaw allowed assets to be duplicated rather than minted, prompting a network halt and a governance-led recovery process.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 56910051,
    "published": 1767740404000,
    "title": "XRP Leads Market Rally with 12% Surge: What’s Driving the Spike?",
    "body": "XRP surged 12% to reach $2.42 on January 6, marking its highest price since mid-November 2025, before hovering around the current $2.35 mark. Related Reading: Here’s Why The Shiba Inu Price Jumped Over 13% The jump coincided with a strong influx of capital into XRP-focused exchange-traded funds (ETFs), technical breakout patterns, and a sharp reduction in short positions. These aspects combined to drive one of the most notable rallies in the crypto market’s early 2026 recovery phase. XRP's price trends to the upside on the daily chart. Source: XRPUSD on Tradingview XRP ETF Inflows and Institutional Interest Fuel Gains Spot XRP ETFs recorded $48 million in net inflows on January 5 and 6, marking the largest daily inflows since their launch in November 2024. Over the past eight weeks, these ETFs have experienced a consistent inflow of approximately $1.23 billion, reflecting a growing institutional appetite for XRP exposure. The increased buying pressure from these funds is helping absorb selling pressure and reduce the available supply on exchanges. Vincent Liu, Chief Investment Officer at Kronos Research, noted that ETF inflows combined with XRP breaking key resistance levels on strong volume have heightened traders’ risk appetite. This institutional interest is supported by regulatory clarity following 2025’s Ripple’s settlement with the U.S. Securities and Exchange Commission (SEC), which removed a major obstacle to adoption. Technical Breakout and Short Squeeze Accelerate Price Movement Technical analysts point to a breakout from a falling wedge pattern, with XRP maintaining levels above its 50-day moving average, a positive indicator for momentum traders. During the price surge, over $250 million in short positions were liquidated within a single hour, adding fuel to the rally by forcing short sellers to cover their bets. Renowned trader John Bollinger, inventor of the Bollinger Bands, commented that XRP is following a similar bullish pattern to Bitcoin and Ethereum but with slightly weaker momentum. Nonetheless, he suggested that XRP’s price could track Bitcoin’s upward trend, with analysts projecting a potential target near $3.50 if current support levels hold. Broader Market Context and Future Outlook XRP’s rally comes amid a broader crypto market recovery, with Bitcoin and Ethereum rising 7.4% and 9.3% respectively over the past week. On-chain data indicate a decline in XRP balances on centralized exchanges, suggesting reduced selling pressure. Institutional backing continues to grow, with PwC recently endorsing Ripple as a core player in blockchain-based financial services. Major banks such as Standard Chartered have projected XRP prices as high as $8 by the end of 2026, based on Ripple’s increasing integration in cross-border payments and settlement solutions. Related Reading: John Bollinger: Bitcoin BB Squeeze Breakout Targets $107,000 As market sentiment improves and regulatory uncertainties ease, XRP appears positioned to benefit from both technical momentum and growing institutional demand. Traders will be watching closely to see if XRP can sustain gains above key resistance zones around $2.30 and potentially push toward higher price targets. Cover image from ChatGPT, XRPUSD chart on Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ripple|xrp|XRP Price|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56911917,
    "published": 1767744039000,
    "title": "Same XRP Setup That Led To Over 1,000% Increase In 2017 Is Playing Out Again",
    "body": "XRP has shown a notable uptick in price action in the past 48 hours as XRP’s price pushed higher from below $2 at the beginning of the year, but it now finds itself trading near the $2.40 region. Interestingly, this recent push is more than just a bounce, especially as a longer-term chart structure shows comparisons with XRP’s behavior ahead of its 2017 breakout. How The 2017 Structure Unfolded Before The Surge Technical analysis of XRP’s current price action on the weekly candlestick timeframe chart shows that the cryptocurrency is currently tracing out a similar price action to what it went through back in 2017 on the 3-day chart. In that earlier period, price action unfolded through a well-defined five-wave sequence, characterized by alternating phases of decline and recovery. Waves one, three, and five each pushed the price lower with corrective pressure, while waves two and four produced temporary rebounds that relieved selling pressure but failed to establish a lasting trend reversal. Related Reading: Bitcoin Price Parabola: What’s Different Between The Last Bull Cycle And This One? The final stage of that sequence was particularly important. During the fifth wave, XRP’s decline slowed and compressed into a falling wedge formation. XRP’s price slipped below the $0.005 level and eventually stabilized around $0.00485, where downside follow-through became increasingly limited. From here, the downside pressure gradually weakened, volatility contracted, and selling momentum faded. When XRP finally broke out of that compression, it quickly reclaimed the $0.008 zone and broke through $0.02, resulting in the start of a rally that ultimately delivered gains well in excess of 1,000%. XRP Price Chart. Source: @Steph_iscrypto According to Steph’s analysis, XRP’s recent price action is following a remarkably similar rhythm. After topping out around $3.40 in mid-2025, the cryptocurrency entered a corrective phase that pushed the price steadily lower to create a falling wedge structure. That decline found support at $1.74, where selling pressure slowed and price action stopped making aggressive new lows. Now, it seems XRP is breaking out of the falling wedge and back to solidifying its price action above $2. XRP Price Action In Focus Now that XRP is back to trading above $2 and above the falling wedge, the next course of action is to look at how the price behaves from here. Of course, the most bullish course of action is for XRP to repeat a 1,000% rally, which would place it at a price target around $22. Related Reading: Popular Crypto Founder Dumps Millions In Ethereum, Here’s What He’s Buying In terms of how this plays out, there are resistance levels to watch out for. The $2.30 area is an early test, followed by $2.50 and $2.80, which are prior consolidation levels where XRP slowed down during its push to all-time highs in 2025. After that, the $3.10 price level and the previous 2018 high at $3.40 are the major resistances that would need to be reclaimed. On the downside, sustained weakness below $1.90, and especially a move back toward $1.74, would challenge the idea that the corrective phase has fully played out. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56911534,
    "published": 1767743181000,
    "title": "The AI Brain Is Born: Siemens And NVIDIA Forge Industrial Intelligence",
    "body": "Siemens unveils Digital Twin Composer at CES, partnering with NVIDIA and PepsiCo to bring AI-powered autonomous manufacturing to factory floors worldwide.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|Business|/business|Innovation Rx: Technologies|/feature/innovation-rx/technologies|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 56913649,
    "published": 1767747629000,
    "title": "XRP Breaks Structure With Power — Now The Real Test Begins At $2.41",
    "body": "XRP has surged past recent resistance with impressive momentum, signaling strength in the current rally. However, the real challenge now lies at the $2.41 cost-basis zone, a key area where a significant amount of XRP was previously accumulated. How price reacts here will likely dictate whether bulls can maintain control and push toward higher targets, or if selling pressure creates a temporary pause or pullback. XRP Approaches A Critical Cost-Basis Resistance At $2.41 According to a recent update from Steph Is Crypto, XRP is now at a pivotal crossroads, with price action increasingly centered around the $2.41 level. This zone stands out as a major cost-basis wall where several technical and on-chain signals align, making it a decisive area in determining whether the current rally can extend or begin to stall. Related Reading: XRP Enters A Make-or-Break Zone As This Long-Term Support Cracks The cost-basis distribution heatmap highlights the $2.41 region as a dense supply cluster. Cost basis represents the price levels at which tokens were previously acquired. When the price returns to these areas, they often attract heightened trading activity. On-chain data shows that between $2.39 and $2.41, roughly 1.56 billion XRP were accumulated. Many holders who bought in this range may look to exit positions to break even as the price revisits the zone, introducing selling pressure and reinforcing the area as resistance. This dynamic is also reflected in the XRP price chart, which shows repeated hesitation and multiple rejections around the same level. The alignment between on-chain supply data and technical price action suggests that $2.41 is an important level that XRP must overcome decisively to unlock the next leg higher. Wave 3 Breaks Out Above The 2.618 Extension With Strong Momentum Tara revealed that XRP’s Wave 3 has delivered a powerful breakout, pushing beyond the 2.618 Fibonacci extension and clearing the macro resistance at $2.30. This move was accompanied by a strong RSI reading, signaling strength behind the advance. Related Reading: XRP Price May Be Bearish Below $2, But On-Chain Data Tells A Different Story With Wave 3 extending higher, Tara identified $2.49 as the next key upside target, which aligns with the 0.618 Fibonacci extension of the fifth wave. Despite the strength of the move, Tara advised preparing for a short-term pullback. A brief retracement could allow the RSI to cool off, creating healthier conditions for the next leg higher and potentially setting up a clearer divergence on a renewed push. As long as XRP remains above the macro 0.236 Fibonacci level, the broader bullish structure stays intact. Tara is closely monitoring lower-timeframe support zones, marked in green, while continuing to track the move as a developing Wave 1/3 impulse. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Fibonacci Extension|Fibonacci Level|Ripple|RSI|Steph is Crypto|TARA|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56904121,
    "published": 1767728461000,
    "title": "How to stay safe after the Ledger customer data leak: experts urge privacy first",
    "body": "Security researchers spoke to CoinDesk about how users can protect themselves after Monday’s breach saw yet more Ledger customer data leaked to malicious actors.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Tech|Ledger|Privacy|Data|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      }
    ]
  },
  {
    "id": 56914949,
    "published": 1767750241000,
    "title": "Bitchat dev shrugs off Uganda’s threat to block app: ‘Good luck mate’",
    "body": "Bitchat developer Calle boldly said, “You can’t stop us” as Uganda threatened to block Bitchat ahead of its election next week.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56915420,
    "published": 1767751239000,
    "title": "XRP Shows “Coiled Spring” Setup As Network Liquidity Hits Record Levels",
    "body": "XRP has regained momentum after reclaiming the $2.20 level and extending its move toward the $2.41 mark, marking one of its strongest advances in recent months. The recovery comes after a prolonged period of selling pressure and uncertainty, and it has reignited bullish expectations among a segment of investors who now believe XRP could challenge or even surpass its all-time high later this year. While skepticism remains across the broader market, price action suggests that XRP is no longer purely defensive. Related Reading: Venezuela, Geopolitical Risk, And Bitcoin: What On-Chain Data Really Shows According to a recent CryptoQuant report, early January brought visible improvement across the crypto sector, with Bitcoin pushing toward $93,000 and XRP moving decisively above $2.30. That synchronized strength helped shift sentiment, as XRP broke out of its prior consolidation range and began showing signs of renewed trend formation. Significantly, the move has not been driven by price alone. On-chain data points to a deeper structural change within the XRP ecosystem. Activity on the XRP Ledger has accelerated sharply, with network growth reaching levels not seen during the previous consolidation phase. This expansion suggests that rising prices are being supported by genuine usage and participation rather than short-term speculation. XRPL Liquidity Surge Signals Structural Shift Behind Breakout The CryptoQuant report indicates a decisive change in XRP’s market structure, driven not only by price appreciation but also by deep shifts in liquidity and participation. One of the most striking developments is the explosion in liquidity on the XRPL decentralized exchange, which has climbed to roughly $173 billion. Rather than thinning out during periods of weakness, liquidity has expanded sharply, suggesting that large players are actively positioning rather than exiting. This behavior is typically associated with preparation for heightened volatility or a more durable trend change. The timing of this expansion is also important. Since mid-December, liquidity spikes have become both more frequent and larger in size, a pattern that aligns with the entry of more sophisticated market makers. This effectively transforms the trading environment, making it easier for whales and institutional participants to deploy size without causing disruptive price swings. In practical terms, XRP is becoming a more efficient market for large-scale capital. Crucially, this liquidity is not idle. Transaction activity on the XRPL DEX has surged, indicating that deeper order books are supporting real usage rather than passive positioning. At the same time, market behavior has shifted toward buyer dominance. Aggressive buying has taken control, while bearish pressure has faded, allowing the price to break out of its prior compression. Forced short covering further reinforced that move and helped propel XRP through key resistance near $2.30. Together, these dynamics suggest that structural improvements, not just speculative momentum, underpin XRP’s recent strength. Related Reading: Memecoin Strength Returns After Historic Market Decline: A Setup For A Comeback? XRP Faces Heavy Overhead Resistance XRP’s daily chart shows a notable shift in short-term momentum after a prolonged period of downside pressure. Price has surged from the December lows near the $1.85–$1.90 zone and is now trading around $2.35, marking a sharp recovery that has caught sellers off guard. Following months of lower highs and lower lows, analysts view this rebound as an early trend reversal attempt instead of a confirmed bullish continuation The breakout above the short-term moving average (blue line) is a constructive development. This level had previously acted as dynamic resistance throughout November and December, consistently rejecting upside attempts. Reclaiming it signals improving momentum and a potential shift in market structure. However, XRP is now approaching a dense resistance cluster between $2.45 and $2.65, where both the 100-day and 200-day moving averages converge. Historically, this zone has attracted strong selling pressure. Related Reading: Bitcoin Data Shows Aggressive Sellers In Control As BTC Consolidates Below $90K While the recent rally shows increased participation compared to late December, it remains well below the levels seen during prior impulsive advances. This suggests that although buyers are regaining control, conviction is still developing. A period of consolidation above $2.20 would help solidify this move. If XRP can hold above the $2.30–$2.35 area, the probability of a broader recovery toward $2.70 increases. Failure to do so would likely result in a pullback, keeping XRP range-bound and vulnerable to renewed selling pressure. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|xrp|XRP analysis|XRP demand|XRP liquidity|XRP network activity|xrp news|XRP Price|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56915353,
    "published": 1767750818000,
    "title": "US community banks join campaign to shut a GENIUS Act ‘loophole’",
    "body": "The Community Bankers Council has asked the Senate for a crypto market structure bill that will ban exchanges and others offering interest on stablecoins.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56915624,
    "published": 1767751663000,
    "title": "Asia Morning Briefing: Bitcoin holds steady above $90K as fresh money returns to crypto",
    "body": "New-year allocations support bitcoin prices as leverage cools and volatility expectations rise.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|btc|Bitcoin News|ETH|Ether|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56917147,
    "published": 1767754807000,
    "title": "Bitcoin Accumulation: Data Shows Institutions Are Net Buyers Again",
    "body": "After a phase of net Bitcoin selling, on-chain data suggests institutional entities have started accumulating the cryptocurrency once more. Bitcoin Rose Over 41% The Last Time Institutions Turned Into Net Buyers As pointed out by Capriole Investments founder Charles Edwards in an X post, institutions have once again turned into net buyers of Bitcoin. Below is the chart shared by Edwards that shows the trend in institutional behavior over the last few years. From the graph, it’s visible that institutional investors switched their behavior to selling back in October as Bitcoin observed a bearish shift following its price top above $126,000. Related Reading: Bitcoin Miner Capitulation Ends: Hash Ribbons Flash Buy Signal The distribution calmed down as the cryptocurrency stabilized into a phase of consolidation in December, with a turn to positive levels starting to appear. The metric has now grown further in the new year, a potential sign that institutional behavior may really be changing to one of net accumulation. In the chart, the analyst has highlighted the price moves that followed shifts to net buying from these humongous traders in the past. It would appear that, on average, Bitcoin rose 109% after this signal appeared. Though the individual outcomes have seen high variance, ranging from a rally of 390% after the 2020 signal to a drop of 13% in 2024. The last time that the signal appeared was in the first half of 2025 and what followed was a price surge of 41%. It now remains to be seen how the cryptocurrency’s price will be affected this time around. A notable pillar of institutional buying in the sector today is represented by the treasury companies. Like the wider institutional behavior, these entities were also net sellers of Bitcoin late last year, as Edwards has highlighted in another X post. The above chart shows the trend in the 30-day rate of change in the Buy-Sell Ratio associated with BTC treasuries, a metric that compares their cumulative USD buying against selling. It would appear that the indicator has just flipped positive in 2026. “Bitcoin treasury companies just flipped to net buying again,” noted the analyst. Related Reading: PEPE Explodes 62%, But Analyst Warns Of Breakdown Retest Strategy, the largest corporate treasury holder of the cryptocurrency in the world, kept accumulating even as the asset observed its bearish shift. But the buying from the firm wasn’t enough, as the rate of change in the Buy-Sell Ratio still plunged into the negative zone In November. BTC Price Bitcoin has shown a move away from stagnation during the last few days as its price has climbed back to the $93,800 level. Featured image from Dall-E, charts from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin accumulation|Bitcoin Institutional Buying|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56917663,
    "published": 1767755932000,
    "title": "Ethereum Price Upside Story Isn’t Finished Yet, Charts Suggest",
    "body": "Ethereum price started a steady upward move above $3,200. ETH is now consolidating gains and might aim for more gains above $3,300. Ethereum started a fresh increase above $3,150 and $3,200. The price is trading above $3,220 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $3,200 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move up if it clears the $3,265 zone. Ethereum Price Holds Gains Ethereum price started a fresh increase after it settled above the $3,120 zone, like Bitcoin . ETH price gained pace for a move above the $3,200 and $3,220 resistance levels. The bulls even pumped the price toward $3,300. A high was formed at $3,299, and the price is now consolidating gains. It declined a few points to test the 50% Fib retracement level of the recent increase from the $3,181 swing low to the $3,299 high. Ethereum price is now trading above $3,220 and the 100-hourly Simple Moving Average. Besides, there is a key bullish trend line forming with support at $3,200 on the hourly chart of ETH/USD. If the bulls are able to protect more losses below $3,200, the price could attempt another increase. Immediate resistance is seen near the $3,265 level. The first key resistance is near the $3,280 level. The next major resistance is near the $3,300 level. A clear move above the $3,300 resistance might send the price toward the $3,350 resistance. An upside break above the $3,350 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,450 resistance zone or even $3,500 in the near term. Downside Correction In ETH? If Ethereum fails to clear the $3,265 resistance, it could start a fresh decline. Initial support on the downside is near the $3,220 level or the 61.8% Fib retracement level of the recent increase from the $3,181 swing low to the $3,299 high. The first major support sits near the $3,200 zone and the trend line. A clear move below the $3,200 support might push the price toward the $3,120 support. Any more losses might send the price toward the $3,050 region. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI – The RSI for ETH/USD is now above the 50 zone. Major Support Level – $3,200 Major Resistance Level – $3,265",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56918350,
    "published": 1767757115000,
    "title": "Bitcoin ETFs come into year 'like a lion’: 600% surge at current pace",
    "body": "US spot bitcoin ETFs attracted over $1.2 billion in the first two trading days of 2026, with analysts projecting annual inflows could reach $150 billion.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56918749,
    "published": 1767758083000,
    "title": "Bitcoin Dips to $92K as Liquidations Top $440M",
    "body": "Bitcoin has slipped from highs near $94,000 as selling pressure returned, exposing the rally’s thin leverage despite improving liquidity.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56918048,
    "published": 1767756421000,
    "title": "CLARITY Act headed for markup next week: Senator Tim Scott",
    "body": "The Digital Asset Market Clarity Act aims to establish a comprehensive framework for crypto market structure in the United States.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56920702,
    "published": 1767762040000,
    "title": "Ether Staking Heats Up As Entry Queue Hits 1.3 Million ETH",
    "body": "According to Beaconcha.in data and market reports, the Ethereum validator exit queue has shrunk to just 32 ETH, with a wait time of about one minute. That is a steep drop from its mid-September peak of 2.67 million ETH — a fall of almost a hundred percent. Markets often react when locked assets are freed up for sale. Right now, that specific source of immediate selling seems to have faded. Related Reading: Crypto Users Lose Far Less To Phishing As Losses Drop 83% – Details Validator Exit Queue Near Empty The exit mechanism limits how fast validators can stop validating and pull out their full stake. With the queue near zero, there is no backlog waiting to cash out. That reduces one form of nervous selling. Validators still earn rewards while queued and can face penalties if they act badly, but the bottleneck that once forced slow exits is gone. Reports show the withdrawal process for partial payouts remains separate, and those smaller payouts continue without affecting the full-exit flow. Entry Queue Hits Fresh Highs Based on reports, the entry queue has climbed to about 1.3 million ETH, its largest level since mid-November. Large operators are sending chunks of ETH into staking. BitMine began staking on Dec. 26 and added 82,560 ETH to the queue on Jan. 3. The firm now lists 659,219 ETH staked, worth roughly $2.1 billion at current prices. BitMine’s wider holdings stand at just over 4.1 million ETH, representing about 3.4% of the total supply and valued near $13 billion. Those moves add real, measurable demand for staked Ether and help explain why fewer validators appear eager to leave. Exchange Balances And Liquidity Exchange reserves for ETH sit at multi-year lows. That matters because when fewer coins are parked on trading platforms, automatic or panic selling becomes harder to pull off. Traders and analysts point to this as a reason selling pressure is easing. Some industry figures have been quoted saying the exit queue is “basically empty,” and that selling pressure is drying up as staking outpaces withdrawals. Still, the market can move by other means — derivatives, lending desks, and off-exchange trades can shift exposure without touching the staking queues. BULLISH: $ETH surpasses Netflix to reclaim its position as the 36th-largest asset by market cap. pic.twitter.com/NetdCcdtSa — CoinGecko (@coingecko) January 6, 2026 Market Cap Milestone And What It Means Meanwhile, in another development, market watchers also noted that Ethereum has moved past Netflix to be the 36th-largest asset by market cap. That headline grabs attention. It says something about investor focus on blockchain assets right now. Related Reading: Bitcoin Wealth Isn’t About Hype—It’s About Time And Stacking, Expert Says But crossing a market-cap threshold is not the same as a direct reason to buy. Valuation rankings change often, and they can be driven by price moves that are themselves shaped by flows, news, or macro shifts rather than a change in the underlying business. Featured image from Pexels, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|altcoins|BitMine|crypto|ETH|Ether|ethereum|validator queue",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56920729,
    "published": 1767762007000,
    "title": "Lloyds leads charge in using blockchain to disrupt UK banking",
    "body": "‘Deposit tokenisation’ could overhaul how customers use their accounts, says chief Charlie Nunn",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 56921044,
    "published": 1767762560000,
    "title": "Ethereum blob limit bumps up to 21, boosting network scalability",
    "body": "Ethereum developers have raised the blob limit for a second time in recent weeks, a move that will allow more transactions to be batched via rollups, making them cheaper.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56920913,
    "published": 1767762512000,
    "title": "Solana (SOL) Holds Support Post-Gains, Testing Bull Conviction",
    "body": "Solana started a fresh increase above the $135 zone. SOL price is now consolidating above $135 and might aim for more gains above the $140 zone. SOL price started a fresh upward move above the $135 and $138 levels against the US Dollar. The price is now trading above $135 and the 100-hourly simple moving average. There is a contracting triangle forming with support at $138 on the hourly chart of the SOL/USD pair (data source from Kraken). The pair could extend gains if it clears the $140 resistance zone. Solana Price Eyes Another Increase Solana price started a decent increase after it settled above the $130 zone, like Bitcoin and Ethereum . SOL climbed above the $135 level to enter a short-term positive zone. The price even smashed the $140 resistance. The bulls were able to push the price above $142. Recently, there were a couple of swing moves and the price dipped below the 50% Fib retracement level of the recent upward move from the $136 swing low to the $141 high. Solana is now trading above $138 and the 100-hourly simple moving average. Besides, there is a contracting triangle forming with support at $138 on the hourly chart of the SOL/USD pair. On the upside, the price is facing resistance near $140. The next major resistance is near the $142 level. The main resistance could be $145. A successful close above the $145 resistance zone could set the pace for another steady increase. The next key resistance is $150. Any more gains might send the price toward the $155 level. Downside Break In SOL? If SOL fails to rise above the $142 resistance, it could start another decline. Initial support on the downside is near the $138 zone, the trend line, and the 76.4% Fib retracement level of the recent upward move from the $136 swing low to the $141 high. The first major support is near the $136 level. A break below the $136 level might send the price toward the $130 support zone. If there is a close below the $130 support, the price could decline toward the $120 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is losing pace in the bullish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $138 and $136. Major Resistance Levels – $140 and $142.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56905018,
    "published": 1767729966000,
    "title": "Brian Quintenz joins SUI Group board after CFTC nomination pulled",
    "body": "The former CFTC commissioner and President Donald Trump’s first pick to chair the agency will join investment company SUI Group's board and support the company’s treasury strategy.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56922496,
    "published": 1767765658000,
    "title": "Solana Shatters Records: 2025 Annual Review Reveals New All-Time Highs In Key Metrics",
    "body": "Solana (SOL), one of the foremost blockchains in the cryptocurrency sector, recently released its annual review for 2025, showcasing major growth across several key metrics, including daily active wallets and decentralized exchange (DEX) volume. Seven Solana Apps Break $100 Million Revenue Barrier According to the report issued on social media platform X (previously Twitter) applications built on Solana generated $2.39 billion in revenue, reflecting a year-over-year increase of 46% and marking a new all-time high (ATH). Seven standout applications in particular, including Pumpfun, each surpassed the $100 million revenue threshold in 2025. Additionally, the variety of smaller applications—those earning under $100 million—collectively produced over $500 million in revenue. Related Reading: XRP Surges Towards $2.20: Leading Monday Gains And Driving Crypto ETF Inflows The network’s performance indicators are equally impressive. Solana achieved a revenue of $1.4 billion, demonstrating a 48-fold increase over the past two years. Non-vote transactions reached a new ATH of 33 billion, with a year-over-year growth of 28%. Furthermore, the network averaged 1,054 non-vote transactions per second (TPS) while unique active wallets averaged 3.2 million daily, marking a 50% increase year-on-year. In terms of wallet growth, Solana saw 725 million new wallets. Bitcoin Trading Volume Skyrockets To $33 Billion In terms of asset management, Solana’s stablecoin supply ended the year at $14.8 billion, more than doubling year-on-year. The blockchain facilitated a colossal $11.7 trillion in stablecoin transfers, marking a sevenfold increase over two years. Notably, equities made their debut on Solana in 2025, achieving a supply of $1 billion and trading volume of $651 million. Bitcoin trading volume grew fivefold compared to the previous year, reaching $33 billion and solidifying a new ATH. The total Bitcoin supply also doubled to $770 million. Staked SOL also saw an increase, with 421 million tokens staked, representing an 8% growth and another ATH. Additionally, the introduction of Solana ETFs attracted net inflows of $1.02 billion. SOL-Stablecoin Volume Soars To $782 Billion In the realm of decentralized exchanges, the total DEX volume reached $1.5 trillion, reflecting a 57% year-over-year growth and another all-time high for the network’s annual review. The trading volume for SOL-stablecoins set a record at $782 billion, more than doubling year-over-year. Twelve DEX platforms managed to process over $10 billion in volume, with Raydium leading the way at $347 billion. Furthermore, the artificial intelligence (AI) agent volume reached a new all-time high of $31 billion, along with tokenized asset volume rising to $598 million and project token volume increasing to $86 billion. Related Reading: Bitcoin Reaches $93,000 Amid Renewed Optimism: What To Keep An Eye On This Week In the sectors of memecoins and launchpads, memecoin volume totaled $482 billion, although this represented a slight decline of 10% year-on-year. Launchpads had a successful year as well, with six platforms generating over $1 billion in volume and launchpad revenue doubling year-on-year to $762 million. Trading platforms contributed significantly to Solana’s ecosystem, earning $940 million, a 44% increase compared to the prior year. Moreover, the trading volume processed by these platforms reached $108 billion, up 66% year-on-year. https://www.tradingview.com/x/dPrTZvZ9/ At the time of writing, SOL is trading at $138.50, having recovered by 10% over the past seven days. However, it is still trading 50% below its all-time high of $293, which was reached during last year’s rally. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Solana|crypto|crypto market|crypto news|Sol|SOL news|SOL Price|Solana blockchain|Solana Ecosystem|Solana metrics|Solana network|Solana news|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56922321,
    "published": 1767765300000,
    "title": "4 reasons XRP has just been called the ‘hottest crypto trade’ of 2026",
    "body": "XRP is having an explosive start to the year, driven by strong ETF inflows, bullish sentiment, and declining exchange reserves.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56922873,
    "published": 1767766337000,
    "title": "Ethereum Raises Data Capacity in Latest Scaling Tweak",
    "body": "The update raises Ethereum’s data capacity, easing pressure on rollups and clarifying how the network plans to scale.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56923299,
    "published": 1767767192000,
    "title": "Trump says he’ll be impeached if Republicans lose midterms",
    "body": "US President Donald Trump says he will be impeached by the Democrats if the Republicans fail to win the midterms, which could galvanize resistance to his crypto policy agenda.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56926051,
    "published": 1767772856000,
    "title": "Ethereum Staking Queue Grows: What Does This Mean For ETH Prices Moving Forward?",
    "body": "As Ethereum (ETH) recently reclaimed key levels above $3,200, the dynamics within its staking system have shifted significantly. For the first time in nearly six months, the entry queue for staking Ethereum now exceeds the exit queue, a development viewed by many as a bullish indicator for ETH prices. Currently, a substantial 1.32 million ETH is waiting to be staked, with an average wait time of 23 days, while only about 3,000 ETH are queued for withdrawal, which takes merely an hour, indicating a net increase in locked ETH rather than unlocked coins. Bullish Signals For Ethereum Analysts at Bull Theory suggest that historically, significant spikes in entry queues occur when investor confidence in Ethereum’s long-term potential rises. In contrast, increases in exit queues are often associated with market fear or forced sell-offs. Presently, the landscape shows rising entry demand, decreasing exit pressure, and an overall increase in net lock-up, a combination that has frequently been observed before stronger bullish cycles for ETH. Related Reading: XRP Surges Towards $2.20: Leading Monday Gains And Driving Crypto ETF Inflows Compounding this positive sentiment is the current high level of network activity. Daily transactions on the Ethereum network are trending upwards, indicating that market participants are actively engaging with the platform rather than leaving it. Enhanced network usage leads to increased ETH burning, contributing to a supply crunch that further supports the asset’s value. According to the analysts, institutional investment is one of the notable drivers behind the current surge in staking. In just the past two weeks, BitMine – the public company with the largest Ethereum holdings – has staked around $2.58 billion worth of ETH, signaling a long-term commitment to the asset and suggesting growing institutional interest in the digital asset. Key Factors Suggest A Significant Upswing Ahead This development comes ahead of potential catalysts that could further boost staking demand. While the BlackRock Ethereum staking ETF is still awaiting approval, its eventual green light could grant access to a broader pool of traditional capital, thereby enhancing the overall staking demand for ETH. Additionally, ETH has successfully broken out of a three-month downward trend. If it can reclaim levels between $3,500 and $3,600, the analysts predict that a substantial rally could follow. Related Reading: Bitcoin Reaches $93,000 Amid Renewed Optimism: What To Keep An Eye On This Week As of now, ETH has recovered by 11% in the past two weeks according to CoinGecko data, positioning the token just below these key levels at $3,270. This performance has even surpassed that of Bitcoin (BTC), which has recorded gains of just 6% in the same time frame. Taking into account additional factors such as the anticipated approval of the BlackRock ETF and the potential for regulatory clarity through the passing of the Market Structure Bill, also known as the Clarity Act, Ethereum appears to be in a strong position to experience a significant rally in 2026. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|crypto market|crypto news|cryptocurrency|ETH|ethereum|ethereum news|ethereum price|Ethereum staking|ETHUSDT|Latest Ethereum News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56923141,
    "published": 1767766672000,
    "title": "Wealth transfer may boost crypto adoption among younger investors: Galaxy exec",
    "body": "An industry executive argues that generational wealth transfer could influence crypto adoption patterns over time.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56926683,
    "published": 1767773970000,
    "title": "Crypto traders can now take leveraged bets on silver via Binance Futures",
    "body": "Binance Futures will launch silver perpetual contracts on Wednesday, offering up to 50x leverage on silver priced in U.S. dollars per troy ounce.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Silver|Binance|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]