[
  {
    "id": 55700109,
    "published": 1765564230000,
    "title": "Can Dogecoin Really Fall To $0.05 In 2026? This Analyst Thinks So",
    "body": "Dogecoin traders have heard the “five-cent” call before. It’s the kind of number that sounds like bait until price action starts behaving like it might actually get there. On Friday, DOGE was changing hands around $0.140, up slightly on the day, while bitcoin hovered near $92,300. That’s the backdrop for a fresh warning from YouTube analyst VisionPulsed, who told viewers his “base case” is that Dogecoin revisits the $0.05–$0.06 zone over the next 12 months — a window that drags the target straight into 2026. Will Dogecoin Crash To $0.05 In 2026? In the video posted on December 11 and titled “WHY IS DOGECOIN CRASHING!? BITCOIN RALLY COMING OR BULL TRAP FOR 5 CENT DOGE in 2026!?, the gist of his argument is pretty simple: if bitcoin is in a bear regime, DOGE doesn’t need an extra reason to bleed. “The base case here is that Bitcoin has entered a bear market,” he said, pointing to a cluster of indicators he watches, including an 8-day moving average near $102,000 and the Gaussian Channel. As long as BTC sits below those levels — he cited roughly $103,000 as a line in the sand — he thinks the path of least resistance for Dogecoin trends down toward five cents. Related Reading: Dogecoin Could Stage A 600% Rally In 2026 If This Multi-Year Support Holds And he wasn’t exactly selling it as a clean, one-way trip. There’s a lot of “chop zone” talk in the video — his term for the period where traders get whipsawed trying to long bounces and short dips. “The peanut gallery,” he called it. His chart-based rationale leans on a familiar pattern from 2022: even when bitcoin managed a relief rally, DOGE still printed lower lows at points. “There is no guarantee that Dogecoin will have a relief rally. As you can see, in 2022, Dogecoin did indeed have a relief rally for the final pump with Bitcoin, but you can also see that Bitcoin made higher lows throughout the spring as Dogecoin made lower lows,” he said. In his view, one of those “unfinished” spots sits closer to $0.10 first — and then the uglier number comes back into play depending on how bitcoin behaves. That sequencing matters because it’s exactly where traders get themselves into trouble. If bitcoin bounces, DOGE might bounce too. Or it might not. VisionPulsed kept hammering that there are “many indicators” suggesting a BTC relief rally is possible, but “no guarantees” Dogecoin participates — a point he tried to underline by comparing the current tape to MicroStrategy’s tendency to go flat for weeks before a sharp move. Related Reading: Dogecoin Price Volatility Returns as Market Weighs Bullish Indicators Against Recent Dip Then there’s his timing framework, which is more narrative than math but still widely used in crypto circles: the idea that around 140–150 days from a major top, markets often produce a final meaningful rally — and then price doesn’t revisit those levels for a long time. He cited examples across prior cycles (2014, 2018, 2019, 2022) to argue that once bitcoin falls into that “channel” regime, it tends to stay there until the broader downtrend has done its work. So what does $0.05 actually mean from here? From roughly $0.14, it’s a drawdown of about 64%. That’s violent, but not exactly exotic in DOGE history — which is why the call lands with some traders even if they hate hearing it. The big escape hatch, per VisionPulsed, is a bitcoin breakout: if BTC makes a new all-time high by February, he argues the bearish “base case” gets invalidated and DOGE can do what DOGE does when the market turns risk-on. Until then, he framed $0.05–$0.06 as the boring, brutal probability-weighted outcome. “So the base case for the next 12 months is essentially at some point Doge will most likely come down to these five to six cent range unless Bitcoin goes up and makes a new alltime high before February. If Bitcoin makes a new all-time high by February, then Doge will avoid that [$0.05 target] and start pumping to the moon like everybody wants,” he concluded. At press time, DOGE traded at $0.14. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55700104,
    "published": 1765564211000,
    "title": "Interactive Brokers Now Accepts Stablecoins in a Bid to Remain Competitive",
    "body": "The firm has begun offering stablecoin account funding for U.S. retail clients, joining a growing list of brokerages racing to keep pace with crypto-native rivals.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Interactive Brokers|Robinhood Markets Inc.|Charles Schwab|Stablecoin|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55699595,
    "published": 1765563227000,
    "title": "Solo Bitcoin Miner Beats the Odds, Winning $282K Reward",
    "body": "A solo Bitcoin miner defied the odds and won a block reward worth around $282,000 with the help of mining service, Solo CKPool.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55699340,
    "published": 1765562338000,
    "title": "Bitcoin Drifts Lower With Any Push Higher Being Met by Fresh Sellers",
    "body": "Bitcoin continues to drift toward the lower bound of its recent trading range with any increase in the price seen being met by selling from investors who purchased the largest cryptocurrency near the all-time high reached in early October.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55698430,
    "published": 1765561183000,
    "title": "Sorry Gooners: OpenAI's Erotic ChatGPT Delayed Into 2026",
    "body": "Sam Altman breaks his December promise as OpenAI delays ChatGPT's adult content feature into at least Q1 next year.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55698051,
    "published": 1765560652000,
    "title": "Fed Cut Lights The Fuse: Bitcoin Rebounds And Bulls Predict More Upside",
    "body": "Crypto markets saw a modest lift after the US Federal Reserve made another move on rates, and traders are watching for a clearer follow-through. According to reports, the Fed has carried out three consecutive interest rate cuts totaling 0.75% from September to December. The move was widely expected. Still, market responses have been mixed and somewhat choppy. Related Reading: American Bitcoin Makes Big Buy, Adds 416 BTC To Its Stack Fed Moves And Market Takeaway According to CoinEx chief analyst Jeff Ko, much of the Fed’s action was already priced in, and the updated dot plot leaned a bit more hawkish than some had hoped. Ko pointed to $40 billion in short-term Treasury purchases as a technical step to ease liquidity and lower short-term rates, not as a broad stimulus program. Markets took the measures as mildly positive. US stocks rose, and that helped Bitcoin find some footing after an early dip. Santiment And The Short-Term Reaction Based on reports from onchain analytics firm Santiment, each cut has prompted a classic “buy the rumor, sell the news” move where initial optimism is followed by short selling. 🇺🇸 The US Fed made three strategic cuts over the past 3 months, resulting in a total of an 0.75% reduction to interest rates. 1⃣ September 17, 2025: Fed lowered the target range to 4.00 %–4.25 % (from 4.25 %+) at the 16–17 Sep meeting. 2⃣ October 29, 2025: Fed cut the rate to… pic.twitter.com/X6DWypvq5t — Santiment (@santimentfeed) December 11, 2025 Cuts are seen as bullish for crypto over the long haul, yet they have triggered brief pullbacks in practice. Santiment adds that a small wave of FUD or retail selling often signals that the mild post-cut downswing is finished and a bounce may follow once things calm down. Technical Levels Traders Are Watching Bitcoin was volatile in the aftermath. It fell under $90,000 then popped to $93,500 on Coinbase before settling near $92,300 at the time of reporting. Key resistance sits between $97,000 and $108,000. On the daily chart, BTC remains inside a small rising channel that sits within a larger downtrend, and technical traders note that a MACD histogram is approaching a positive crossover — a sign some see as possible renewed momentum. ETF activity has been tepid, with only $219 million in net inflows since late November, which keeps some investors cautious. Related Reading: Is Dogecoin Waking Up? Critical On-Chain Metric Explodes Higher Dollar Weakness And Equity Signals A weaker dollar has been part of the backdrop; the DXY index fell to 98.36 and is showing bearish momentum on its own MACD. Nasdaq’s move back above its 50-, 100- and 200-day simple moving averages helped lift risk assets briefly, and that has supported Bitcoin’s rebound attempts. Yet correlation with equities remains uneven — losses in stocks tend to hit Bitcoin harder than gains help it, creating an asymmetric risk profile for traders. Featured image from Impossible Images, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|etf|fed|federal reserve|rate cuts",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55697759,
    "published": 1765559766000,
    "title": "DOT Sinks 2% After Breaking Key Support",
    "body": "The Polkadot token erased earlier gains amid elevated volume, falling from a high of $2.09 to $1.97.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Polkadot|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 21,
        "NAME": "DOT",
        "CATEGORY": "DOT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55697104,
    "published": 1765558648000,
    "title": "Figure Technology files ‘second IPO’ to bring native equity issuance to Solana",
    "body": "Figure is planning a second IPO to issue blockchain-native equity on Solana, enabling onchain trading and DeFi use cases beyond traditional stock markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55697831,
    "published": 1765558308000,
    "title": "Vanguard Equity Quant Says Bitcoin Still a ‘Digital Labubu’ Toy, For Now",
    "body": "Vanguard Group may now allow clients to trade spot Bitcoin exchange-traded funds, but one of the firm’s senior investment leaders says its underlying view of crypto remains unchanged.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55696495,
    "published": 1765557793000,
    "title": "Circle, Ripple, Paxos, Fidelity and BitGo Get Banking Charters Approved by OCC",
    "body": "Circle, Ripple among five stablecoin issuers conditionally approved for national banking charters as market hits $313 billion.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55696322,
    "published": 1765557559000,
    "title": "Five Crypto Firms Win Initial Approvals as Trust Banks, Including Ripple, Circle, BitGo",
    "body": "The firms have obtained conditional approval from the Office of the Comptroller of the Currency to convert into national trust banks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Banking|Ripple|Circle|Paxos|Fidelity|BitGo|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55695962,
    "published": 1765557043000,
    "title": "Silk Road Bitcoins Are On The Move Again, Is The BTC Price Ready For Another Dump?",
    "body": "After nearly five years of dormancy, a cluster of Silk Road–linked wallets just moved 33.7 Bitcoin—roughly $3 million—in a sudden on-chain resurgence that immediately brought the BTC price back into focus. While the volume is modest, the combination of its origin, timing, and institutional destination gives it an outsized narrative impact. With Bitcoin already navigating a fragile price range, this development raises concerns about renewed downward pressure. The 33.7 BTC Silk Road BTC Transfer And Its Potential Impact On Bitcoin’s Price The movement began with a series of small outputs originating from early-era Silk Road addresses, all using the old “1…” legacy format. These wallets had last shown activity on February 2, 2021, before abruptly pushing out 176 tiny transactions that were subsequently consolidated into the bech32 address bc1qnysx9sr0s7uw39awr3hh099d5m0lvrnxz7ga54. Roughly a day later, that entire 33.7 BTC was moved again through an intermediary hop and then flagged by chain-analysis dashboards as a Coinbase Prime deposit. Related Reading: Dogecoin Price Set To Surge As Sellers Show Signs Of Exhaustion The first alert about the movement came from the X account DarkWebInformer, which spotted the burst of micro-transactions. Even after this transfer, about 416 BTC—roughly $37.5 million—remains untouched in the wider group of connected addresses. This supports the idea that the 33.7 BTC shift was simply a dust-sweep or cleanup action, not a full-scale release of seized holdings. With the operational picture clear, the focus shifts to the price impact. In terms of liquidity, 33.7 BTC is far too small to trigger a market-wide dump. What matters more is the psychological effect. Bitcoin is already trading in a corrective range, and activity linked to Silk Road history can make traders cautious. Although the Coinbase Prime routing points to OTC or custodial handling rather than a spot-market sale, the optics alone can tighten risk models and stoke volatility in the BTC price. Dormant Wallets And Market Sensitivity Dormant Silk Road wallets have a history of resurfacing. In May 2025, two such wallets moved over 3,400 BTC—worth roughly $322 million—after nearly a decade of inactivity. The funds were transferred into new addresses rather than exchanges, showing that these movements do not automatically trigger selling and are more notable for their on-chain and narrative significance than for their impact on liquidity. Related Reading: Pundit Highlights The Condition That Will Trigger A 2,300% XRP Rally To $50 While these transfers have little direct effect on liquidity, Bitcoin’s current price action makes the market more sensitive to any headline. After approaching $94,000 earlier this month, BTC slipped back to $90,000–$92,000. On X, bearish analysts have highlighted a continuation pattern, with some projecting potential downside toward $88,000 – $89,000. This environment primes traders to react strongly to even minor negative catalysts, including long-dormant wallet activity. Overall, the recent Silk Road transfer is unlikely to trigger a standalone dump. The main pressure stems from Bitcoin’s fragile technical posture, making even small but symbolically significant moves capable of increasing short-term volatility. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55695987,
    "published": 1765556804000,
    "title": "Paxos, Fidelity, Ripple, BitGo, and Circle secure US trust bank approvals",
    "body": "The conditional approvals clear a path for major crypto companies to operate as national trust banks under the supervision of the US OCC.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55698930,
    "published": 1765556722000,
    "title": "Five Crypto Firms Get Coveted US Bank-Charter Nod",
    "body": "Five cryptocurrency firms received preliminary approval to perform certain banking functions from a US regulator on Friday, marking the latest step in the White House‘s embrace of what was once viewed as a risky, fringe industry.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55694991,
    "published": 1765555467000,
    "title": "Bitcoin Plunges Below $90K as AI Worries Drag Nasdaq, Crypto Stocks Down",
    "body": "Chipmaker Broadcom's 10% slide weighs on the market as Chicago Fed's Goolsbee signals more cuts than the median for 2026.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Market Wrap|Bitcoin News|Nasdaq|Bitcoin Mining|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55694918,
    "published": 1765555330000,
    "title": "Pakistan, Binance Sign MOU to Explore Tokenization of $2B in State Assets: Reuters",
    "body": "The agreement comes as Pakistan accelerates the rollout of a formal crypto regulatory framework and explores blockchain-based distribution of government-owned assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Pakistan|Binance|Tokenization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55694500,
    "published": 1765554505000,
    "title": "Lawmakers Say Bank of England Stablecoin Proposals Will ‘Limit Adoption, Push Activity Overseas’",
    "body": "A CryptoUK spokesperson told Decrypt the proposed restrictions “risk undermining the UK’s ambition to lead in digital finance.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 55693892,
    "published": 1765553633000,
    "title": "Jennifer Garner to Star in Netflix Crypto Comedy 'One Attempt Remaining'",
    "body": "The film focuses on a divorced couple racing to recover access to their now-valuable crypto before time runs out.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55693504,
    "published": 1765553037000,
    "title": "Bitcoin Giant Strategy's Cash Reserve Was a 'Smart' Move, Says BitMine's Tom Lee",
    "body": "BitMine Immersion Technologies Chairman Tom Lee praised Bitcoin treasury firm Strategy's massive new cash reserve. Here's why.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55692924,
    "published": 1765552239000,
    "title": "Prediction Markets Are Coming to Phantom's 20M User Via Kalshi",
    "body": "Phantom users will be able to chat and trade Kalshi's prediction markets with any Solana-based tokens, CEO said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Kalshi|Prediction Markets|Solana News|Phantom|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55692595,
    "published": 1765551600000,
    "title": "Backed, Chainlink Unveil xBridge to Move Tokenized Stocks Between Solana and Ethereum",
    "body": "The bridge uses Chainlink's CCIP to ensure consistent behavior across chains, mirroring the behavior of underlying assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Web3|Chainlink|Tokenized Equity|Tokenization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55692093,
    "published": 1765550656000,
    "title": "UAE’s Largest Fuel Retailer Will Accept Stablecoin in 980 Stations in Three Countries",
    "body": "A new deal with Al Maryah Community Bank brings stablecoin payments to the pumps, shops and car washes at ADNOC retailers in UAE, Saudi Arabia and Ethiopia.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Web3|Dubai|UAE|Stablecoins|crypto payments|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 55691471,
    "published": 1765549897000,
    "title": "Ripple expands European footprint with AMINA stablecoin payment partnership",
    "body": "Ripple Payments partnered with Swiss crypto bank Amina to plug its fiat-to-stablecoin payment infrastructure into the FINMA-regulated institution.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55691118,
    "published": 1765549435000,
    "title": "Polish Government Urges President to Sign Crypto Bill He Already Rejected: Report",
    "body": "The Polish government reintroduced crypto legislation without changing a single period, after telling the president he needs to sign it to avoid Russian-linked security threats.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Poland|Prime minister|crypto legislation|Legislation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55690875,
    "published": 1765549079000,
    "title": "CoinDesk 20 Performance Update: SUI Gains 5.2%, Leading the Index Higher",
    "body": "Aave (AAVE) was also among the top performers, rising 4.5% from Thursday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|CoinDesk Indices|CoinDesk 20|charts|Prices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 2,
        "NAME": "AAVE",
        "CATEGORY": "AAVE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55690635,
    "published": 1765548740000,
    "title": "MiCA Will Make or Break Euro-Pegged Stablecoins by 2026: DECTA",
    "body": "German payments processor DECTA expects euro-pegged stablecoins to gain traction in payments and tokenized finance as MiCA takes full effect across the EU.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Stablecoins|Europe|MiCA|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55690950,
    "published": 1765548543000,
    "title": "Interactive Brokers Allowing Accounts to be Funded by Stablecoin",
    "body": "Interactive Brokers Group Inc. is now allowing retail investors to fund individual brokerage accounts with stablecoins as the once-bright lines between traditional and digital finance blur.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "NMS:IBKR",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 55690361,
    "published": 1765548174000,
    "title": "Crypto speculation at 2024 lows as TradFi leveraged ETFs hit record $239B",
    "body": "Crypto investor demand for memecoins remains at lows not seen since 2024, despite a growing speculative appetite that has boosted TradFi leveraged ETFs to a record $239 billion.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 55689976,
    "published": 1765547501000,
    "title": "Morning Minute: Do Kwon Gets 15 Years for $40B Terra Luna Fraud",
    "body": "The sentencing brings a measure of justice, finally, for all of those impacted by the collapse of Terra and its UST stablecoin in 2022.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|terra-luna-2|luna-wormhole|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 34,
        "NAME": "LUNA",
        "CATEGORY": "LUNA"
      }
    ]
  },
  {
    "id": 55689598,
    "published": 1765546878000,
    "title": "Pakistan clears Binance and HTX to seek local crypto licenses",
    "body": "Pakistan gives a nod for crypto exchanges Binance and HTX to register local subsidiaries as regulators advance a phased crypto framework.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55689597,
    "published": 1765546840000,
    "title": "Ether price rallied 260% last time this happened: Can ETH reach $5K?",
    "body": "A buying opportunity from Ether’s realized price projected a major rally, as analysts said a return to $5,000 in 2026 is plausible.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55689441,
    "published": 1765546487000,
    "title": "Scaramucci predicts ‘exponential opportunity’ for crypto at LONGITUDE",
    "body": "The cryptocurrency industry is riding on the tailwinds of regulatory clarity and newfound interest from institutional investors into the new year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55688434,
    "published": 1765545122000,
    "title": "Florida Seizes $1.5M in Dogecoin, Pepe and Solana Over Case Tied to Chinese National",
    "body": "Prosecutors used a fugitive disentitlement statute to seize Dogecoin, Solana, and other tokens tied to a Citrus County fraud case.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|dogecoin|pepe||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55688297,
    "published": 1765544955000,
    "title": "Saylor Issues Stark Warning Amid Sudden Scramble To Update Bitcoin Price Predictions",
    "body": "Michael Saylor has warned of “chaos, confusion,\" and \"profoundly harmful consequences\" if his bitcoin-buying company Strategy is ejected from MSCI indices...",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55688314,
    "published": 1765544793000,
    "title": "UK MPs warn Bank of England stablecoin plans could drive innovation offshore",
    "body": "Cross‑party MPs and members of the House of Lords have urged UK Chancellor Rachel Reeves to rein in the Bank of England’s proposed regime for systemic stablecoins.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 55686598,
    "published": 1765541824000,
    "title": "U.S. SEC Gives Implicit Nod for Tokenized Stocks",
    "body": "Clearing and settlement company the Depository Trust & Clearing Corp. said a subsidiary had received a no-action letter to offer tokenized real-world assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|SEC|Tokenization|Real World Assets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 55685893,
    "published": 1765541133000,
    "title": "YouTube Now Allows U.S. Content Creators to Get Paid in PayPal’s Stablecoin: Fortune",
    "body": "YouTube has added PayPal’s dollar-pegged stablecoin as a payout option for U.S. content creators, marking one of PYUSD’s most high-profile use cases yet.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Web3|YouTube|Paypal usd|PayPal|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 191,
        "NAME": "PYUSD",
        "CATEGORY": "PYUSD"
      }
    ]
  },
  {
    "id": 55685662,
    "published": 1765540849000,
    "title": "Why This Market Analyst Is Warning Crypto Investors To Stop Buying XRP",
    "body": "The XRP price could be on the verge of a massive crash, as a crypto analyst has identified a key technical pattern in the cryptocurrency’s structure that signals a potentially severe downturn. According to the analyst, this formation has appeared only twice in XRP’s history, and each time has preceded a devastating loss. If the pattern were to repeat, the cryptocurrency could be headed for more pain. The analyst warns traders and investors to stop buying XRP at this time, citing heightened risk. Analyst Advices Against Buying XRP As Price Crash Looms An urgent warning from market analyst Steph is Crypto has spread across the community, as he advises traders and investors to “not touch XRP anymore.” The analyst shared a video of his XRP price forecast on a recent X post, revealing that the altcoin’s long-term indicators point to a troubling setup that could mirror downturns observed during past market cycles. Related Reading: Why Now Is The Perfect Opportunity To Short Bitcoin Down To $40,000 Steph Is Crypto shared that his study of the monthly Moving Average Convergence Divergence (MACD) for XRP has revealed a new bearish crossover taking shape, signaling declining momentum. The analyst stated that XRP had formed a bearish crossover on the chart only twice since its inception in 2012. Both times this pattern appeared, the cryptocurrency underwent one of the most dramatic price crashes ever, losing over half its value right after. He explained that during the first bearish crossover in 2019, XRP crashed by more than 84%. Similarly, a second crossover reemerged in 2022, triggering a deep price decline of about 67%. It’s worth highlighting that each time XRP formed this bearish signal, it was after a major bull market. In 2018, the cryptocurrency staged a historic rally that sent its price to its current all-time high above $3.84. Likewise, the steep correction in 2022 came on the heels of an explosive 2021 bull market, one of the most powerful in crypto’s history. Just as in the past, Steph Is Crypto sees a bearish crossover forming once again in the current cycle, suggesting that the conditions are aligning for another devastating price crash. He admitted that he wishes he had not spotted this formation on XRP’s chart, underscoring his usually bullish stance on the cryptocurrency. The analyst has cautioned traders to take this historical setup seriously and to consider the possibility that XRP could revisit significantly lower price ranges if the pattern plays out. XRP Price Momentum Remains Weak XRP remains in a downward trend, with its price barely holding above $2.00. The cryptocurrency has dropped by over 15% so far this month, declined about 2.2% over the past week, and has crashed approximately 16% year to date, according to CoinMarketCap. Related Reading: Here’s Why Strategy’s $1 Billion Bitcoin Purchase Did Not Trigger A Price Rally XRP’s price momentum is weak, with little indication of a near-term recovery. The cryptocurrency’s Fear and Greed Index has slipped to 42, edging closer to the “fear” zone. This market uncertainty is being driven by the cryptocurrency’s sluggish price action, despite having passed $3.00 earlier this year and nearly challenging its all-time high. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55694465,
    "published": 1765540392000,
    "title": "Ripple Payments Lands First European Bank Client in AMINA",
    "body": "AMINA is said to be able to process cross-border flows involving fiat currencies and stablecoins, including Ripple’s own RLUSD.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Ripple|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55684510,
    "published": 1765539000000,
    "title": "Crypto Markets Today: Bitcoin Stuck in Post-Fed Range as Altcoins Slump Deepens",
    "body": "Bitcoin remains trapped in a range despite the U.S. rate cut, while altcoins and memecoins struggle to attract risk appetite amid shifting investor behavior.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Derivatives|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55684036,
    "published": 1765538008000,
    "title": "US financial markets ‘poised to move on-chain’ amid DTCC tokenization greenlight",
    "body": "In comments Thursday, SEC Chair Paul Atkins doubled down on his vision for tokenized US financial markets and onchain settlement.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 55683725,
    "published": 1765537576000,
    "title": "Binance hints at stock perps in push to join global tokenized equities race",
    "body": "Binance quietly rolled out API endpoints pointing to stock perpetual futures, potentially signaling a renewed push into stock trading after a failed 2021 launch.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55684193,
    "published": 1765537567000,
    "title": "Tether Blocks Investor Sales While Pitching $20 Billion Funding",
    "body": "Tether Holdings SA, the stablecoin issuer seeking to raise up to $20 billion in a stock sale, is exploring ways to ensure liquidity for investors after intervening to stop some existing shareholders from offloading stakes.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55683455,
    "published": 1765537186000,
    "title": "Hollywood Director Guilty of Scamming Netflix out of $11M, Spending It on Crypto",
    "body": "“47 Ronin” director Carl Rinsch faces a maximum prison sentence of up to 90 years, having been found guilty on seven separate charges.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "dogecoin|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      }
    ]
  },
  {
    "id": 55682572,
    "published": 1765535542000,
    "title": "Bitcoin first, crypto at scale: Inside the UAE’s layered digital asset strategy",
    "body": "Abu Dhabi is anchoring Bitcoin for institutions, while Dubai builds payments, stablecoins and Web3 use cases into daily commerce.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55682362,
    "published": 1765535417000,
    "title": "What’s Happening With The Bitcoin, Ethereum, And Dogecoin Prices Recently?",
    "body": "Crypto pundit NoLimit has explained why the Bitcoin, Ethereum, and Dogecoin prices have been dumping recently. He specifically raised claims of manipulation, with these crypto prices recording gains and then fully retracing those gains. In an X post, No Limit stated that the Bitcoin price is dumping because Binance is buying and that Coinbase is dumping a large amount of BTC. The Bitcoin decline has also sparked declines for the Ethereum and Dogecoin prices, which are known to mirror the flagship crypto. Meanwhile, the crypto pundit raised claims of BTC being manipulated. Pundit Explains What Is Happening With The Bitcoin, Ethereum, And Dogecoin Prices NoLimit pointed out something weird that happened on the order books, noting a massive spike in Binance’s CVD, which didn’t come from retail suddenly buying millions of dollars in BTC. On the other hand, he stated that Coinbase’s CVD fell at the exact same time, indicating that the crypto exchange dumped some BTC, which sparked declines in Bitcoin, Ethereum, and Dogecoin prices. Related Reading: Bitcoin Price Can Hit These ‘Realistic’ Bullish Targets Before The Bear Market Begins The crypto pundit highlighted the sharp decline in Bitcoin’s price as liquidity was yanked, creating a thin order book. He further remarked that one venue is getting aggressively bid up while the other is getting drained. NoLimit explained that this is not a normal spot flow and that it is likely coordinated positioning, hedging, arbitrage, or pure manipulation. NoLimited pointed out that the Bitcoin price reacted instantly to this alleged manipulation, dropping, then pushing to $94,000, and then dropping again. This also dragged down the Ethereum and Dogecoin prices. The crypto pundit asserted that a group of people is playing with the market and that most people won’t notice until it is too late. He stated that when crypto exchanges completely disagree on net flow like this, it is usually a warning. NoLimit added that the next big move is being set up before the public catches on. The crypto pundit urged market participants to pay attention because things are about to get interesting. Another Pundit Raises Manipulation Claims Crypto pundit Vivek also indicated that the Bitcoin, Ethereum, and Dogecoin prices may be manipulated at the moment. He noted that BTC round-tripped from $94,000 to $88,000 three times in the last few days, liquidating both longs and shorts worth over $200 million. The pundit added that this is an example of clear market manipulation to wipe out both leveraged longs and shorts. Related Reading: When Will Bitcoin, Ethereum, And Dogecoin Go Into A Bear Market? Crypto pundit Bull Theory also recently accused Wall Street trading firm Jane Street of manipulating the Bitcoin price. This came as the pundit noted that BTC, alongside Ethereum and Dogecoin, usually declines at the market open before recovering later. Bull Theory suggested that the firm may be manipulating the market in order to buy at lower prices. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Binance|Binance’s CVD|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|coinbase|Coinbase’s CVD|Dogecoin|ethereum|Jane Street|No Limit|Vivek|wall street",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55681265,
    "published": 1765533605000,
    "title": "Upbit hack puts Binance’s emergency freeze policy under scrutiny",
    "body": "Binance reportedly froze only about 17% of the funds it received that were linked to the Upbit hack, raising questions over how major exchanges act on cross-border law enforcement.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 55679835,
    "published": 1765530983000,
    "title": "Standard Chartered, AirAsia parent to test ringgit stablecoin in Malaysia",
    "body": "Standard Chartered Malaysia and AirAsia parent Capital A plan to issue and test a ringgit-pegged stablecoin for wholesale applications.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55680801,
    "published": 1765530032000,
    "title": "Do Kwon Falls Hard — Terraform Labs Chief Gets 15 Years For Wire Fraud",
    "body": "Do Kwon, the South Korean co-founder of Terraform Labs, was sentenced to 15 years in prison on December 11, 2025 in a Manhattan federal court after pleading guilty to fraud tied to the collapse of the TerraUSD stablecoin and its sister token, Luna. Related Reading: Is Dogecoin Waking Up? Critical On-Chain Metric Explodes Higher According to court documents and news reports, the judge described the scheme as a massive fraud that left thousands of investors facing heavy losses. Sentence And Court Ruling Judge Paul A. Engelmayer handed down the 15-year term after prosecutors urged for a sentence of up to 12 years and the defense asked for a much lighter term. Do Kwon pleaded guilty in August 2025 to conspiracy to defraud and wire fraud, and as part of the plea he agreed to forfeit roughly $19 million. The US Attorney’s office says the guilty plea admits he misled investors about how the stablecoin kept its $1 peg. Scale Of The Losses Reports have placed the market fallout from the Terra collapse at about $40 billion in erased value. Many ordinary investors lost life savings and some victims gave emotional testimony at sentencing, describing real financial ruin. News outlets and court filings tie the crash in May 2022 to a sudden loss of confidence that cascaded through markets and hurt other crypto firms. Civil Penalties And Settlements Before the criminal case reached this point, Kwon and Terraform faced a major civil action from the US Securities and Exchange Commission. According to the SEC, Terraform Labs and Kwon agreed to pay more than $4.5 billion in disgorgement, interest and penalties, while Kwon personally faced an $80 million civil fine and a ban from crypto trading. That civil judgment was filed in 2024 and has been used by regulators as part of the overall effort to make investors whole. International Arrest And Extradition Kwon was arrested in Montenegro in March 2023 after leaving Singapore; authorities say he was using forged travel documents when detained. He fought extradition in Montenegrin courts but was eventually transferred to the US late in 2024 to face federal charges. Reports outline a long legal fight across borders that ended with his return to New York to answer criminal counts. Related Reading: American Bitcoin Makes Big Buy, Adds 416 BTC To Its Stack What The Sentence Means Legal analysts say a 15-year term signals the court’s view that the fraud caused wide damage and that punishment should deter similar schemes. Victims’ statements at sentencing appear to have weighed heavily. Kwon still faces separate probes and possible charges in other countries, and the civil judgment means substantial sums are earmarked for recovery efforts tied to Terraform’s bankruptcy. Featured image from Getty Images, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|Do Kwon|stablecoin|Terraform Labs|TerraUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 34,
        "NAME": "LUNA",
        "CATEGORY": "LUNA"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55677383,
    "published": 1765526707000,
    "title": "Solana Will ‘Flip’ Ethereum, Predicts Skybridge Capital’s Scaramucci",
    "body": "Anthony Scaramucci showed up to Solana Breakpoint in Abu Dhabi wearing a tie — a small act of rebellion in a sea of hoodies — and then proceeded to make a much bigger one on stage: Solana is going to “flip” Ethereum. Scaramucci’s Solana Prediction Not in the Twitter-war, zero-sum, “ETH is dead” kind of way. More like: same league, different growth curve, and Solana ends up with the bigger market cap. “I think it will flip Ethereum, but that doesn’t mean Ethereum’s going down or anything like that. I think there’s going to be market share for Ethereum. I think they could both grow, but I think from a market capitalization perspective, I think Solana will end up growing faster,” Scaramucci told CoinDesk Live on Dec. 11. That’s been his line for a while. This time it came with a prop: his new book, Solana Rising, which dropped Dec. 9 and — according to Scaramucci — quickly hit the top of Amazon’s “new releases” list for investment management/investment strategy. He framed the book as something for the skeptics, or at least for the friends of the believers. Related Reading: Solana Enters Bear Territory: Realized Loss Now Outweighs Profit The pitch is familiar if you’ve been anywhere near crypto conferences this year, but Scaramucci’s version is unusually blunt: Solana is the fastest-growing chain, it’s stacked with activity, it’s cheap to use, and it’s easy to build on. Then you add staking, and you’ve got what he keeps calling “great tokenomics.” And yes, he’s heavily aligned. “Full disclosure,” he said, “I have a large personal holding in Solana. I have it on the firm’s balance sheet.” How large? On SkyBridge’s balance sheet, he put it at “probably 60%,” with the firm sitting on “north of a nine figure balance sheet.” His personal portfolio allocation, he estimated, is around “6% 7%.” Big, but not “I sold the house for SOL” big. Notably, Scaramucci emphasized that he’s not “chain monogamous.” He likes Avalanche. He likes Ethereum. He’s not doing maximalism. He’s doing a portfolio. “In fact, who is chain monogamous?” he joked. Related Reading: Solana Hits Critical Demand Zone — Is A Surprise Bottom Loading? The Skybridge Capital founder added: “It’s not an amorous thing. It just has to do with the realities of investing. It’s like owning a lot of stocks in your portfolio. But to me, I just think that it is the fastest growing chain. That’s the most activity of like the top 50 chains combined. It’s got lots of use cases, lots of versatility. It’s easy to develop on and it’s very low fees to transact on and it’s got great tokenomics if you want to stake your Solana like I do.” He also pointed to the debut of the first spot Solana ETF in the United States — “first staking ETF,” in his words — as another signal that we’re still early. Then came the price talk, because of course it did. Could SOL hit $300–$400 by the end of next year? “Sure,” he said, tying it to a more constructive US regulatory backdrop — specifically his hope that the CLARITY Act gets passed and unlocks “the full utilization of tokenization.” Longer term, he went bigger: “Is Solana go to $1,000 over the next five years? I really do believe that.” He also revisited Bitcoin. Same vibe: right call, wrong calendar. “I’ve been right about Bitcoin, but I’ve been wrong about timing,” Scaramucci said, sticking with a $150,000–$200,000 target, and arguing a friendlier rate environment next year could help. At press time, SOL traded at $139.14. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Anthony Scaramucci|ETH|ethereum|Sol|SOL news|SOL Price|Solana|Solana news|Solana Price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55704004,
    "published": 1765570843000,
    "title": "Tools for Humanity expands World app toward super-app model",
    "body": "The release introduces World Chat with end-to-end encryption, DeFi-powered yield via Morpho and QR-code payments at more than one million merchants in Argentina.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55704729,
    "published": 1765572009000,
    "title": "Hate Ticketmaster? Onchain RWA tickets may succeed where regulators haven’t",
    "body": "TIX is developing a DeFi-based settlement layer for live events, using onchain tickets to unlock venue financing and simplify payouts.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55705169,
    "published": 1765573201000,
    "title": "Zcash (ZEC) Approaches Critical Breakout Zone With Bulls Targeting Higher Levels After Recent Surge",
    "body": "Zcash’s latest price movement has pushed the privacy-focused cryptocurrency back into the spotlight, as momentum builds around a potential breakout from a long-standing resistance zone. Related Reading: What’s Happening With The Bitcoin, Ethereum, And Dogecoin Prices Recently? After a sharp climb this week, traders are watching whether ZEC can extend its gains or whether technical pressures will stall the advance. The token surged more than 9% to reach around $455, standing out in a broader market that has mostly moved sideways despite renewed optimism following the U.S. Federal Reserve’s latest policy signals. Rising demand, shifting fee structures, and notable whale activity have all contributed to ZEC’s strong performance, but the technical picture remains mixed as the asset approaches a critical threshold. ZEC's price shows bullish momentum on the daily chart. Source: ZECUSD on Tradingview Dynamic Fee Proposal and Whale Demand Lift ZEC Zcash’s rally coincides with a key development effort from its contributors. Developers and Shielded Labs proposed transitioning from fixed transaction fees to a dynamic fee market, a change aimed at improving cost efficiency during periods of high activity. Market activity also intensified. Trading volumes rose sharply, and Cypherpunk Technologies expanded its ZEC holdings while adding Zcash founder Zooko Wilcox as an advisor. On-chain data indicated accumulation from large holders, including a wallet that increased its position and sent tokens to Hyperliquid to establish a long exposure. Such behavior has tightened the circulating supply at a moment when ZEC is testing historical resistance. Zcash’s broader performance this year further adds to the current market narrative. The token has posted returns exceeding 600% over the past 12 months, helped by rising investor interest in privacy assets and a constrained supply profile. ZEC Tests Multi-Touch Resistance as Bulls Aim for Continuation Despite the strong surge, Zcash now sits near a resistance zone, roughly between $460 and $485, that has repeatedly halted rallies in previous cycles. Technical readings show improving momentum on lower timeframes, supported by stable RSI levels and a constructive parabolic SAR structure. Spot inflow data has also flipped positive, suggesting buyers are re-entering rather than exiting on strength. If ZEC breaks above the $472–$485 range, analysts note potential upside targets at $506, $556, and possibly even $600–$620. Clearing this region would mark a shift from the most recent lower-high pattern and could accelerate trend continuation. Mixed Long-Term Outlook as New Cycle Signals Emerge However, some longer-term indicators raise caution. Wave analysis from multiple chart views suggests ZEC may have completed a major corrective structure earlier in the cycle, followed by a 60% decline and a weaker recovery. Bearish divergences in momentum tools and a rising parallel channel on shorter timeframes hint that the current bounce could still be corrective. A rejection at the resistance level may lead to a retracement toward $430, followed by the $370–$398 zone. A deeper breakdown could push prices below $300 if bearish structures reassert themselves. Related Reading: Do Kwon Falls Hard — Terraform Labs Chief Gets 15 Years For Wire Fraud For now, Zcash’s price action sits at a pivotal moment. A decisive move above resistance could extend the recent surge, but failure to break through may shift momentum back toward consolidation, or even a broader downtrend. Cover image from ChatGPT, ZECUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Zcash Zec|ZCash|ZEC|ZEC Price|zecusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 34,
        "NAME": "LUNA",
        "CATEGORY": "LUNA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55705144,
    "published": 1765573200000,
    "title": "Crypto Biz: How Ripple quietly convinced Wall Street",
    "body": "Ripple’s post-SEC rebound is drawing Wall Street backing, including a $40 billion valuation deal with downside protection— and some investors betting on XRP.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55705160,
    "published": 1765573197000,
    "title": "Crypto Firm Tether Moves to Take Over Italian Football Club Juventus",
    "body": "The issuer behind the most popular stablecoin said that if the bid succeeds, it prepares to invest $1 billion in the football club.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tether|Juventus|USDT|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55705911,
    "published": 1765574574000,
    "title": "Bitnomial gains CFTC approval to launch prediction markets in the US",
    "body": "The US regulator's green light lets Bitnomial’s clearinghouse support prediction markets linked to crypto and economic events, expanding its regulated product and clearing offerings.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55706260,
    "published": 1765575327000,
    "title": "These Bleak Victim Letters Helped Seal Terra Founder Do Kwon's Fate",
    "body": "The judge said the victim letters, which detailed the personal impact of the Terra collapse, were “impactful”—before sentencing Do Kwon to 15 years in prison.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "terra-luna-2|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55706935,
    "published": 1765576726000,
    "title": "Senior Vanguard analyst says Bitcoin is no better than a plush toy",
    "body": "The comments followed the asset management company’s policy change allowing its clients to trade crypto exchange-traded funds.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55707270,
    "published": 1765577501000,
    "title": "SOL struggles as Solana TVL slides and memecoin demand fades",
    "body": "SOL demand cools as its total value locked drops by $10 billion and memecoin trading slumps. Traders’ lack of appetite for long leverage could further complicate the situation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55708449,
    "published": 1765580430000,
    "title": "‘I Buy XRP From Now On,’ Says World’s Highest-IQ Claimant",
    "body": "Young Hoon Kim — the social-media personality who styles himself as the “IQ 276” record holder — just gave the XRP crowd a fresh piece of rocket fuel. “I buy XRP from now on,” Kim wrote on X on Friday, in what appears to be his first straight-up XRP shoutout after days of near-constant Bitcoin evangelizing. I buy #XRP from now on. — YoungHoon Kim, IQ 276 (@yhbryankimiq) December 12, 2025 Why The XRP Endorsement Now? And, yeah, the XRP Army did what it always does: it treated the post like a mini event. “The smartest man in the world is buying XRP,” one account, Gordon (@GordonGekko), replied — then immediately stapled the other big narrative of the day onto it: “XRP is now on Solana too. Is this the start of an XRP rally?” That second line isn’t just vibes. Solana’s official account posted “BREAKING: XRP is coming to Solana,” pointing to a wrapped-asset setup that would let XRP trade and move inside Solana DeFi rails. Hex Trust, which is positioning itself as issuer/custodian for the wrapped token (wXRP), says the product is designed to be 1:1 backed and redeemable for native XRP, using LayerZero’s OFT standard and launching “starting with Solana” (with more chains name-checked). Related Reading: Why This Market Analyst Is Warning Crypto Investors To Stop Buying XRP So Kim’s timing, intentional or not, landed right on top of a very convenient distribution channel: “XRP, but DeFi-ready.” If you’re an XRP holder who’s been watching Solana soak up memecoin liquidity and on-chain volume for the past year, that’s an easy story to forward to your group chat. The funny part is Kim’s recent persona has leaned hard into Bitcoin-maxi prophecy. In the last week alone, he made dozens of Bitcoin posts via X. On December 7, he posted: “In my personal view, Bitcoin’s current price is just a temporary discount caused by what seems to be market manipulation. I think any such manipulation may disappear within a week, and then it could start accelerating toward a new ATH.” Just a few days later, on December 10, he wrote: “My analysis suggests that Bitcoin may have set its bottom a few weeks ago, and we could now be entering a true supercycle.” One day later, he added: “”My analysis suggests that Bitcoin reaching 300K in early 2026 is a logical scenario.” Related Reading: XRP Forecast Turns Explosive As Canadian Experts Highlight Massive FinTech Utility Yesterday, Kim posted: “Bitcoin looks ready to break every prediction ever written. The real bull run begins when people think it’s already over,” before adding today: “I think Bitcoin is the money of God” and “In my view, one of the fastest ways to get rich is to stack Bitcoin.” So why the sudden XRP detour? No explanation yet, at least publicly. There’s also the reality that Kim is, politely put, controversial. Korean coverage has described him as being reported as an “IQ 276” holder tied to mind-sports organizations, but the broader profile has drawn scrutiny and debate online, with questions about verifiability and sourcing trailing the “world’s highest IQ” framing. Still, crypto doesn’t really wait for footnotes. A big claim, a big ticker, a hot comment section — and now an XRP-to-Solana headline to glue it together. That’s plenty for a one-day narrative. At press time, XRP traded at $2.04. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|bitcoin|xrp|xrp news|XRP Price|Young Hoon Kim",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55709922,
    "published": 1765584059000,
    "title": "Solana Gains Institutional Momentum as New On-Chain Bond Deal and XRP Integration Build Hype",
    "body": "Solana (SOL) is gradually entering a new phase of institutional visibility as recent developments in tokenized finance and cross-chain asset integration draw increasing attention to the network. Related Reading: What’s Happening With The Bitcoin, Ethereum, And Dogecoin Prices Recently? From a high-profile commercial paper issuance to plans for bringing XRP onto Solana, the blockchain is positioning itself at the center of experiments that could reshape how digital assets interact with traditional markets. SOL's price trends to the downside on the daily chart. Source: SOLUSD on Tradingview Institutional Activity Accelerates With New Tokenized Bond Deal J.P. Morgan’s arrangement of a $50 million tokenized commercial paper issuance for Galaxy Digital marks one of the clearest signals yet that major financial institutions are warming to public blockchain infrastructure. The short-term debt instrument was issued on Solana, with Coinbase and Franklin Templeton purchasing the tokenized asset, and settlement conducted in USDC. The bank created the on-chain token representing the bond and handled primary settlement, positioning the project as a practical test of how public networks could support regulated financial transactions. The move shows Solana’s growing role in real-world asset tokenization, a sector projected by industry analysts to reach trillions of dollars over the next decade. For Solana, the deal is also a strategic validation. While the chain is widely known for retail and developer activity, institutional adoption has historically been slower to materialize. Seeing a large financial institution test a foundational market instrument on Solana offers a clearer path to deeper enterprise use cases. Solana – XRP Integration Signals Cross-Chain Expansion Alongside the bond issuance, Solana is preparing for the arrival of XRP through a partnership with Hex Trust and LayerZero, which will issue wrapped XRP (wXRP) on the network. The integration aims to extend XRP’s liquidity and utility into Solana’s fast-moving DeFi environment, enabling lending, liquidity provision, and other decentralized applications. Hex Trust confirmed that wXRP will be fully backed 1:1 with native XRP held in segregated custody accounts, supported by more than $100 million in initial liquidity. The addition may also influence XRP’s market structure, as wrapped supply requires native XRP to be locked, potentially tightening liquidity during high-demand periods. For Solana, the asset brings an established user base and deeper liquidity pools. For XRP, the move broadens its utility across high-performance decentralized markets that prioritize low-cost transactions and throughput. A Broader Shift in Market Perception These developments come as industry figures, such as Anthony Scaramucci, publicly reiterate their bullish outlook on Solana, arguing that the network’s growth trajectory could surpass Ethereum’s in market capitalization. While the claim remains speculative, the combination of institutional pilots, cross-chain integrations, and expanding developer activity suggests Solana is strengthening its position as a platform for both consumer and enterprise-grade applications. Related Reading: Do Kwon Falls Hard — Terraform Labs Chief Gets 15 Years For Wire Fraud As more financial instruments move on-chain and cross-chain interoperability gains traction, Solana’s latest milestones point to a network increasingly aligned with where digital markets may be heading next. Cover image from ChatGPT, SOLUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Solana|Sol|SOL Price|Solana Price|SOLUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 34,
        "NAME": "LUNA",
        "CATEGORY": "LUNA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55711259,
    "published": 1765587650000,
    "title": "Dogecoin Tightens Up: Symmetrical Triangle Converges With High-Timeframe Wyckoff Setup",
    "body": "Dogecoin is entering a pivotal phase as its price action tightens within a symmetrical triangle, aligning with a high-timeframe Wyckoff setup. The combination of higher lows, compressed structure, and developing Wyckoff signals suggests growing strength beneath the surface, raising the possibility that DOGE is quietly preparing for its next major move. MTF Range Strategy: Longs At Discount, Shorts At Premium According to an update by Wyckoff Insider via the lens of a multi-timeframe (MTF) range, the focus is on seeking long positions in areas of extreme discount and short positions in areas of extreme premium. When an MTF range is present, it often develops a Wyckoff structure near both the range highs and lows, providing clearer points of interest for traders. Related Reading: Dogecoin Could Stage A 600% Rally In 2026 If This Multi-Year Support Holds Dogecoin is currently forming an 8H Bojan pivot in the extreme discount zone of this MTF range. The key to trading a Bojan pivot is identifying the Sign of Strength (SOS) that forms on the third candle. Bitcoin displayed a similar 8H Bojan recently, but trading it was more challenging due to deviations on both sides of the range, making DOGE difficult to trade also. On the lower timeframes, Dogecoin is also showing a Wyckoff Model 1 range. When the third candle opens, and price pulls down, traders look for an LPS, BOS, and internal BOS pattern. Valid entries include taking the breakout on the 3-minute BOS with a stop below the M1 low, or entering on the LPS after the internal BOS, with a stop placed beneath the LPS itself. In terms of trade management, Wyckoff Insider outlines a clear plan: risk should be kept at 2% per setup, with TP1 at the Wyckoff target zone (40%), and TP2 at the first range supply, fully closing the trade once a Sign of Weakness (SOW) appears. This structured approach helps navigate DOGE’s multi-layered Wyckoff-driven price action with discipline and clarity. Daily Structure Shows Strength Despite Downtrend Trader Tardigrade revealed that the daily chart provides clear indications that Dogecoin is actively building a stronger market structure despite the recent overall downtrend. This strength is apparent when comparing the current price action to past cycles. Related Reading: Dogecoin Price Volatility Returns as Market Weighs Bullish Indicators Against Recent Dip Historically, when the broader market is weak, DOGE typically reinforces its bearish trend by forming lower lows following a distinct new swing low. However, in a significant departure from this pattern, DOGE is now attempting to establish a higher lows structure within a symmetrical triangle pattern. This formation is key, as the analyst suggests the symmetrical triangle structure indicates that Dogecoin has been rejected from trading further downward. Such a development signals that selling exhaustion is setting in, preparing the market for a potential directional breakout. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|8H Bojan|BOS|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|LPS|MTF|Multi-TimeFrame|Sign of Strength|Sign of Weakness|SOS|SOW|TP2|Trader Tardigrade|Wyckoff Insider",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55712650,
    "published": 1765591211000,
    "title": "XRP Whale Activity Spikes At The Bottom – A Classic Pre-Rally Signal",
    "body": "XRP has been under clear pressure in recent sessions, sliding toward its lowest price of the year as the broader crypto market continues to absorb heavy selling. Sentiment remains fragile, and many traders have shifted into defensive positioning while awaiting clearer macro signals. Related Reading: Bitcoin Whales Refuse to Sell: Historic Signal Emerges As Binance CDD Drops To 2017 Levels According to a new report from CryptoQuant, however, the underlying picture is more complex than the price chart suggests. Despite the short-term decline, XRP whales are becoming increasingly active, showing no hesitation in trading and accumulating even as retail participation weakens. This divergence between whale behavior and market sentiment is noteworthy. Historically, XRP’s most significant recoveries have begun during phases of deep pessimism, when large holders quietly build exposure rather than chase rallies. The latest data confirms this pattern: while price approaches yearly lows, whale-driven transaction volume has risen, signaling that high-value wallets are repositioning rather than exiting. Whale Accumulation and CVD Shift Signal a Potential XRP Bottom The CryptoQuant report highlights that the recent surge in whale activity follows a pattern often observed during market bottoming phases. Large holders rarely accumulate aggressively during strong uptrends; instead, they tend to build positions quietly during periods of weakness, when sentiment is poor, and prices are depressed. Their willingness to buy in the current environment—while XRP trades near yearly lows—suggests strategic positioning rather than speculative momentum chasing. This behavior is typically interpreted as a pre-rally signal. When whales accumulate into weakness, it indicates confidence that current prices offer value and that the downside may be limited. Historically, such phases have preceded meaningful upside moves in XRP, as whale accumulation often absorbs available sell pressure and stabilizes market structure. Supporting this view, the report also points to a notable shift in the XRP Spot Taker CVD, which has turned taker-buy dominant. This means that aggressive buyers are now driving more of the executed volume, reflecting strengthening demand in real time. A taker-buy dominant CVD often emerges before sustained rallies, as it highlights increasing willingness among market participants to buy at the ask rather than wait for dips. Together, rising whale accumulation and a bullish CVD trend paint an increasingly constructive backdrop for XRP’s medium-term outlook. Related Reading: This Whale Isn’t Stopping: $392M Ethereum Long And A Tight Liquidation Price Revealed Price Analysis: Testing Yearly Lows as Structure Weakens XRP continues to trade near its yearly lows, with the chart showing a clear deterioration in trend structure. Price remains pinned below all major moving averages—the 50-day, 100-day, and 200-day—indicating that bullish momentum has not yet returned. The persistent rejection at the 50-day moving average throughout November and December highlights the strength of overhead resistance and the absence of sustained buying pressure from the broader market. The $2.00 region, now acting as a key horizontal support, has been tested multiple times over the past month. Each retest shows reduced volatility, suggesting that sellers are no longer driving aggressive breakdown attempts. But demand remains too weak to generate a meaningful rebound. A decisive loss of this level could open the door toward the $1.80–$1.90 support zone. XRP previously consolidated during the early stages of the 2025 rally. Related Reading: Why Ethereum’s Rally Isn’t Overheated – And Where Demand Must Grow Next Volume also confirms the broader downtrend. Selling spikes stand out noticeably, whereas buy-side volume remains muted. This imbalance reinforces the prevailing bearish structure, even as whale accumulation begins to appear on-chain. For XRP to shift out of this downtrend, bulls must reclaim the 50-day moving average and produce higher lows. Until then, the chart signals continued caution. Whale activity must begin translating into visible spot demand, or the risk skews to the downside. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|xrp|XRP Activity|XRP analysis|xrp news|XRP Price|XRP Whale|XRP Whale Accumulation|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55714054,
    "published": 1765594824000,
    "title": "Binance’s USD1 Stablecoin Push Deepens Relationship With Trump’s Crypto Platform",
    "body": "Binance, the world’s largest crypto exchange, has broadened support for USD1, the stablecoin tied to World Liberty Financial and US President Donald Trump’s crypto ventures, reports disclosed. The exchange added new spot pairs including ETH/USD1, SOL/USD1 and BNB/USD1, and enabled fee-free swaps between USD1 and other major stablecoins. Related Reading: Is Dogecoin Waking Up? Critical On-Chain Metric Explodes Higher Binance Will Shift Collateral Into USD1 The exchange will convert all collateral backing its Binance-Peg BUSD (B-Token) into USD1 at a 1:1 ratio, a process the company said should be completed within one week. This change means USD1 is being folded into its internal collateral and liquidity systems rather than remaining only a tradable token. Market Reaction And Liquidity Effects Traders reacted quickly. Price moves in BNB and other tokens showed more buying interest after the announcement. Market data snapshots suggested a short-term uptick in BNB as liquidity and trading routes were expanded by the new USD1 pairs. Reports put the token’s wider market use and the platform’s zero-fee swaps as the likely drivers. Binance to Add BNB/USD1, ETH/USD1 Trading Pairs; B-Token Collateral to Be Converted to USD1 According to an official announcement, @binance will list new spot trading pairs BNB/USD1, ETH/USD1, and SOL/USD1 at 16:00 (UTC+8) on December 11, 2025. At the same time, Binance will… pic.twitter.com/mIPrkiR3Lj — ME (@MetaEraHK) December 10, 2025 Backing, Size, And Recent Deals According to public filings and market trackers, USD1 is backed by US Treasury bills, cash and equivalents and is redeemable at a one-for-one rate with the dollar. The stablecoin has grown quickly and is now listed among the larger stablecoins by market cap, with figures around $2.7 billion cited in recent summaries. Reports have also linked USD1 to a major Abu Dhabi investment that used the token for a $2 billion deal. Political Context And Scrutiny These commercial moves come after a politically charged episode: Trump granted a pardon earlier this year to Binance’s former CEO, an action that critics say raises questions about ties between Binance and the Trump family’s crypto interests. That sequence of events has drawn scrutiny from lawmakers and commentators, who are asking for more transparency around the deals and any possible conflicts of interest. Related Reading: Do Kwon Falls Hard — Terraform Labs Chief Gets 15 Years For Wire Fraud Company spokespeople have issued short statements denying that any political favors were sought or exchanged to secure deals. Binance said its public notices focused on product rollouts, trading schedules and incentives like zero fees for certain users, while World Liberty Financial emphasized the reserve backing behind USD1. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|10 Fundamental Rights For Crypto Users|Binance|crypto|Trump|USD1|WLFI|World Liberty Financial",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55717120,
    "published": 1765602014000,
    "title": "Crypto Exchange Binance To Assist Pakistan In Tokenizing $2 Billion In Government Bonds",
    "body": "As Pakistan continues to deepen its involvement in the digital asset landscape, the country has signed a memorandum of understanding (MoU) with crypto exchange Binance, aiming to explore the tokenization of up to $2 billion in sovereign bonds, treasury bills, and commodity reserves to enhance liquidity and attract foreign investors. $2 Billion Asset Tokenization Initiative According to Reuters, the agreement sets the stage for a potential collaboration focused on allowing the tokenization and blockchain-based distribution of various real-world assets (RWAs) held by the Pakistani government. These assets may include sovereign bonds, treasury bills, and a range of commodity reserves such as oil, gas, metals, and other raw materials. Related Reading: Crypto Market Dips: The Reasons Behind Bitcoin Plunge Below $90,000 Despite FOMC Optimism The country’s finance ministry, Muhammad Aurangzeb, indicated that while the initiative could involve assets valued at up to $2 billion, final approval is still pending. The goal is to improve liquidity, transparency, and access to international markets for these assets. Aurangzeb remarked that the memorandum of understanding signifies Pakistan’s commitment to a reform-oriented economic trajectory and establishes a long-term partnership with Binance. Binance founder Changpeng Zhao expressed optimism about the agreement, calling it “a great signal for the global blockchain industry and for Pakistan.” He suggested that this partnership marks the beginning of a significant shift toward fully implementing the tokenisation initiative. PVARA Provides Initial Clearance For Binance And HTX In addition to this MoU, Pakistan has granted initial clearance for Binance and cryptocurrency exchange HTX, to register with local regulators as part of their efforts to establish domestic subsidiaries. This step allows both companies to prepare applications for full exchange licenses. The Pakistan Virtual Assets Regulatory Authority (PVARA) provided these early approvals after assessing the governance and compliance frameworks of both platforms. Chairman Bilal bin Saqib indicated that these clearances initiate Pakistan’s phased licensing process, emphasizing that the strength of compliance will play a crucial role in determining which exchanges will proceed. This move comes as Pakistan accelerates its digital finance overhaul, which has included the formation of the Pakistan Crypto Council and the establishment of the PVARA, alongside the drafting of a formal licensing regime. Related Reading: Report Reveals 65% Of Bitcoin Treasury Companies Struggling With Major Unrealized Losses As Bitcoinist reported at the time, Pakistan’s growing involvement in digital assets drew the attention of industry leaders such as Michael Saylor, co-founder of the Bitcoin proxy firm Strategy, who praised the country’s efforts and described it as a sign that the country understands how to handle this new market. Notably, Pakistan ranks as the world’s third-largest cryptocurrency market by retail activity, according to Saqib. The government is also planning a pilot program for a central bank digital currency (CBDC) and a comprehensive Virtual Assets Act. At the time of writing, the exchange’s native cryptocurrency, Binance Coin (BNB), is trading at $878, down 35% from all-time highs just above $1,369. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Binance|binance news|BNB|BNB Price|bnbusdt|crypto|crypto market|crypto news|cryptocurrency|Pakistan crypto news|Tokenization",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55718048,
    "published": 1765603973000,
    "title": "OCC Greenlights Ripple, Circle, Paxos, BitGo, Fidelity As Crypto Banks",
    "body": "The OCC just provided conditional approval to a broad swath of five different companies that adds diveristy and depth to crypto and stablecoins under federal supervision.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55718249,
    "published": 1765604244000,
    "title": "Crypto groups slam Citadel for urging tighter DeFi tokenization rules",
    "body": "The DeFi Education Fund has led a rebuttal to Citadel Securities’ call for the SEC to bring DeFi platforms under securities laws if dealing in tokenized stocks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 55720572,
    "published": 1765609250000,
    "title": "Kalshi To Power Coinbase New Internal Prediction Platform, Insider Reveals",
    "body": "According to a report from CNBC, Coinbase (COIN), the largest cryptocurrency exchange in the US, is preparing to launch its own prediction market in collaboration with Kalshi, one of the largest federally regulated financial exchanges in the country. Coinbase Teases Major Updates The anticipation surrounding the prediction market has been building for nearly a month. Recently, a screenshot of what appears to be Coinbase’s prediction markets dashboard was shared by Silicon Valley researcher Jane Manchun Wong in a post on social media site X (previously Twitter), shedding some light on the features of the forthcoming product. Related Reading: Crypto Market Dips: The Reasons Behind Bitcoin Plunge Below $90,000 Despite FOMC Optimism The Information first indicated on November 19 that Coinbase planned to introduce these prediction markets powered by Kalshi, with a formal unveiling set for the “Coinbase System Update” event scheduled for December 17. Formal announcements regarding this new platform are expected soon, potentially as early as next week. Bloomberg corroborated this report, stating that the cryptocurrency exchange is also likely to announce a tokenized stock offering during the same event, in line with Tether’s same vision reported earlier this week. While Coinbase has refrained from confirming these developments directly to CNBC, the company has encouraged stakeholders to tune in to its upcoming event for more details. The firm did not disclose a specific timeline for when the prediction markets will become available to users. ‘Everything Exchange’ Status Coinbase’s push to launch a prediction market is part of a broader strategy to transform itself into an “everything exchange”—a comprehensive platform for trading a wide variety of assets, including cryptocurrencies, tokenized stocks, and event contracts. CEO Brian Armstrong articulated this vision earlier in May, stressing that the cryptocurrency exchange aims to evolve into a leading financial services application within the next decade. This development comes as Coinbase faces increasing competition from rivals like Robinhood (HOOD), Gemini (GEMI), and Kraken, all of whom have introduced tokenized equity offerings for users outside the US and are exploring prediction markets to varying extents. Related Reading: Report Reveals 65% Of Bitcoin Treasury Companies Struggling With Major Unrealized Losses Coinbase is expanding its range of financial instruments while making a series of acquisitions this year. These include major deals such as the purchase of the crypto derivatives exchange Deribit and the on-chain advertising firm Spindl, as well as seven other major acquisitions. This also follows a shift in investor sentiment in the digital asset space, with the largest cryptocurrencies — including Bitcoin (BTC) — having retraced by over 30% since October amid fears of a new bear market beginning. Over the past months, the exchange’s stock, which trades under the ticker name COIN, has also seen a significant drop of over 39%, with the current valuation standing at $267 per share. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Coinbase|coin|coinbase|coinbase news|Coinbase prediction market|crypto|crypto market|crypto news|cryptocurrency|Kalshi",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]